{
	"tt52up": "Kurze eindeutige IDs generieren",
	"tt75ra": "{name}{pronounced} ist eine Open-Source-Bibliothek, die es Ihnen ermöglicht, kurze eindeutige Bezeichner aus Zahlen zu generieren. Diese IDs sind URL-sicher, können mehrere Zahlen codieren und enthalten keine gängigen unangemessenen Wörter.",
	"ttd0n6": "Mehr lesen",
	"ttf0dj": "So sehen sie aus:",
	"ttspqb": "Anwendungsfälle",
	"tt810r": "Der Hauptzweck von {name} ist rein visuell. Wenn Sie in Ihrem Projekt IDs anstelle von Zahlen verwenden möchten, könnte {name} eine gute Wahl sein.",
	"ttfxdj": "Gut für",
	"ttcn90": "Nicht gut für",
	"ttxrw3": "Primärschlüssel codieren",
	"ttblk8": "Wenn Sie eine relationale Datenbank verwenden",
	"ttw5eb": "Datenbankabfragen sparen",
	"ttrzg4": "Durch Codieren mehrerer Objekte",
	"ttj376": "Temporäre Anmelde-Token",
	"ttor8c": "Schimpfwortfrei und URL-sicher",
	"ttzbtd": "Sensible Daten",
	"tt3bzl": "Dies ist keine Verschlüsselungsbibliothek",
	"ttm1yo": "Benutzer-IDs",
	"ttt7ff": "Kann die Benutzeranzahl preisgeben, wenn jemand das Codierungsalphabet herausfindet",
	"tte6as": "Fragen",
	"ttl1c7": "Spielplatz",
	"ttgq43": "Bibliothek",
	"ttaf1b": "Funktionen",
	"ttz5td": "Kurze IDs aus nicht-negativen Zahlen generieren",
	"ttncim": "Einfache Codierung und Dekodierung",
	"ttimoo": "Automatisch generierte IDs enthalten keine üblichen Schimpfwörter",
	"tty56c": "Unterstützung für benutzerdefinierte IDs durch gemischtes Alphabet",
	"tt6v30": "Jede Version erzeugt dieselben IDs",
	"tthejy": "Kleine Bibliothek mit einer großzügigen Lizenz",
	"tt0ds2": "{count} Integrationen ({new} mit neuem Design)",
	"tt9vmk": "Loslegen",
	"ttpebs": "Was benutzt du?",
	"ttkph9": "Kann es nicht finden",
	"tt1ap4": "Lass es uns wissen?",
	"tt445i": "Beispiel",
	"ttqewx": "Alphabet",
	"tttnnf": "Zahlen",
	"tt52lu": "Generierte ID",
	"tt74ur": "mischen",
	"ttdosn": "Mischen",
	"ttfisd": "neu",
	"ttswbq": "Schlagen Sie eine Bearbeitung des Textes vor",
	"tt8qp0": "Sponsor",
	"ttfiwd": "Beliebt",
	"ttcyi9": "Frage stellen",
	"ttxagw": "Einen Fehler gefunden?",
	"ttbjck": "{name} wurde aufgerüstet und neu gebrandet",
	"ttw1ue": "{what} auf {github} markieren",
	"ttr5tg": "Schnelles Kodierungs- & Dekodierungsbeispiel:",
	"ttjgz7": "Wenn IDs zu kurz sind, können Sie sie auf eine bestimmte Länge auffüllen:",
	"ttosg8": "Erstellen Sie eindeutige IDs durch Mischen des Alphabets:",
	"ttzdkt": "Die vollständige Dokumentation befindet sich unter",
	"tt3fkz": "Erste Schritte",
	"ttm3py": "Wenn Sie nach dem originalen {name} suchen, finden Sie es hier:",
	"tttnrf": "{name} für {lang} ist noch nicht fertig.",
	"ttep3a": "Bitte markieren Sie das Repository, um es in unserer To-do-Liste nach oben zu verschieben:",
	"ttlmpc": "Wenn Sie helfen möchten, diese Version zum Leben zu erwecken, gibt es einen FAQ-Bereich dazu:",
	"ttgux4": "Wie kann man {name} in eine andere Sprache übertragen?",
	"ttabd1": "Wenn Sie das originale {name}-Projekt suchen, finden Sie es hier:",
	"ttzdut": "Bitte beachten Sie, dass es nach Fertigstellung dieser Version nicht mit dem aktuellen Algorithmus kompatibel sein wird.",
	"ttn89i": "{name} ist eine Open-Source-Bibliothek, mit der Sie kurze eindeutige IDs aus Zahlen generieren können. Es unterstützt {count} Programmiersprachen.",
	"tti0yo": "Kurze eindeutige IDs in {lang}",
	"ttyzu6": "Generieren Sie kurze eindeutige IDs in {lang} mit {name}. Diese Kennungen sind URL-sicher, können mehrere Zahlen codieren und enthalten keine gängigen unangemessenen Wörter.",
	"tt6t23": "{name}-Spielplatz. Entdecken Sie die {name}-Codierungs- und Decodierungsbibliothek.",
	"tthraj": "Häufig gestellte Fragen für {name}.",
	"tt0xns": "Mindestlänge",
	"tt962m": "Blockliste",
	"ttphab": "Fügen Sie Ihre eigenen benutzerdefinierten Wörter durch Leerzeichen getrennt hinzu...",
	"ttk7bh": "Verwenden Sie auch die standardmäßige Blockliste",
	"tt1k1p": "Standard",
	"tt42u5": "Kurz",
	"ttqaex": "Lang",
	"tttiif": "Buchstaben",
	"tt5lcu": "Kleinbuchstaben",
	"tt75vr": "Großbuchstaben",
	"ttd8qn": "Liste",
	"ttfoqd": "Kodieren",
	"ttsekq": "Dekodieren",
	"tt8xb0": "Mehrere encodieren",
	"ttfoed": "Eine zusätzliche Null encodieren",
	"ttc6o9": "Eine große Konstante encodieren",
	"ttx14w": "ID",
	"ttb79k": "Diese Zahlen encodieren:",
	"ttwpve": "Wird produzieren:",
	"ttrufg": "Diese ID decodieren:",
	"ttj4t7": "Das Alphabet muss mindestens {count} Zeichen lang sein",
	"ttoq48": "Leerzeichen im Alphabet werden ignoriert",
	"ttznht": "Blocklist-Wörter, die weniger als {count} Zeichen lang sind, werden ignoriert",
	"tt3dhz": "Block",
	"ttmzby": "Allgemein",
	"tttigf": "Wofür ist es gut?",
	"ttebza": "Wofür ist es nicht gut?",
	"ttlybc": "Kann ich mehrere Zahlen gleichzeitig encodieren?",
	"ttgvw4": "Sind generierte IDs einzigartig?",
	"ttakn1": "Welche Einschränkungen hat {name}?",
	"ttznvt": "Beitragen",
	"ttn0mi": "Tücken",
	"ttis6o": "Polsterung",
	"ttytv6": "Wie kann ich meine IDs einzigartig machen?",
	"tt6fl3": "Wie kann ich das Standardalphabet mischen?",
	"tthg1j": "Ist es besser, ein kürzeres oder längeres Alphabet zu verwenden?",
	"tt0wis": "Kann mein Alphabet nur aus Zahlen bestehen?",
	"tt93lm": "Kann ich Emojis als das Alphabet verwenden?",
	"ttpj1b": "Warum IDs auffüllen?",
	"ttkrkh": "Kann ich generierte IDs länger machen?",
	"tt1jbp": "Kann ich generierte IDs auf eine bestimmte Länge machen?",
	"tt4lv5": "Warum eine Blockliste verwenden?",
	"ttq1ax": "Wie funktioniert die Blockliste?",
	"tttoof": "Welche Wörter sind in der Standardblockliste?",
	"tt5c9u": "Was passiert, wenn alle IDs blockiert sind?",
	"tt7u2r": "Wie überprüfe ich, ob IDs gültig sind?",
	"ttd0xn": "Was passiert, wenn die Standardblockliste aktualisiert wird?",
	"ttf8xd": "Kann das Encodieren unterschiedlicher Zahlen identische IDs erzeugen?",
	"ttsahq": "Was ist {name}?",
	"tt8wk0": "Warum wurde {hashids} zu {name} aktualisiert?",
	"ttf8ad": "Warum wurde der {salt}-Parameter entfernt?",
	"ttc389": "Ist {hashids} mit {name} kompatibel?",
	"ttxp5w": "Wie kann ich sicher von {hashids} zu {name} aktualisieren?",
	"ttbrmk": "Wo finde ich die Original-{hashids}-Bibliotheken?",
	"ttwb2e": "Wie kann ich beitragen?",
	"ttrvdg": "Wie portiert man {name} in eine andere Sprache?",
	"ttj5f7": "{name} ist eine kleine Open-Source-Bibliothek, die kurze, eindeutige, zufällig aussehende IDs aus Zahlen generieren kann.",
	"ttox58": "Die beste Möglichkeit, darüber nachzudenken, ist wie ein Dezimal-Hexadezimal-Umwandler, jedoch mit einigen zusätzlichen Funktionen.",
	"ttzijt": "Linkverkürzung, Generierung eindeutiger Ereignis-IDs für Protokollierung, Erzeugung von IDs für Produkte/Objekte auf einer Website (ähnlich wie YouTube für Videos), Erzeugung kurzer IDs für Textnachrichten, Bestätigungscodes in E-Mails usw.",
	"tt3njz": "Alle Daten, die sensibel sind. Generierte IDs sind keine Hashes und könnten in Zahlen zurückdekodiert werden. Sie könnten zum Beispiel keine gute Wahl für Benutzer-IDs sein, da sie einmal dekodiert Ihre App-Benutzeranzahl preisgeben könnten.",
	"ttmtky": "Ja. {name} kann eine oder viele nicht-negative Zahlen in eine einzelne ID encodieren. Es gibt keine Begrenzung, wie viele Zahlen Sie encodieren können, aber es gibt eine Grenze, wie groß eine Zahl sein kann (abhängig von der Implementierungssprache).",
	"ttto4f": "Dies ist aus mehreren Gründen nützlich: Sie könnten einen UNIX-Zeitstempel encodieren und ablaufende IDs erstellen oder eine Datenbank-Shard-Nummer zusammen mit einem Primärschlüssel encodieren und sich so zusätzliche Datenbankabfragen sparen.",
	"ttekta": "Ja, generierte IDs sind einzigartig für die Eingabe und das Alphabet.",
	"ttl6kc": "Denken Sie jedoch daran, dass das Standardalphabet sowohl Groß- als auch Kleinbuchstaben enthält, daher sind Standard-IDs Groß- und Kleinschreibung beachtend.",
	"ttg2e4": "{name} kann keine negativen Zahlen encodieren.",
	"ttahi1": "Die Mindestlänge des Alphabets beträgt {length} Zeichen.",
	"ttzi2t": "Das Alphabet kann keine mehrbyte Zeichen enthalten.",
	"ttnsyi": "{name} kann keine IDs bis zu einer bestimmten Länge generieren, sondern nur mindestens eine bestimmte Länge. Der Bereich des Mindestlängenparameters liegt zwischen {min} und {max}.",
	"ttiq3o": "{name} kann versuchen, IDs bis zur Alphabetlänge, abzüglich einer, zu regenerieren.",
	"ttyf26": "Die Bibliothek akzeptiert ein benutzerdefiniertes Alphabet, aus dem IDs generiert werden können. Mischen Sie einfach das Standardalphabet, das bereitgestellt wird.",
	"tt6dc3": "Bitte beachten Sie, dass jemand bei ausreichendem Aufwand Ihr gemischtes Alphabet rückentwickeln könnte, daher handelt es sich keineswegs um eine Technik, um sensible Daten zu verstecken.",
	"tth4pj": "Das Standardalphabet finden Sie [hier]({url}).",
	"tt0eos": "Sie können jedes der Online-Tools zum Umordnen von Zeichenfolgen oder unseren [Playground](/playground) verwenden.",
	"tt9zcm": "Abhängig von Ihrem Anwendungsfall. Ein kürzeres Alphabet wird längere IDs produzieren, und ein längeres Alphabet wird kürzere IDs produzieren. Sie können den [Playground](/playground) verwenden, um zu testen, wie Ihre IDs aussehen könnten.",
	"ttp7pb": "Ja. Beachten Sie, dass generierte IDs immer noch Zeichenketten sind und mit einer Null beginnen könnten.",
	"ttk4jh": "Nein. {name} unterstützt keine mehrbyte Zeichen für das Alphabet. Das schließt Emojis sowie viele andere Zeichen ein.",
	"tt17kp": "Die Bibliothek kann IDs mit Junkzeichen verlängern, um sie länger erscheinen zu lassen. Dies ist nützlich, damit nicht offensichtlich ist, ob Sie eine kleine Zahl wie {min} oder eine große Zahl wie {max} encodieren.",
	"tt4c25": "Das Decodieren ist nicht betroffen.",
	"ttqp1x": "Ja, die Bibliothek akzeptiert einen Mindestlängenparameter, der garantiert, dass IDs mindestens diese Länge haben werden.",
	"ttt88f": "Bitte beachten Sie, dass es keine Garantie dafür gibt, wie lang Ihre IDs sein werden - nur dass sie nicht kürzer sein werden als die von Ihnen angegebene Länge.",
	"tt59mu": "Bis zu einem gewissen Punkt.",
	"tt7vlr": "Die Festlegung einer maximalen Länge ist unmöglich, da Ihre IDs früher oder später bei ausreichend großem Input überlaufen werden. Deshalb wird nur der Mindestlängenparameter unterstützt, und die genaue Länge oder maximale Länge nicht.",
	"ttdswn": "Eine Blockliste kann verhindern, dass bestimmte Wörter in Ihren IDs erscheinen. Dies ist vorteilhaft, da generierte IDs dazu bestimmt sind, an öffentlichen Orten wie der URL angezeigt zu werden.",
	"ttf0wd": "{name} wird mit der [Standard-Blockliste]({url}) geliefert, die die grundlegendsten Schimpfwörter und unangemessenen Wörter aus mehreren Sprachen enthält. Sie können diese Blockliste natürlich um eigene Wörter erweitern.",
	"tts1jq": "Die Übereinstimmung von Blocklistenwörtern ist nicht auf Groß- und Kleinschreibung empfindlich.",
	"tt8eh0": "Kurze Wörter mit weniger als 3 Zeichen werden nicht blockiert. Wörter mit 3 Zeichen müssen genau mit IDs übereinstimmen. Wörter mit 4 oder mehr Zeichen lösen einen Treffer aus, wenn sie ein Teil der ID sind.",
	"ttf01d": "Wenn Blocklist-Wörter Zahlen (Leetspeak) enthalten, lösen sie nur einen Treffer aus, wenn sie am Anfang oder Ende der ID stehen.",
	"ttcz09": "Die Standard-Blockliste enthält die gängigsten Schimpfwörter und unangemessenen Wörter aus mehreren Sprachen. Die komplette Liste finden Sie [hier]({url}).",
	"ttxbuw": "Wenn die generierte ID mit einem Wort in der Blockliste übereinstimmt, versucht die Bibliothek, sie neu zu generieren.",
	"ttbgyk": "Wenn jeder einzelne Versuch, die ID neu zu generieren, fehlschlägt, wird die Encode-Funktion fehlschlagen und einen Fehler zurückgeben. Die Bearbeitung dieses Fehlers liegt beim Benutzer.",
	"ttwkle": "Der beste Weg, die Anzahl der Regenerationsversuche zu verringern, besteht darin, ein längeres Alphabet zu haben, keine Mindestlänge festzulegen und eine kleinere Blockliste bereitzustellen. Das Bereitstellen einer leeren Blockliste deaktiviert die Funktion vollständig.",
	"ttr2ng": "Das Decodieren von IDs wird normalerweise eine Art numerische Ausgabe erzeugen, aber das bedeutet nicht unbedingt, dass die ID kanonisch ist. Um zu überprüfen, ob die ID gültig ist, können Sie decodierte Zahlen erneut encodieren und überprüfen, ob die ID übereinstimmt.",
	"ttjud7": "Der Grund, warum dies nicht automatisch erfolgt, ist, dass wir nicht möchten, dass bei einer zukünftigen Änderung der Standard-Blockliste automatisch die ID ungültig wird, die in der Vergangenheit generiert wurde und möglicherweise jetzt mit einem neuen Blocklistenwort übereinstimmt.",
	"ttowu8": "Wir werden sicherstellen, das {changelog} zu aktualisieren, wenn und falls sich die Standard-Blockliste ändert.",
	"ttzo7t": "Sie müssen Szenarien berücksichtigen, in denen ein neues Wort in die Standard-Blockliste aufgenommen wird. In diesem Fall kann das erneute Codieren von Zahlen eine andere ID erzeugen.",
	"tt3i7z": "Der beste Weg, sicherzustellen, dass Ihre IDs auch bei zukünftigen Updates konsistent bleiben, besteht darin, eine benutzerdefinierte Blockliste bereitzustellen, auch wenn sie identisch mit der aktuellen Standard-Blockliste ist.",
	"ttmfhy": "Nein, das Codieren unterschiedlicher Zahlen ergibt eindeutige IDs.",
	"ttt85f": "Allerdings können aufgrund des Algorithmus-Designs beim Decodieren zufälliger IDs manchmal die gleichen Zahlen erzeugt werden. Der beste Weg, zu überprüfen, ob die ID kanonisch ist, besteht darin, einfach decodierte Zahlen erneut zu codieren und zu überprüfen, ob die ID übereinstimmt.",
	"ttehfa": "{hashids} war die erste Version dieser Bibliothek, die ungefähr 2013 herauskam. Sie erzeugte auch kurze IDs, verwendete jedoch eine etwas andere Methode.",
	"ttl3hc": "{hashids} behandelte einige Dinge anders.",
	"ttgla4": "Es unterstützte keine benutzerdefinierte Blockliste, sondern verließ sich stattdessen auf die häufigsten englischen Schimpfwörter. Es verwendete auch den {salt}-Parameter, um das Alphabet zu mischen, was ein wenig verwirrend war, weil die Bibliothek nichts mit Verschlüsselung zu tun hat. Außerdem verwendete es zu viele reservierte Zeichen, was zu längeren IDs führte.",
	"ttajo1": "Deshalb haben wir beschlossen, ein Upgrade durchzuführen und neu zu positionieren. Der Algorithmus wurde vereinfacht, einige Funktionen wurden hinzugefügt, und die Code-Repositories sind jetzt alle unter [einem Dach]({url}).",
	"ttzolt": "Der {salt}-Parameter wurde verwendet, um das Alphabet zu mischen, und er sollte nie mit Sicherheit oder Schutz in Verbindung gebracht werden. Sowohl {hashids} als auch {name} arbeiten ähnlich wie die Dezimal- zu Hexadezimalumwandlung, jedoch mit einigen Anpassungen. Es gibt keine Art von Verschlüsselung, daher wurde dieser Parameter vollständig entfernt, um Verwirrung zu vermeiden.",
	"ttnq6i": "Nein, {name} erweitert die Funktionalität von {hashids} und hat unterschiedliche Designziele und Anforderungen; daher sind die generierten IDs nicht mit {hashids} kompatibel.",
	"ttixzo": "Da es keine Kompatibilität zwischen {hashids} und {name} gibt, ist es unmöglich, einfach {hashids} durch {name} zu ersetzen.",
	"ttydl6": "Sie können sie jedoch zusammenführen, indem Sie unterscheiden, welches ID zu welcher Bibliothek gehört.",
	"tt6n93": "Eine Möglichkeit, dies zu tun, ist die ID-Länge - wenn Sie zu {name} wechseln, können Sie eine höhere Mindestlänge angeben. Eine andere Möglichkeit ist das manuelle Anhängen/Voranstellen eines benutzerdefinierten Zeichens an die neu generierten IDs.",
	"tth5bj": "Schließlich könnten Sie auch versuchen, eine ID mit {hashids} zu decodieren, um zu sehen, ob sie gültig ist. Wenn nicht, decodieren und codieren Sie sie mit {name}, um zu sehen, ob das funktioniert.",
	"tt0a8s": "Jede Sprachimplementierung auf dieser Website verlinkt zum originalen {hashids}-Repository, sofern vorhanden.",
	"tt9t9m": "Wenn Sie das Projekt unterstützen möchten, würden wir es begrüßen, wenn Sie unsere Repos auf Github mit einem Stern versehen, um die Sichtbarkeit zu erhöhen.",
	"ttpgkb": "Wenn Sie ein Entwickler sind und keine Implementierung von {name} für eine bestimmte Sprache sehen, helfen Sie uns bitte, die Bibliothek umzusetzen. Das Gleiche gilt für eine Programmiersprache, die nicht aufgeführt ist.",
	"ttk57h": "Wenn Sie einen Fehler in der Spezifikation oder einer der Implementierungen sehen, erstellen Sie bitte ein Problem oder einen Pull-Request mit einem vorgeschlagenen Fix im entsprechenden Repository.",
	"tt1rhp": "Wenn Sie mehrere Sprachen sprechen, könnten wir Ihre Hilfe beim [Feinabstimmen der Blockliste]({blocklist}) und beim [Anpassen der Website-Übersetzungen]({i18n}) gebrauchen, wenn Sie Probleme sehen.",
	"tt49l5": "Schließlich, wenn Sie Erfahrung mit {hashids}/{name} haben, helfen Sie bitte unserer Community, indem Sie Fragen beantworten, die jemand haben könnte.",
	"ttqbpx": "Wenn Sie {name} in eine der folgenden Sprachen portieren möchten (oder in eine neue, die hier nicht aufgeführt ist):",
	"ttt00f": "Forken Sie das offizielle Repo in Ihr eigenes Github-Konto und implementieren Sie [die Spezifikation]({spec}) zusammen mit allen Tests. Sie können eines der vorhandenen READMEs wiederverwenden ([Beispiel]({example})).",
	"tt5myu": "Sobald die Bibliothek fertig ist, erstellen Sie einen Pull-Request. Nach der Zusammenführung werden wir die Website aktualisieren.",
	"tt72cr": "Wenn das Repo keine aktiven Maintainer hat, würden wir uns freuen, Sie einzuladen, das Repo zu verwalten und offizieller Maintainer zu werden.",
	"ttdqen": "Wenn Sie Experte in den folgenden Bereichen sind, kontaktieren Sie uns, wenn Sie die Bibliothek portieren möchten:",
	"ttfsed": "Nicht gefunden",
	"ttsp7q": "Andere",
	"tt8aj0": "Versuche:",
	"ttfspd": "[{clickhouse}]({url1}) bietet eine eingebaute SQL-Funktion zur Erzeugung von {name} mit Standardparametern an. Die Funktion ist seit {clickhouse} [{version}]({url2}) verfügbar:"
}
