{
	"tt52up": "Generate Short Unique IDs",
	"tt75ra": "{name}{pronounced} is an open-source library that lets you generate short unique\n\t\tidentifiers from numbers. These IDs are URL-safe, can encode several numbers, and do not contain\n\t\tcommon profanity words.",
	"ttd0n6": "Read more",
	"ttf0dj": "This is what they look like:",
	"ttspqb": "Use Cases",
	"tt810r": "The main use of {name} is purely visual. If you'd like to use IDs instead of numbers in your project, {name} could be a good choice.",
	"ttfxdj": "Good For",
	"ttcn90": "Not Good For",
	"ttxrw3": "Encoding primary keys",
	"ttblk8": "If you're using a relational database",
	"ttw5eb": "Saving database lookups",
	"ttrzg4": "By encoding multiple objects",
	"ttj376": "Temporary login tokens",
	"ttor8c": "Profanity-free and URL-safe",
	"ttzbtd": "Sensitive data",
	"tt3bzl": "This is not an encryption library",
	"ttm1yo": "User IDs",
	"ttt7ff": "Can reveal user count if anyone finds out the encoding alphabet",
	"tte6as": "FAQ",
	"ttl1c7": "Playground",
	"ttgq43": "Library",
	"ttaf1b": "Features",
	"ttz5td": "Generate short IDs from non-negative numbers",
	"ttncim": "Easy encoding & decoding",
	"ttimoo": "Auto-generated IDs do not contain common profanity",
	"tty56c": "Support for custom IDs through shuffled alphabet",
	"tt6v30": "Every version produces the same IDs",
	"tthejy": "Small library with a permissive license",
	"tt0ds2": "{count} integrations ({new} using new design)",
	"tt9vmk": "Get started",
	"ttpebs": "What are you using?",
	"ttkph9": "Can't find it",
	"tt1ap4": "Let us know about it?",
	"tt445i": "Example",
	"ttqewx": "Alphabet",
	"tttnnf": "Numbers",
	"tt52lu": "Generated ID",
	"tt74ur": "shuffle",
	"ttdosn": "Shuffle",
	"ttfisd": "new",
	"ttswbq": "Suggest text translation edit",
	"tt8qp0": "Sponsors",
	"ttfiwd": "Popular",
	"ttcyi9": "Ask a question",
	"ttxagw": "Found a bug?",
	"ttbjck": "{name} has been upgraded & rebranded",
	"ttw1ue": "Star {what} on {github}",
	"ttr5tg": "Quick encode & decode example:",
	"ttjgz7": "If IDs are too short, you can pad them to a certain length:",
	"ttosg8": "Create unique IDs by shuffling the alphabet:",
	"ttzdkt": "Full documentation is at",
	"tt3fkz": "Get Started",
	"ttm3py": "If you're looking for the original {name}, you can find it here:",
	"tttnrf": "{name} for {lang} is not yet ready.",
	"ttep3a": "Please star the repo to move it up our todo list:",
	"ttlmpc": "If you'd like to help bring this version to life, there's an FAQ section on how to do that:",
	"ttgux4": "How to port {name} to another language?",
	"ttabd1": "If you're looking for the original {name} project, you can find it here:",
	"ttzdut": "Please note that it will not be compatible with the current algorithm once this version is done.",
	"ttn89i": "{name} is an open-source library that lets you generate short unique IDs from numbers. It supports {count} programming languages.",
	"tti0yo": "Short Unique IDs in {lang}",
	"ttyzu6": "Generate short unique IDs in {lang} using {name}. These identifiers are URL-safe, can encode several numbers, and do not contain common profanity words.",
	"tt6t23": "{name} playground. Explore {name} encoding and decoding library.",
	"tthraj": "Frequenty Asked Questions for {name}.",
	"tt0xns": "Minimum Length",
	"tt962m": "Blocklist",
	"ttphab": "Add your own custom words separated by spaces…",
	"ttk7bh": "Use the default blocklist as well",
	"tt1k1p": "Default",
	"tt42u5": "Short",
	"ttqaex": "Long",
	"tttiif": "Letters",
	"tt5lcu": "Lowercase",
	"tt75vr": "Uppercase",
	"ttd8qn": "List",
	"ttfoqd": "Encode",
	"ttsekq": "Decode",
	"tt8xb0": "Encode a multiple",
	"ttfoed": "Encode an extra zero",
	"ttc6o9": "Encode a large constant",
	"ttx14w": "ID",
	"ttb79k": "Encoding these numbers:",
	"ttwpve": "Will produce:",
	"ttrufg": "Decoding this ID:",
	"ttj4t7": "Alphabet must be at least {count} characters long",
	"ttoq48": "Alphabet spaces will be ignored",
	"ttznht": "Blocklist words less than {count} characters long will be ignored",
	"tt3dhz": "block",
	"ttmzby": "General",
	"tttigf": "What is it good for?",
	"ttebza": "What is it not good for?",
	"ttlybc": "Can I encode several numbers at once?",
	"ttgvw4": "Are generated IDs unique?",
	"ttakn1": "What limitations does {name} have?",
	"ttznvt": "Contribute",
	"ttn0mi": "Gotchas",
	"ttis6o": "Padding",
	"ttytv6": "How can I make my IDs unique?",
	"tt6fl3": "How can I shuffle the default alphabet?",
	"tthg1j": "Is it better to use a shorter or longer alphabet?",
	"tt0wis": "Can my alphabet consist of only numbers?",
	"tt93lm": "Can I use emojis as the alphabet?",
	"ttpj1b": "Why pad IDs?",
	"ttkrkh": "Can I make generated IDs longer?",
	"tt1jbp": "Can I make generated IDs a specific length?",
	"tt4lv5": "Why use a blocklist?",
	"ttq1ax": "How does the blocklist work?",
	"tttoof": "What words are in the default blocklist?",
	"tt5c9u": "What happens when all IDs are blocked?",
	"tt7u2r": "How to check if IDs are valid?",
	"ttd0xn": "What happens when the default blocklist gets updated?",
	"ttf8xd": "Can encoding different numbers produce identical IDs?",
	"ttsahq": "What is {name}?",
	"tt8wk0": "Why was {hashids} upgraded to {name}?",
	"ttf8ad": "Why was the {salt} parameter removed?",
	"ttc389": "Is {hashids} compatible with {name}?",
	"ttxp5w": "How can I safely upgrade from {hashids} to {name}?",
	"ttbrmk": "Where can I find the original {hashids} libraries?",
	"ttwb2e": "How can I contribute?",
	"ttrvdg": "How to port {name} to another language?",
	"ttj5f7": "{name} is a small open-source library that can produce short, unique, random-looking IDs from numbers.",
	"ttox58": "The best way to think about it is like a decimal-to-hexadecimal converter, but with a few extra features.",
	"ttzijt": "Link shortening, generating unique event IDs for logging, generating IDs for products/objects on a website (like YouTube does for videos), generating short IDs for text messages, confirmation codes in emails, etc.",
	"tt3njz": "Any data that's sensitive. Generated IDs are not hashes and could be decoded back into numbers. For example, they might not be a good choice for user IDs, because once decoded, they could reveal your app's user count.",
	"ttmtky": "Yes. {name} can encode one or many non-negative numbers into a single ID. There is no limit to how many numbers you can encode, but there is a limit to how big of a number you can encode (depending on the implementation language).",
	"ttto4f": "This is useful for several reasons: you could encode a UNIX timestamp and create expiring IDs, or you could encode a database shard number along with a primary key and save up on extra database queries.",
	"ttekta": "Yes, generated IDs are unique to the input and the alphabet.",
	"ttl6kc": "Keep in mind though that the default alphabet contains both uppercase and lowercase letters, so default IDs are case-sensitive.",
	"ttg2e4": "{name} cannot encode negative numbers.",
	"ttahi1": "The minimum alphabet length is {length} characters.",
	"ttzi2t": "The alphabet cannot contain any multibyte characters.",
	"ttnsyi": "{name} cannot generate IDs up to a certain length, only at least a certain length. The minimum length parameter range is between {min} and {max}.",
	"ttiq3o": "{name} can attempt to regenerate IDs up to alphabet length, minus one.",
	"ttyf26": "The library accepts a custom alphabet from which it can generate IDs. Simply pre-shuffle the default alphabet that's provided.",
	"tt6dc3": "Please keep in mind that given enough effort, somebody could reverse-engineer your shuffled alphabet, so this is by no means a technique to hide sensitive data.",
	"tth4pj": "The default alphabet can be found [here]({url}).",
	"tt0eos": "You can use any of the online string shuffling tools or our [playground](/playground).",
	"tt9zcm": "Depends on your use case. A shorter alphabet will produce longer IDs, and a longer alphabet will produce shorter IDs. You can use the [playground](/playground) to test how your IDs might look.",
	"ttp7pb": "Yes. Keep in mind that generated IDs are still strings and they might start with a zero.",
	"ttk4jh": "No. {name} does not support multibyte characters for the alphabet. That includes emojis as well as many other characters.",
	"tt17kp": "The library can extend IDs with junk characters to make them appear longer. This is useful so that it's not as obvious whether you're encoding a small number like {min} or a large number like {max}.",
	"tt4c25": "Decoding is not affected.",
	"ttqp1x": "Yes, the library accepts a minimum length parameter which guarantees that IDs will be at least that length.",
	"ttt88f": "Please note that there's no guarantee on how long your IDs will be — only that they will not be shorter than the length you specify.",
	"tt59mu": "Up to a point.",
	"tt7vlr": "Setting max length is impossible because sooner or later your IDs will overflow given a big enough input. That's why only the minimum length parameter is supported, and the exact length or maximum length is not.",
	"ttdswn": "A blocklist can prevent certain words from appearing in your IDs. This is beneficial because generated IDs are meant to appear in public places, like the URL.",
	"ttf0wd": "{name} comes with the [default blocklist]({url}) that contains the most basic profanity and inappropriate words from several languages. You can of course extend that blocklist with your own words.",
	"tts1jq": "Blocklist word matching is case-insensitive.",
	"tt8eh0": "Short words less than 3 characters long will not be blocked. Words 3 characters long have to match IDs exactly. Words 4 characters or longer will trigger a match if they're a substring of the ID.",
	"ttf01d": "If blocklist words contain numbers (leetspeak), they will only trigger a match if they're at the beginning or the end of the ID.",
	"ttcz09": "The default blocklist contains the most common profanity and inappropriate words from several languages. You can find the complete list [here]({url}).",
	"ttxbuw": "When the generated ID matches a word in the blocklist, the library attempts to regenerate it.",
	"ttbgyk": "If every single attempt fails to regenerate the ID, the encode function will fail and return an error. Handling that error is up to the user.",
	"ttwkle": "The best way to decrease the number of regeneration attempts is to have a longer alphabet, not set a minimum length, and provide a smaller blocklist. Providing an empty blocklist will disable the feature completely.",
	"ttr2ng": "Decoding IDs will usually produce some kind of numeric output, but that doesn't necessarily mean that the ID is canonical. To check that the ID is valid, you can re-encode decoded numbers and check that the ID matches.",
	"ttjud7": "The reason this is not done automatically is that if the default blocklist changes in the future, we don't want to automatically invalidate the ID that has been generated in the past and might now be matching a new blocklist word.",
	"ttowu8": "We will be sure to update the {changelog} when and if the default blocklist changes.",
	"ttzo7t": "You have to account for scenarios where a new word might be introduced to the default blocklist. In this case, re-encoding numbers might produce a different ID.",
	"tt3i7z": "The best way to ensure your IDs stay consistent throughout future updates is to provide a custom blocklist, even if it is identical to the current default blocklist.",
	"ttmfhy": "No, encoding different numbers will produce unique IDs.",
	"ttt85f": "However, because of the algorithm's design, decoding random IDs can sometimes produce the same numbers. The best way to check if the ID is canonical is to simply re-encode decoded numbers and check that the ID matches.",
	"ttehfa": "{hashids} was the first version of this library that came out around 2013. It also produced short IDs but used a slightly different method.",
	"ttl3hc": "{hashids} handled a few things differently.",
	"ttgla4": "It did not support a custom blocklist, but instead relied on the most common English profanity words. It also used the {salt} parameter to shuffle the alphabet which made it a little confusing because the library has nothing to do with encryption. Additionally, it used too many reserved characters which resulted in producing longer IDs.",
	"ttajo1": "Therefore, we've decided to upgrade and rebrand. The algorithm has been simplified, a few features were added and the code repositories are all under [one roof now]({url}).",
	"ttzolt": "The {salt} parameter was used to shuffle the alphabet, and it was never meant to be associated with security or safety. Both {hashids} and {name} work similarly to the way decimal to hexadecimal conversion works but with a few adjustments. There is no encryption of any kind, so to avoid confusion, that parameter has been removed completely.",
	"ttnq6i": "No, {name} expands on the functionality of {hashids} and has different design goals & requirements; therefore, generated IDs are not compatible with {hashids}.",
	"ttixzo": "Since there's no compatibility between {hashids} and {name}, it's impossible to simply replace {hashids} with {name}.",
	"ttydl6": "However, you can merge the two by differentiating which ID belongs to which library.",
	"tt6n93": "One of the ways to do that is by ID length - if you're switching to {name}, you can provide a higher minimum length. Another way is to manually append/prepend a custom character to the newly generated IDs.",
	"tth5bj": "Finally, you could also attempt to decode an ID with {hashids} to see if it's valid. If not - decode and re-encode with {name} to see if that works.",
	"tt0a8s": "Each language implementation on this website links to the original {hashids} repository if it exists.",
	"tt9t9m": "If you'd like to support the project, we'd appreciate starring our repos on Github for more visibility.",
	"ttpgkb": "If you're a developer and see no implementation of {name} for a particular language, please help us convert the library. The same goes for a programming language that is not listed.",
	"ttk57h": "If you see a bug in the spec or any of the implementations, please create an issue or a pull request with a suggested fix in the appropriate repository.",
	"tt1rhp": "If you speak multiple languages, we could use your help with [fine-tuning the blocklist]({blocklist}) and [adjusting website translations]({i18n}) if you see any issues.",
	"tt49l5": "Finally, if you have some experience with {hashids}/{name}, please help guide our community by answering any questions anyone might have.",
	"ttqbpx": "If you would like to port {name} to one of the following languages (or a new one not listed here):",
	"ttt00f": "Fork the official repo to your own Github account & implement [the spec]({spec}) along with all the tests. You can re-use any of the existing READMEs ([example]({example})).",
	"tt5myu": "Once the library is ready, create a pull request. Once merged, we'll update the website.",
	"tt72cr": "If the repo has no active maintainers, we'd be happy to invite you to manage the repo and become an official maintainer.",
	"ttdqen": "If you're an expert at the following, please ping us if you'd like to port the library:",
	"ttfsed": "Not found",
	"ttsp7q": "Others",
	"tt8aj0": "Try:",
	"ttfspd": "[{clickhouse}]({url1}) provides built-in SQL functions for generating {name} with default parameters. This functionality is available since {clickhouse} [{version}]({url2})."
}
