{
	"tt52up": "Generar IDs Únicos Cortos",
	"tt75ra": "{name}{pronounced} es una biblioteca de código abierto que te permite generar identificadores cortos únicos\n\t\ta partir de números. Estos IDs son seguros para URL, pueden codificar varios números y no contienen\n\t\tpalabras malsonantes comunes.",
	"ttd0n6": "Leer más",
	"ttf0dj": "Así es cómo lucen:",
	"ttspqb": "Casos de uso",
	"tt810r": "El uso principal de {name} es puramente visual. Si prefieres usar IDs en lugar de números en tu proyecto, {name} podría ser una buena elección.",
	"ttfxdj": "Bueno Para",
	"ttcn90": "No Bueno Para",
	"ttxrw3": "Codificación de claves primarias",
	"ttblk8": "Si estás usando una base de datos relacional",
	"ttw5eb": "Ahorro de consultas a la base de datos",
	"ttrzg4": "Al codificar varios objetos",
	"ttj376": "Tokens de inicio de sesión temporales",
	"ttor8c": "Libre de vulgaridades y seguro para URL",
	"ttzbtd": "Datos sensibles",
	"tt3bzl": "Esto no es una biblioteca de encriptación",
	"ttm1yo": "IDs de Usuario",
	"ttt7ff": "Puede revelar la cantidad de usuarios si alguien descubre el alfabeto de codificación",
	"tte6as": "Preguntas",
	"ttl1c7": "Playground",
	"ttgq43": "Biblioteca",
	"ttaf1b": "Características",
	"ttz5td": "Generar IDs cortos a partir de números no negativos",
	"ttncim": "Codificación y decodificación sencillas",
	"ttimoo": "Los IDs autogenerados no contienen palabras malsonantes comunes",
	"tty56c": "Soporte para IDs personalizados a través de un alfabeto aleatorio",
	"tt6v30": "Cada versión produce los mismos IDs",
	"tthejy": "Biblioteca pequeña con una licencia permisiva",
	"tt0ds2": "{count} integraciones ({new} utilizan un nuevo diseño)",
	"tt9vmk": "Empezar",
	"ttpebs": "¿Qué estás usando?",
	"ttkph9": "¿No lo encuentras?",
	"tt1ap4": "¿Nos avisas?",
	"tt445i": "Ejemplo",
	"ttqewx": "Alfabeto",
	"tttnnf": "Números",
	"tt52lu": "ID generado",
	"tt74ur": "barajar",
	"ttdosn": "Barajar",
	"ttfisd": "nuevo",
	"ttswbq": "Sugerir edición de traducción de texto",
	"tt8qp0": "Patrocinadores",
	"ttfiwd": "Popular",
	"ttcyi9": "Hacer una pregunta",
	"ttxagw": "¿Encontraste un error?",
	"ttbjck": "{name} ha sido actualizado y rebrandeado",
	"ttw1ue": "Dale una estrella a {what} en {github}",
	"ttr5tg": "Ejemplo rápido de codificación y decodificación:",
	"ttjgz7": "Si los IDs son muy cortos, puedes rellenarlos hasta cierta longitud:",
	"ttosg8": "Crea IDs únicos al barajar el alfabeto:",
	"ttzdkt": "La documentación completa está en",
	"tt3fkz": "Empezar",
	"ttm3py": "Si estás buscando el {name} original, puedes encontrarlo aquí:",
	"tttnrf": "{name} para {lang} aún no está listo.",
	"ttep3a": "Por favor, da una estrella al repositorio para moverlo hacia arriba en nuestra lista de tareas:",
	"ttlmpc": "Si quieres ayudar a dar vida a esta versión, hay una sección de preguntas frecuentes sobre cómo hacerlo:",
	"ttgux4": "¿Cómo llevar {name} a otro idioma?",
	"ttabd1": "Si estás buscando el proyecto original {name}, puedes encontrarlo aquí:",
	"ttzdut": "Ten en cuenta que no será compatible con el algoritmo actual una vez que esta versión esté lista.",
	"ttn89i": "{name} es una biblioteca de código abierto que te permite generar IDs únicos cortos a partir de números. Soporta {count} lenguajes de programación.",
	"tti0yo": "IDs Únicos Cortos en {lang}",
	"ttyzu6": "Genera IDs únicos cortos en {lang} usando {name}. Estos identificadores son seguros para URL, pueden codificar varios números y no contienen palabras malsonantes comunes.",
	"tt6t23": "Área de pruebas de {name}. Explora la codificación y decodificación de {name}.",
	"tthraj": "Preguntas frecuentes para {name}.",
	"tt0xns": "Longitud Mínima",
	"tt962m": "Lista de Bloqueo",
	"ttphab": "Agrega tus propias palabras personalizadas separadas por espacios...",
	"ttk7bh": "Usar también la lista de bloqueo predeterminada",
	"tt1k1p": "Alfabeto Predeterminado",
	"tt42u5": "Corto",
	"ttqaex": "Largo",
	"tttiif": "Letras",
	"tt5lcu": "Minúsculas",
	"tt75vr": "Mayúsculas",
	"ttd8qn": "Lista",
	"ttfoqd": "Codificar",
	"ttsekq": "Decodificar",
	"tt8xb0": "Codificar varios",
	"ttfoed": "Codificar un cero adicional",
	"ttc6o9": "Codificar una constante grande",
	"ttx14w": "ID",
	"ttb79k": "Codificando estos números:",
	"ttwpve": "Producirá:",
	"ttrufg": "Decodificando este ID:",
	"ttj4t7": "El alfabeto debe tener al menos {count} caracteres de longitud",
	"ttoq48": "Los espacios en el alfabeto serán ignorados",
	"ttznht": "Las palabras en la lista de bloqueo con menos de {count} caracteres serán ignoradas",
	"tt3dhz": "Bloque",
	"ttmzby": "General",
	"tttigf": "¿Para qué sirve?",
	"ttebza": "¿Para qué no sirve?",
	"ttlybc": "¿Puedo codificar varios números a la vez?",
	"ttgvw4": "¿Son únicos los IDs generados?",
	"ttakn1": "¿Qué limitaciones tiene {name}?",
	"ttznvt": "Contribuir",
	"ttn0mi": "Trampas",
	"ttis6o": "Relleno",
	"ttytv6": "¿Cómo puedo hacer únicos mis IDs?",
	"tt6fl3": "¿Cómo puedo barajar el alfabeto predeterminado?",
	"tthg1j": "¿Es mejor usar un alfabeto más corto o más largo?",
	"tt0wis": "¿Puede mi alfabeto consistir solo en números?",
	"tt93lm": "¿Puedo usar emojis como el alfabeto?",
	"ttpj1b": "¿Por qué rellenar IDs?",
	"ttkrkh": "¿Puedo hacer que los IDs generados sean más largos?",
	"tt1jbp": "¿Puedo hacer que los IDs generados tengan una longitud específica?",
	"tt4lv5": "¿Por qué usar una lista de bloqueo?",
	"ttq1ax": "¿Cómo funciona la lista de bloqueo?",
	"tttoof": "¿Qué palabras están en la lista de bloqueo predeterminada?",
	"tt5c9u": "¿Qué sucede cuando todos los IDs están bloqueados?",
	"tt7u2r": "¿Cómo verificar si los IDs son válidos?",
	"ttd0xn": "¿Qué sucede cuando se actualiza la lista de bloqueo predeterminada?",
	"ttf8xd": "¿Puede la codificación de números diferentes producir IDs idénticos?",
	"ttsahq": "¿Qué es {name}?",
	"tt8wk0": "¿Por qué se actualizó {hashids} a {name}?",
	"ttf8ad": "¿Por qué se eliminó el parámetro {salt}?",
	"ttc389": "¿Es {hashids} compatible con {name}?",
	"ttxp5w": "¿Cómo puedo actualizar de manera segura desde {hashids} a {name}?",
	"ttbrmk": "¿Dónde puedo encontrar las bibliotecas originales de {hashids}?",
	"ttwb2e": "¿Cómo puedo contribuir?",
	"ttrvdg": "¿Cómo llevar {name} a otro lenguaje?",
	"ttj5f7": "{name} es una pequeña biblioteca de código abierto que puede producir IDs cortos, únicos y con apariencia aleatoria a partir de números.",
	"ttox58": "La mejor manera de entenderlo es como un convertidor decimal a hexadecimal, pero con algunas características adicionales.",
	"ttzijt": "Acortamiento de enlaces, generación de IDs únicos de eventos para registros, generación de IDs para productos/objetos en un sitio web (como hace YouTube para videos), generación de IDs cortos para mensajes de texto, códigos de confirmación en correos electrónicos, etc.",
	"tt3njz": "Cualquier dato que sea sensible. Los IDs generados no son hash y podrían decodificarse de vuelta a números. Por ejemplo, podrían no ser una buena elección para IDs de usuario, ya que una vez decodificados podrían revelar la cantidad de usuarios de tu aplicación.",
	"ttmtky": "Sí. {name} puede codificar uno o muchos números no negativos en un solo ID. No hay límite en la cantidad de números que puedes codificar, pero hay un límite en el tamaño del número que puedes codificar (dependiendo del lenguaje de implementación).",
	"ttto4f": "Esto es útil por varias razones: podrías codificar una marca de tiempo UNIX y crear IDs que caduquen, o podrías codificar un número de fragmento de base de datos junto con una clave primaria y ahorrar consultas extra a la base de datos.",
	"ttekta": "Sí, los IDs generados son únicos para la entrada y el alfabeto.",
	"ttl6kc": "Ten en cuenta que el alfabeto predeterminado contiene tanto letras mayúsculas como minúsculas, por lo que los IDs predeterminados son sensibles a mayúsculas y minúsculas.",
	"ttg2e4": "{name} no puede codificar números negativos.",
	"ttahi1": "La longitud mínima del alfabeto es de {length} caracteres.",
	"ttzi2t": "El alfabeto no puede contener caracteres multibyte.",
	"ttnsyi": "{name} no puede generar IDs hasta una cierta longitud, solo al menos una cierta longitud. El rango del parámetro de longitud mínima está entre {min} y {max}.",
	"ttiq3o": "{name} puede intentar regenerar IDs hasta la longitud del alfabeto, menos uno.",
	"ttyf26": "La biblioteca acepta un alfabeto personalizado a partir del cual puede generar IDs. Simplemente prebaraja el alfabeto predeterminado que se proporciona.",
	"tt6dc3": "Ten en cuenta que con suficiente esfuerzo, alguien podría ingeniar al revés tu alfabeto barajado, así que esto de ninguna manera es una técnica para ocultar datos sensibles.",
	"tth4pj": "El alfabeto predeterminado se puede encontrar [aquí]({url}).",
	"tt0eos": "Puedes usar cualquiera de las herramientas en línea de mezcla de cadenas o nuestro [playground](/playground).",
	"tt9zcm": "Depende de tu caso de uso. Un alfabeto más corto producirá IDs más largos y un alfabeto más largo producirá IDs más cortos. Puedes usar el [playground](/playground) para probar cómo podrían verse tus IDs.",
	"ttp7pb": "Sí. Ten en cuenta que los IDs generados siguen siendo cadenas y podrían comenzar con un cero.",
	"ttk4jh": "No. {name} no admite caracteres multibyte para el alfabeto. Eso incluye emojis y muchos otros caracteres.",
	"tt17kp": "La biblioteca puede extender IDs con caracteres basura para hacer que parezcan más largos. Esto es útil para que no sea tan obvio si estás codificando un número pequeño como {min} o uno grande como {max}.",
	"tt4c25": "La decodificación no se ve afectada.",
	"ttqp1x": "Sí, la biblioteca acepta un parámetro de longitud mínima que garantiza que los IDs sean al menos de esa longitud.",
	"ttt88f": "Ten en cuenta que no hay garantía sobre la longitud de tus IDs, solo que no serán más cortos que la longitud que especifiques.",
	"tt59mu": "Hasta cierto punto.",
	"tt7vlr": "Establecer una longitud máxima es imposible porque tarde o temprano tus IDs desbordarán con una entrada lo suficientemente grande. Es por eso que solo se admite el parámetro de longitud mínima, y no la longitud exacta o máxima.",
	"ttdswn": "Una lista de bloqueo puede evitar que ciertas palabras aparezcan en tus IDs. Esto es beneficioso porque los IDs generados están destinados a aparecer en lugares públicos, como la URL.",
	"ttf0wd": "{name} viene con la [lista de bloqueo predeterminada]({url}) que contiene las palabras groseras e inapropiadas más básicas de varios idiomas. Por supuesto, puedes ampliar esa lista con tus propias palabras.",
	"tts1jq": "La coincidencia de palabras en la lista de bloqueo no distingue entre mayúsculas y minúsculas.",
	"tt8eh0": "Las palabras cortas de menos de 3 caracteres no serán bloqueadas. Las palabras de 3 caracteres deben coincidir exactamente con los IDs. Las palabras de 4 caracteres o más activarán una coincidencia si son una subcadena del ID.",
	"ttf01d": "Si las palabras de la lista de bloqueo contienen números (leetspeak), solo activarán una coincidencia si están al principio o al final del ID.",
	"ttcz09": "La lista de bloqueo predeterminada contiene las palabras más comunes groseras e inapropiadas de varios idiomas. Puedes encontrar la lista completa [aquí]({url}).",
	"ttxbuw": "Cuando el ID generado coincide con una palabra en la lista de bloqueo, la biblioteca intenta regenerarlo.",
	"ttbgyk": "Si cada intento de regenerar el ID falla, la función de codificación fallará y devolverá un error. La gestión de ese error depende del usuario.",
	"ttwkle": "La mejor manera de reducir el número de intentos de regeneración es tener un alfabeto más largo, no establecer una longitud mínima y proporcionar una lista de bloqueo más pequeña. Proporcionar una lista de bloqueo vacía desactivará por completo la función.",
	"ttr2ng": "Decodificar IDs generalmente producirá algún tipo de salida numérica, pero eso no significa necesariamente que el ID sea canónico. Para verificar que el ID sea válido, puedes volver a codificar los números decodificados y comprobar que coincida el ID.",
	"ttjud7": "La razón por la que esto no se hace automáticamente es que si la lista de bloqueo predeterminada cambia en el futuro, no queremos invalidar automáticamente el ID que se ha generado en el pasado y que ahora puede coincidir con una nueva palabra de la lista de bloqueo.",
	"ttowu8": "Nos aseguraremos de actualizar el {changelog} si y cuando cambie la lista de bloqueo predeterminada.",
	"ttzo7t": "Debes tener en cuenta los escenarios en los que una nueva palabra podría ser introducida en la lista de bloqueo predeterminada. En este caso, volver a codificar números puede producir un ID diferente.",
	"tt3i7z": "La mejor manera de asegurar que tus IDs se mantengan consistentes en futuras actualizaciones es proporcionar una lista de bloqueo personalizada, incluso si es idéntica a la lista de bloqueo predeterminada actual.",
	"ttmfhy": "No, codificar números diferentes producirá IDs únicos.",
	"ttt85f": "Sin embargo, debido al diseño del algoritmo, decodificar IDs aleatorios a veces puede producir los mismos números. La mejor manera de verificar si el ID es canónico es simplemente volver a codificar los números decodificados y comprobar que coincida el ID.",
	"ttehfa": "{hashids} fue la primera versión de esta biblioteca que salió alrededor de 2013. También producía IDs cortos pero usaba un método ligeramente diferente.",
	"ttl3hc": "{hashids} manejaba algunas cosas de manera diferente.",
	"ttgla4": "No admitía una lista de bloqueo personalizada, sino que se basaba en las palabras groseras más comunes en inglés. También usaba el parámetro {salt} para mezclar el alfabeto, lo que lo hacía un poco confuso porque la biblioteca no tiene nada que ver con la encriptación. Además, utilizaba demasiados caracteres reservados, lo que resultaba en IDs más largos.",
	"ttajo1": "Por eso, hemos decidido actualizar y rebrandear. Se ha simplificado el algoritmo, se han agregado algunas funciones y los repositorios de código están todos bajo [un mismo techo ahora]({url}).",
	"ttzolt": "El parámetro {salt} se usaba para mezclar el alfabeto y nunca pretendía estar asociado con la seguridad. Tanto {hashids} como {name} funcionan de manera similar a la conversión decimal a hexadecimal, pero con algunas adaptaciones. No hay encriptación de ningún tipo, así que para evitar confusiones, ese parámetro se ha eliminado por completo.",
	"ttnq6i": "No, {name} amplía la funcionalidad de {hashids} y tiene objetivos y requisitos de diseño diferentes; por lo tanto, los IDs generados no son compatibles con {hashids}.",
	"ttixzo": "Dado que no hay compatibilidad entre {hashids} y {name}, es imposible simplemente reemplazar {hashids} con {name}.",
	"ttydl6": "Sin embargo, puedes combinar ambos diferenciando a qué biblioteca pertenece cada ID.",
	"tt6n93": "Una de las formas de hacerlo es por la longitud del ID: si estás cambiando a {name}, puedes proporcionar una longitud mínima mayor. Otra forma es agregar/anexar manualmente un carácter personalizado a los IDs recién generados.",
	"tth5bj": "Finalmente, también podrías intentar decodificar un ID con {hashids} para ver si es válido. Si no lo es, descodifica y vuelve a codificar con {name} para ver si funciona.",
	"tt0a8s": "Cada implementación en este sitio web enlaza al repositorio original de {hashids}, si existe.",
	"tt9t9m": "Si quieres apoyar el proyecto, agradeceríamos que marques con estrella nuestros repositorios en Github para tener más visibilidad.",
	"ttpgkb": "Si eres desarrollador y no ves una implementación de {name} para un lenguaje en particular, ayúdanos a convertir la biblioteca. Lo mismo ocurre para un lenguaje de programación que no esté listado.",
	"ttk57h": "Si encuentras un error en la especificación o en alguna de las implementaciones, crea un problema o una solicitud de extracción con una corrección sugerida en el repositorio correspondiente.",
	"tt1rhp": "Si hablas varios idiomas, podríamos necesitar tu ayuda para [ajustar la lista de bloqueo]({blocklist}) y [ajustar las traducciones del sitio web]({i18n}) si ves algún problema.",
	"tt49l5": "Finalmente, si tienes experiencia con {hashids}/{name}, ayúdanos a guiar a nuestra comunidad respondiendo cualquier pregunta que alguien pueda tener.",
	"ttqbpx": "Si quieres portar {name} a alguno de los siguientes lenguajes (o a uno nuevo que no esté listado aquí):",
	"ttt00f": "Haz un fork del repositorio oficial en tu cuenta de Github e implementa [la especificación]({spec}) junto con todas las pruebas. Puedes reutilizar cualquiera de los README existentes ([ejemplo]({example})).",
	"tt5myu": "Una vez que la biblioteca esté lista, crea una solicitud de extracción. Una vez fusionada, actualizaremos el sitio web.",
	"tt72cr": "Si el repositorio no tiene mantenedores activos, estaremos encantados de invitarte a administrar el repositorio y convertirte en un mantenedor oficial.",
	"ttdqen": "Si eres experto en alguno de los siguientes, por favor contáctanos si quieres portar la biblioteca:",
	"ttfsed": "No encontrado",
	"ttsp7q": "Otros",
	"tt8aj0": "Intenta:",
	"ttfspd": "[{clickhouse}]({url1}) proporciona funciones SQL integradas para generar {name} con parámetros predeterminados. Esta funcionalidad está disponible desde {clickhouse} [{version}]({url2})."
}
