{
	"tt52up": "छोटे अद्वितीय आईडी जेनरेट करें",
	"tt75ra": "{name}{pronounced} एक ओपन-सोर्स पुस्तकालय है जो आपको संख्याओं से छोटे अद्वितीय पहचानकर्ता\n\t\tउत्पन्न करने की अनुमति देता है। ये आईडी URL-सुरक्षित होती हैं, कई संख्याओं को एन्कोड कर सकती हैं, और सामान्य\n\t\tअश्लीलता वाले शब्द नहीं शामिल करतीं।",
	"ttd0n6": "और पढ़ें",
	"ttf0dj": "यह वे कैसे दिखते हैं:",
	"ttspqb": "उपयोग मामले",
	"tt810r": "{name} का मुख्य उपयोग केवल दृश्यिक रूप से है। अगर आप अपने प्रोजेक्ट में संख्याओं की बजाय आईडी का उपयोग करना चाहते हैं, तो {name} एक अच्छा विकल्प हो सकता है।",
	"ttfxdj": "अच्छा है",
	"ttcn90": "अच्छा नहीं है",
	"ttxrw3": "प्राथमिक कुंजी को एन्कोड करना",
	"ttblk8": "यदि आप रिश्तायी डेटाबेस का उपयोग कर रहे हैं",
	"ttw5eb": "डेटाबेस खोजें बचाना",
	"ttrzg4": "कई वस्तुओं को एन्कोड करके",
	"ttj376": "अस्थायी लॉगिन टोकन्स",
	"ttor8c": "अश्लीलता मुक्त और URL-सुरक्षित",
	"ttzbtd": "संवेदनशील डेटा",
	"tt3bzl": "यह एक एन्क्रिप्शन पुस्तकालय नहीं है",
	"ttm1yo": "उपयोगकर्ता आईडी",
	"ttt7ff": "अगर कोई भी एन्कोडिंग वर्णमाला पता लगा लेता है तो उपयोगकर्ता गणना प्रकट कर सकती है",
	"tte6as": "सामान्य प्रश्न",
	"ttl1c7": "खेल क्षेत्र",
	"ttgq43": "पुस्तकालय",
	"ttaf1b": "विशेषताएँ",
	"ttz5td": "गैर-नकारात्मक संख्याओं से छोटे आईडी उत्पन्न करें",
	"ttncim": "सरल एन्कोडिंग और डिकोडिंग",
	"ttimoo": "ऑटो-जेनरेट किए गए आईडी में सामान्य अश्लीलता नहीं होती है",
	"tty56c": "विशेष आईडी के लिए शफल वर्णमाला का समर्थन",
	"tt6v30": "हर संस्करण में एक ही आईडी उत्पन्न होती है",
	"tthejy": "छोटी पुस्तकालय जो अनुमतिप्राप्त लाइसेंस के साथ है",
	"tt0ds2": "{count} एकीकरण ({new} नए डिजाइन का उपयोग करते हुए)",
	"tt9vmk": "शुरू हो जाओ",
	"ttpebs": "आप क्या उपयोग कर रहे हैं?",
	"ttkph9": "इसे नहीं मिला",
	"tt1ap4": "हमें इसके बारे में बताएं?",
	"tt445i": "उदाहरण",
	"ttqewx": "वर्णमाला",
	"tttnnf": "संख्याएँ",
	"tt52lu": "उत्पन्न किया गया आईडी",
	"tt74ur": "छानना",
	"ttdosn": "छानें",
	"ttfisd": "नया जोड़ें",
	"ttswbq": "पाठ अनुवाद संपादन सुझाव",
	"tt8qp0": "निधि प्रदाता",
	"ttfiwd": "लोकप्रिय",
	"ttcyi9": "सवाल पूछें",
	"ttxagw": "बग मिला?",
	"ttbjck": "{name} को अपग्रेड किया गया है और पुनर्ब्रांड किया गया है",
	"ttw1ue": "{github} पर {what} को स्टार दें",
	"ttr5tg": "त्वरित एन्कोड और डिकोड उदाहरण:",
	"ttjgz7": "यदि आईडी बहुत छोटी हैं, तो आप उन्हें एक निश्चित लंबाई तक पैड कर सकते हैं:",
	"ttosg8": "वर्णमाला को छानकर अद्वितीय आईडी बनाएं:",
	"ttzdkt": "पूर्ण दस्तावेज़ीकरण यहाँ उपलब्ध है",
	"tt3fkz": "शुरू करें",
	"ttm3py": "यदि आप मूल {name} ढूंढ रहे हैं, तो आप इसे यहाँ पा सकते हैं:",
	"tttnrf": "{lang} के लिए {name} अभी तक तैयार नहीं है।",
	"ttep3a": "कृपया रेपो को स्टार करें ताकि यह हमारी टू-डू लिस्ट में ऊपर जा सके:",
	"ttlmpc": "यदि आप इस संस्करण को जीवंत करने में मदद करना चाहते हैं, तो उसके लिए एक FAQ खंड है:",
	"ttgux4": "{name} को दूसरी भाषा में कैसे लाया जाए?",
	"ttabd1": "यदि आप मूल {name} परियोजना ढूंढ रहे हैं, तो आप इसे यहाँ पा सकते हैं:",
	"ttzdut": "कृपया ध्यान दें कि एक बार इस संस्करण को पूरा होने के बाद यह वर्तमान एल्गोरिदम के साथ संगत नहीं होगा।",
	"ttn89i": "{name} एक ओपन-सोर्स पुस्तकालय है जो आपको संख्याओं से छोटे अद्वितीय आईडी उत्पन्न करने की अनुमति देता है। यह {count} प्रोग्रामिंग भाषाओं का समर्थन करता है।",
	"tti0yo": "{lang} में छोटे अद्वितीय आईडी",
	"ttyzu6": "{lang} में {name} का उपयोग करके छोटे अद्वितीय आईडी उत्पन्न करें। ये पहचानकर्ता URL-सुरक्षित होते हैं, कई संख्याओं को एन्कोड कर सकते हैं, और सामान्य अश्लीलता वाले शब्द नहीं शामिल करते हैं।",
	"tt6t23": "{name} खेल क्षेत्र। {name} एन्कोडिंग और डिकोडिंग पुस्तकालय को अन्वेषण करें।",
	"tthraj": "{name} के लिए सामान्य प्रश्न।",
	"tt0xns": "न्यूनतम लंबाई",
	"tt962m": "ब्लॉकलिस्ट",
	"ttphab": "अपनी अपनी कस्टम शब्द सूची जोड़ें जो अलग-अलग शब्दों को विभाजित करती है...",
	"ttk7bh": "डिफ़ॉल्ट ब्लॉकलिस्ट का भी उपयोग करें",
	"tt1k1p": "डिफ़ॉल्ट",
	"tt42u5": "छोटी",
	"ttqaex": "लंबी",
	"tttiif": "अक्षर",
	"tt5lcu": "छोटे अक्षर",
	"tt75vr": "बड़े अक्षर",
	"ttd8qn": "सूची",
	"ttfoqd": "एन्कोड",
	"ttsekq": "डिकोड",
	"tt8xb0": "एक को एन्कोड करें",
	"ttfoed": "एक अतिरिक्त शून्य एन्कोड करें",
	"ttc6o9": "एक बड़ा स्थिर एन्कोड करें",
	"ttx14w": "आईडी",
	"ttb79k": "इन संख्याओं को एन्कोड करें:",
	"ttwpve": "उत्पन्न करेगा:",
	"ttrufg": "इस आईडी को डिकोड कर रहे हैं:",
	"ttj4t7": "वर्णमाला कम से कम {count} अक्षरों की लंबाई होनी चाहिए",
	"ttoq48": "वर्णमाला में स्पेस अनदेखी की जाएगी",
	"ttznht": "{count} अक्षरों से कम शब्दों को ब्लॉकलिस्ट में अनदेखा किया जाएगा",
	"tt3dhz": "ब्लॉक",
	"ttmzby": "सामान्य",
	"tttigf": "इसके लिए यह अच्छा क्यों है?",
	"ttebza": "इसके लिए यह अच्छा नहीं है क्यों?",
	"ttlybc": "क्या मैं एक साथ कई संख्याओं को एन्कोड कर सकता हूँ?",
	"ttgvw4": "क्या उत्पन्न किए गए आईडी अनन्य होते हैं?",
	"ttakn1": "{name} क्या सीमाएँ हैं?",
	"ttznvt": "योगदान दें",
	"ttn0mi": "ध्यान दें",
	"ttis6o": "पैडिंग",
	"ttytv6": "मैं अपनी आईडी को अनन्य कैसे बना सकता हूँ?",
	"tt6fl3": "मैं डिफ़ॉल्ट वर्णमाला को कैसे छान सकता हूँ?",
	"tthg1j": "क्या छोटी या लंबी वर्णमाला का उपयोग करना बेहतर है?",
	"tt0wis": "क्या मेरी वर्णमाला केवल संख्याओं से हो सकती है?",
	"tt93lm": "क्या मैं वर्णमाला के रूप में इमोजी का उपयोग कर सकता हूँ?",
	"ttpj1b": "आईडी को पैड क्यों करें?",
	"ttkrkh": "क्या मैं उत्पन्न किए गए आईडी को और लंबा बना सकता हूँ?",
	"tt1jbp": "क्या मैं उत्पन्न किए गए आईडी को एक निश्चित लंबाई का बना सकता हूँ?",
	"tt4lv5": "ब्लॉकलिस्ट क्यों उपयोग करें?",
	"ttq1ax": "ब्लॉकलिस्ट कैसे काम करती है?",
	"tttoof": "डिफ़ॉल्ट ब्लॉकलिस्ट में कौन-कौन से शब्द हैं?",
	"tt5c9u": "सभी आईडी को ब्लॉक करने पर क्या होता है?",
	"tt7u2r": "आईडी सही है या नहीं यह कैसे जांचें?",
	"ttd0xn": "डिफ़ॉल्ट ब्लॉकलिस्ट को अपडेट करने पर क्या होता है?",
	"ttf8xd": "क्या विभिन्न संख्याओं को एन्कोड करने से एक ही आईडी बन सकती है?",
	"ttsahq": "{name} क्या है?",
	"tt8wk0": "{hashids} को {name} में अपग्रेड क्यों किया गया था?",
	"ttf8ad": "{salt} पैरामीटर को क्यों हटाया गया था?",
	"ttc389": "{hashids} {name} के साथ संगत है?",
	"ttxp5w": "मैं सुरक्षित रूप से {hashids} से {name} में अपग्रेड कैसे कर सकता हूँ?",
	"ttbrmk": "मैं मूल {hashids} पुस्तकालय कहाँ ढूंढ सकता हूँ?",
	"ttwb2e": "मैं कैसे योगदान कर सकता हूँ?",
	"ttrvdg": "{name} को एक और भाषा में कैसे पोर्ट किया जा सकता है?",
	"ttj5f7": "{name} एक छोटी सी ओपन-सोर्स पुस्तकालय है जो संख्याओं से छोटे, अनन्य, यादृच्छिक दिखने वाले आईडी प्रस्तुत कर सकता है।",
	"ttox58": "इसके बारे में सोचने का सबसे अच्छा तरीका यह है कि इसे एक दशमलव से हेक्साडेसिमल कनवर्टर की तरह समझें, लेकिन कुछ अतिरिक्त सुविधाओं के साथ।",
	"ttzijt": "लिंक संक्षेपण, लॉगिंग के लिए अनन्य घटना आईडी उत्पन्न करना, वेबसाइट पर उत्पाद/वस्तुओं के लिए आईडी उत्पन्न करना (जैसा कि YouTube वीडियो के लिए करता है), मैसेज या ईमेल में पुष्टिकरण कोड के लिए छोटी आईडी उत्पन्न करना।",
	"tt3njz": "कोई भी सांख्यिक डेटा जो संवेदनशील नहीं है। उत्पन्न किए गए आईडी हैश नहीं हैं और उन्हें संख्याओं में वापस डिकोड किया जा सकता है। उदाहरण के लिए, ये उपयोगकर्ता आईडी के लिए अच्छा विकल्प नहीं हो सकते, क्योंकि एक बार डिकोड किया जाने पर ये आपके ऐप के उपयोगकर्ता गणना को प्रकट कर सकते हैं।",
	"ttmtky": "हाँ, {name} एक से अधिक गैर-नकारात्मक संख्याओं को एक ही आईडी में एन्कोड कर सकता है। आपको कितनी संख्याओं को एन्कोड कर सकते हैं कोई सीमा नहीं है, लेकिन आपको कितनी बड़ी संख्या को एन्कोड कर सकते हैं, उसमें सीमा हो सकती है (कार्यान्वयन भाषा पर निर्भर करता है)।",
	"ttto4f": "इसके कई कारण हैं: आप एक UNIX टाइमस्टैम्प को एन्कोड कर सकते हैं और समाप्त होने वाली आईडी बना सकते हैं, या आप एक डेटाबेस शार्ड नंबर को प्राथमिक कुंजी के साथ एन्कोड कर सकते हैं और अतिरिक्त डेटाबेस क्वेरी पर बचा सकते हैं।",
	"ttekta": "हाँ, उत्पन्न किए गए आईडी इनपुट और वर्णमाला के लिए अनन्य होते हैं।",
	"ttl6kc": "ध्यान रखें कि डिफ़ॉल्ट वर्णमाला में छोटे और बड़े अक्षर दोनों होते हैं, इसलिए डिफ़ॉल्ट आईडीस अक्षर-संवेदनशील होते हैं।",
	"ttg2e4": "{name} नकारात्मक संख्याओं को एन्कोड नहीं कर सकता है।",
	"ttahi1": "न्यूनतम वर्णमाला लंबाई {length} अक्षर है।",
	"ttzi2t": "वर्णमाला में कोई भी मल्टीबाइट अक्षर नहीं हो सकता है।",
	"ttnsyi": "{name} एक निश्चित लंबाई तक आईडी नहीं उत्पन्न कर सकता, केवल कम से कम एक निश्चित लंबाई पर। न्यूनतम लंबाई पैरामीटर श्रेणी {min} से {max} के बीच है।",
	"ttiq3o": "{name} वर्णमाला लंबाई में, एक कम, पुनर्जन्म करने का प्रयास कर सकता है।",
	"ttyf26": "पुस्तकालय एक कस्टम वर्णमाला स्वीकार करता है, जिससे वह आईडी उत्पन्न कर सकता है। सिर्फ डिफ़ॉल्ट वर्णमाला को पूर्व-शफलित करें जो प्रदान की जाती है।",
	"tt6dc3": "कृपया ध्यान दें कि पर्याप्त प्रयास के साथ, कोई भी आपकी छानी हुई वर्णमाला को पुनः इंजीनियर कर सकता है, इसलिए यह संवेदनशील डेटा छिपाने का कोई तकनीक नहीं है।",
	"tth4pj": "डिफ़ॉल्ट वर्णमाला यहाँ पाई जा सकती है [यहाँ]({url})।",
	"tt0eos": "आप किसी भी ऑनलाइन स्ट्रिंग छानने उपकरण या हमारे [प्लेग्राउंड](/playground) का उपयोग कर सकते हैं।",
	"tt9zcm": "आपके उपयोग मामले पर निर्भर करता है। एक छोटी वर्णमाला लंबी आईडी उत्पन्न करेगी, और एक लंबी वर्णमाला छोटी आईडी उत्पन्न करेगी। आप [प्लेग्राउंड](/playground) का उपयोग करके यह जांच सकते हैं कि आपकी आईडी किस रूप में दिख सकती है।",
	"ttp7pb": "हाँ, ध्यान दें कि उत्पन्न किए गए आईडी फिर भी स्ट्रिंग्स हैं और वे शुरू हो सकते हैं एक शून्य के साथ।",
	"ttk4jh": "नहीं। {name} वर्णमाला के लिए बहुबाइट वर्णों का समर्थन नहीं करता। इसमें इमोजियों को समेत कई अन्य वर्ण शामिल हैं।",
	"tt17kp": "लाइब्रेरी आईडी को जंक वर्णों के साथ विस्तारित कर सकती है ताकि वे लंबे लगें। यह उपयोगी है ताकि यह स्पष्ट न लगे कि आप {min} जैसी छोटी संख्या को या {max} जैसी बड़ी संख्या को कोड कर रहे हैं।",
	"tt4c25": "डिकोडिंग पर प्रभाव नहीं पड़ता।",
	"ttqp1x": "हाँ, लाइब्रेरी एक न्यूनतम लंबाई पैरामीटर को स्वीकार कर सकती है जो गारंटी करता है कि आईडी कम से कम उस लंबाई का होगा।",
	"ttt88f": "कृपया ध्यान दें कि आपकी आईडी कितनी लंबी होगी, इस पर कोई गारंटी नहीं है — बस यह है कि आपकी द्वारा निर्धारित लंबाई से छोटी नहीं होगी।",
	"tt59mu": "एक सीमा तक।",
	"tt7vlr": "मैक्सिमम लंबाई निर्धारित करना असंभव है क्योंकि धीरे-धीरे आपकी आईडीज बड़े पर्याप्त इनपुट देने पर overflow हो जाएंगी। इसलिए केवल न्यूनतम लंबाई पैरामीटर का समर्थन किया जाता है, और सटीक लंबाई या अधिकतम लंबाई का समर्थन नहीं है।",
	"ttdswn": "ब्लॉकलिस्ट विशेष शब्दों को आपकी आईडी में न आने दे सकती है। यह उपयोगी है क्योंकि उत्पन्न हुई आईडीज URL जैसी सार्वजनिक जगहों पर दिखाई जाती हैं।",
	"ttf0wd": "{name} डिफ़ॉल्ट ब्लॉकलिस्ट ([डिफ़ॉल्ट ब्लॉकलिस्ट]({url})) के साथ आता है जिसमें कई भाषाओं के सबसे मूल अश्लील और अनुचित शब्द शामिल हैं। आप तो बेशक इस ब्लॉकलिस्ट को अपनी शब्दावली से विस्तारित कर सकते हैं।",
	"tts1jq": "ब्लॉकलिस्ट शब्द मैचिंग केस-इंसेंसिटिव होती है।",
	"tt8eh0": "3 वर्णों से कम लंबाई के छोटे शब्द ब्लॉक नहीं होंगे। 3 वर्णों लंबे शब्दों को आईडी से सही मेल खाना होगा। 4 वर्ण या उससे लंबे शब्द आईडी के सबस्ट्रिंग हों तो मैच को ट्रिगर करेंगे।",
	"ttf01d": "अगर ब्लॉकलिस्ट शब्दों में अंक हैं (लीटस्पीक), तो वे केवल तब मैच को ट्रिगर करेंगे जब वे आईडी के शुरुआत या अंत में हों।",
	"ttcz09": "डिफ़ॉल्ट ब्लॉकलिस्ट में कई भाषाओं के सबसे सामान्य अश्लील और अनुचित शब्द शामिल हैं। आप पूरी सूची [यहाँ]({url}) मिल सकती है।",
	"ttxbuw": "जब जेनरेट किया गया आईडी ब्लॉकलिस्ट में शब्द के साथ मेल खाता है, तो लाइब्रेरी उसे पुनर्जन्मित करने का प्रयास करती है।",
	"ttbgyk": "अगर हर प्रयास आईडी को पुनर्जन्मित करने में विफल रहता है, तो एन्कोड फ़ंक्शन विफल हो जाएगा और एक त्रुटि लौटाएगा। उस त्रुटि का संबोधन उपयोगकर्ता के ऊपर होगा।",
	"ttwkle": "पुनर्जन्मित करने के प्रयासों की संख्या को कम करने का सबसे अच्छा तरीका एक लंबी वर्णमाला होना है, न कि न्यूनतम लंबाई सेट करना, और एक छोटी ब्लॉकलिस्ट प्रदान करना। खाली ब्लॉकलिस्ट प्रदान करने से यह सुविधा पूरी तरह से अक्षम हो जाएगी।",
	"ttr2ng": "आईडीज डिकोड करने पर आमतौर पर कोई न कोई संख्यात्मक उत्पादन होता है, लेकिन यह जरूरी नहीं है कि आईडी कैननिकल हो। उसे जाँचने के लिए, आप डिकोड की गई संख्याओं को पुनः एनकोड कर सकते हैं और देख सकते हैं कि आईडी मैच करती है या नहीं।",
	"ttjud7": "इसे स्वचालित रूप से नहीं किया जाता है क्योंकि अगर भविष्य में डिफ़ॉल्ट ब्लॉकलिस्ट में परिवर्तन होता है, तो हमें पिछले में उत्पन्न किए गए आईडी को स्वचालित रूप से अमान्य नहीं करना चाहिए जो अब नए ब्लॉकलिस्ट शब्द से मेल खा रहा हो सकता है।",
	"ttowu8": "हम {changelog} को अपडेट करने के लिए निश्चित रहेंगे जब और अगर डिफ़ॉल्ट ब्लॉकलिस्ट में परिवर्तन होता है।",
	"ttzo7t": "आपको वहाँ संविधानिक ब्लॉकलिस्ट में एक नया शब्द प्रस्तुत हो सकता है वाले परिदृश्यों के लिए हिसाब रखना होगा। इस मामले में, नंबर्स को पुनः एनकोड करने से एक अलग ID उत्पन्न हो सकता है।",
	"tt3i7z": "आपके आईडीज़ को भविष्य के अपडेट्स के दौरान संघननात्मक बनाने का सबसे अच्छा तरीका है, वर्तमान डिफ़ॉल्ट ब्लॉकलिस्ट के समान हो या न हो, एक कस्टम ब्लॉकलिस्ट प्रदान करना।",
	"ttmfhy": "नहीं, अलग-अलग नंबर्स को एनकोड करने से अद्वितीय आईडीज़ उत्पन्न होंगे।",
	"ttt85f": "हालांकि, एल्गोरिदम के डिजाइन के कारण, कभी-कभी यादृच्छिक आईडीज़ को डिकोड करने से वही संख्याएँ उत्पन्न हो सकती हैं। आईडी कैननिकल है या नहीं, यह जाँचने का सबसे अच्छा तरीका सिर्फ डिकोड की गई संख्याओं को पुनः एनकोड करके और देखने में है कि आईडी मेल खाती है।",
	"ttehfa": "{hashids} इस पुस्तकालय का पहला संस्करण था जो लगभग 2013 में आया था। यह भी छोटी आईडीज़ उत्पन्न करता था लेकिन थोड़ा अलग तरीके से प्रयोग करता था।",
	"ttl3hc": "{hashids} कुछ बातें अलग तरीके से संभालता था।",
	"ttgla4": "इसने कस्टम ब्लॉकलिस्ट का समर्थन नहीं किया था, बल्कि इसने सबसे सामान्य अंग्रेजी अश्लील शब्दों पर निर्भर किया। इसने अल्फाबेट को शफ़ल करने के लिए {salt} पैरामीटर का भी इस्तेमाल किया जिससे यह थोड़ा भ्रांतिकरक बन गया क्योंकि पुस्तकालय का इनक्रिप्शन से कोई संबंध नहीं था। इसके अतिरिक्त, यह बहुत सारे आरक्षित वर्णों का इस्तेमाल करता था जिससे लंबी आईडीज़ उत्पन्न होती थीं।",
	"ttajo1": "इसलिए, हमने अपग्रेड करने और पुनर्ब्रांड करने का निर्णय लिया है। एल्गोरिदम को सरलीकृत किया गया है, कुछ फ़ीचर्स जोड़े गए हैं और कोड रिपॉजिटरी सभी [एक ही छत के नीचे]({url}) हैं।",
	"ttzolt": "{salt} पैरामीटर का उपयोग अल्फाबेट को शफ़ल करने के लिए किया गया था, और यह कभी भी सुरक्षा या सुरक्षा से जुड़ा होने का उद्देश्य नहीं था। दोनों {hashids} और {name} दशमलव से हेक्साडेसिमल परिवर्तन के तरीके के साथ काम करते हैं लेकिन कुछ समायोजन हैं। किसी भी प्रकार का इनक्रिप्शन नहीं होता, इसलिए भ्रांति से बचने के लिए, वह पैरामीटर पूरी तरह हटा दिया गया है।",
	"ttnq6i": "नहीं, {name} {hashids} के कार्यक्षमता को विस्तारित करता है और विभिन्न डिज़ाइन लक्ष्यों और आवश्यकताओं को रखता है; इसलिए, उत्पन्न आईडीज़ {hashids} के साथ संगत नहीं हैं।",
	"ttixzo": "क्योंकि {hashids} और {name} के बीच कोई संगतता नहीं है, इसलिए {hashids} को बस {name} से आसानी से बदलना संभव नहीं है।",
	"ttydl6": "हालांकि, आप दोनों को मर्ज कर सकते हैं और अंतर को अलग कर सकते हैं कि कौनसी आईडी किस पुस्तकालय का है।",
	"tt6n93": "इसके लिए एक तरीका आईडी लंबाई द्वारा है - अगर आप {name} में स्विच कर रहे हैं, तो आप एक अधिक न्यूनतम लंबाई प्रदान कर सकते हैं। दूसरा तरीका नवीनतम उत्पन्न आईडीज़ को मैन्युअल रूप से एक कस्टम वर्ण लगाना/प्रीपेंड करना है।",
	"tth5bj": "अंत में, आप {hashids} के साथ किसी भी आईडी को डिकोड करने का प्रयास कर सकते हैं ताकि देख सकें कि यह मान्य है या नहीं। अगर नहीं - डिकोड करें और {name} के साथ पुनः एनकोड करें ताकि देख सकें कि काम करता है या नहीं।",
	"tt0a8s": "इस वेबसाइट पर प्रत्येक भाषा के अनुसारीक्षण अस्तित्व में है, वहाँ आप मूल {hashids} रिपॉजिटरी के लिंक पा सकते हैं।",
	"tt9t9m": "अगर आप परियोजना का समर्थन करना चाहते हैं, तो हमें अपने Github रिपॉजिटरीज़ पर स्टार करना अत्यधिक सूचना माध्यम के लिए प्रस्तुति करेगा।",
	"ttpgkb": "अगर आप डेवलपर हैं और किसी विशेष भाषा के लिए {name} का कोई अनुसारीक्षण नहीं देखते हैं, तो कृपया हमें पुस्तकालय में परिवर्तन करने में हमारी सहायता करें। इसी तरह, जो प्रोग्रामिंग भाषा सूचीबद्ध नहीं है, उसके लिए भी लागू होता है।",
	"ttk57h": "अगर आप स्पेक में या किसी भी अनुसारीक्षण में कोई बग देखते हैं, तो कृपया उचित रिपॉजिटरी में सुझावित सुधार के साथ एक मुद्दा या पुल रिक्वेस्ट बनाएं।",
	"tt1rhp": "यदि आप कई भाषाओं में बोलते हैं, तो यदि आप किसी भी समस्या को देखते हैं, [ब्लॉकलिस्ट को संशोधित करने]({blocklist}) और [वेबसाइट अनुवादों को समायोजित करने]({i18n}) में हमारी मदद कर सकते हैं।",
	"tt49l5": "अंत में, यदि आपके पास {hashids}/{name} के साथ कुछ अनुभव है, तो कृपया हमारी समुदाय का मार्गदर्शन करें और किसी भी प्रश्न का उत्तर देकर मदद करें।",
	"ttqbpx": "यदि आप {name} को निम्नलिखित भाषाओं में (या एक नई जो यहाँ नहीं दी गई हो) लाना चाहते हैं:",
	"ttt00f": "आधिकारिक रिपॉजिटरी को अपने खुद के Github खाते में फोर्क करें और [विनिर्दिष्ट]({spec}) साथ सभी टेस्ट्स को लागू करें। आप किसी भी मौजूदा README का पुनः उपयोग कर सकते हैं ([उदाहरण]({example}))।",
	"tt5myu": "एक बार पुस्तकालय तैयार हो जाए, एक पुल रिक्वेस्ट बनाएं। एक बार मर्ज किया जाए, हम वेबसाइट को अपडेट करेंगे।",
	"tt72cr": "अगर रिपॉजिटरी में कोई सक्रिय रखरखाव नहीं है, तो हमें खुशी होगी आपको रिपॉजिटरी का प्रबंधन करने और आधिकारिक रखरखाव करने के लिए आमंत्रित करने में।",
	"ttdqen": "अगर आप निम्नलिखित में विशेषज्ञ हैं, तो कृपया हमें सूचित करें अगर आप लाइब्रेरी को लाना चाहते हैं:",
	"ttfsed": "नहीं मिला",
	"ttsp7q": "अन्य",
	"tt8aj0": "कोशिश करें:",
	"ttfspd": "[{clickhouse}]({url1}) डिफ़ॉल्ट पैरामीटर के साथ {name} उत्पन्न करने के लिए बिल्ट-इन SQL फ़ंक्शन प्रदान करता है। यह फ़ंक्शनैलिटी {clickhouse} [{version}]({url2}) के रूप में उपलब्ध है।"
}
