{
	"tt52up": "Menghasilkan ID Unik Pendek",
	"tt75ra": "{name}{pronounced} adalah sebuah perpustakaan sumber terbuka yang memungkinkan Anda untuk menghasilkan pengenal unik pendek dari angka. ID ini aman digunakan dalam URL, dapat mengkodekan beberapa angka, dan tidak mengandung kata-kata kasar umum.",
	"ttd0n6": "Baca lebih lanjut",
	"ttf0dj": "Inilah tampilannya:",
	"ttspqb": "Kasus Penggunaan",
	"tt810r": "Penggunaan utama dari {name} sepenuhnya bersifat visual. Jika Anda ingin menggunakan ID alih-alih angka dalam proyek Anda, {name} bisa menjadi pilihan yang baik.",
	"ttfxdj": "Bagus Untuk",
	"ttcn90": "Tidak Bagus Untuk",
	"ttxrw3": "Mengkodekan kunci primer",
	"ttblk8": "Jika Anda menggunakan basis data relasional",
	"ttw5eb": "Menyimpan pencarian basis data",
	"ttrzg4": "Dengan mengkodekan beberapa objek",
	"ttj376": "Token login sementara",
	"ttor8c": "Bebas kata-kata kasar dan aman digunakan dalam URL",
	"ttzbtd": "Data sensitif",
	"tt3bzl": "Ini bukan perpustakaan enkripsi",
	"ttm1yo": "ID Pengguna",
	"ttt7ff": "Dapat mengungkap jumlah pengguna jika seseorang menemukan abjad pengkodean",
	"tte6as": "FAQ",
	"ttl1c7": "Area Bermain",
	"ttgq43": "Perpustakaan",
	"ttaf1b": "Fitur",
	"ttz5td": "Menghasilkan ID pendek dari angka non-negatif",
	"ttncim": "Pengkodean & dekoding mudah",
	"ttimoo": "ID yang dihasilkan secara otomatis tidak mengandung kata-kata kasar umum",
	"tty56c": "Dukungan untuk ID kustom melalui abjad yang diacak",
	"tt6v30": "Setiap versi menghasilkan ID yang sama",
	"tthejy": "Perpustakaan kecil dengan lisensi yang luwes",
	"tt0ds2": "{count} integrasi ({new} menggunakan desain baru)",
	"tt9vmk": "Mulai",
	"ttpebs": "Apa yang sedang Anda gunakan?",
	"ttkph9": "Tidak dapat menemukannya",
	"tt1ap4": "Beri tahu kami tentang itu?",
	"tt445i": "Contoh",
	"ttqewx": "Abjad",
	"tttnnf": "Angka",
	"tt52lu": "ID yang Dihasilkan",
	"tt74ur": "acak",
	"ttdosn": "Acak",
	"ttfisd": "baru",
	"ttswbq": "Usulkan suntingan terjemahan teks",
	"tt8qp0": "Ponsor",
	"ttfiwd": "Populer",
	"ttcyi9": "Ajukan pertanyaan",
	"ttxagw": "Menemukan bug?",
	"ttbjck": "{name} telah ditingkatkan & direbranding",
	"ttw1ue": "Bintang {what} di {github}",
	"ttr5tg": "Contoh encode & decode cepat:",
	"ttjgz7": "Jika ID terlalu pendek, Anda bisa menambahkan panjangnya ke panjang tertentu:",
	"ttosg8": "Buat ID unik dengan mengacak abjad:",
	"ttzdkt": "Dokumentasi lengkap ada di",
	"tt3fkz": "Mulai",
	"ttm3py": "Jika Anda mencari {name} asli, Anda bisa menemukannya di sini:",
	"tttnrf": "{name} untuk {lang} belum siap.",
	"ttep3a": "Silakan beri bintang pada repositori ini untuk memindahkannya ke dalam daftar pekerjaan kita:",
	"ttlmpc": "Jika Anda ingin membantu mewujudkan versi ini, ada bagian FAQ tentang cara melakukannya:",
	"ttgux4": "Bagaimana cara memindahkan {name} ke bahasa lain?",
	"ttabd1": "Jika Anda mencari proyek asli {name}, Anda bisa menemukannya di sini:",
	"ttzdut": "Harap dicatat bahwa ini tidak akan kompatibel dengan algoritma saat ini setelah versi ini selesai.",
	"ttn89i": "{name} adalah perpustakaan sumber terbuka yang memungkinkan Anda menghasilkan ID unik pendek dari angka. Ini mendukung {count} bahasa pemrograman.",
	"tti0yo": "ID Unik Pendek dalam {lang}",
	"ttyzu6": "Menghasilkan ID unik pendek dalam {lang} menggunakan {name}. Pengenal ini aman dalam URL, dapat mengkodekan beberapa angka, dan tidak mengandung kata-kata kasar umum.",
	"tt6t23": "Area Bermain {name}. Jelajahi perpustakaan pengkodean dan dekoding {name}.",
	"tthraj": "Pertanyaan yang Sering Diajukan untuk {name}.",
	"tt0xns": "Panjang Minimum",
	"tt962m": "Daftar Blokir",
	"ttphab": "Tambahkan kata-kata kustom Anda sendiri yang dipisahkan oleh spasi...",
	"ttk7bh": "Gunakan juga daftar blokir default",
	"tt1k1p": "Default",
	"tt42u5": "Pendek",
	"ttqaex": "Panjang",
	"tttiif": "Huruf",
	"tt5lcu": "Huruf kecil",
	"tt75vr": "Huruf besar",
	"ttd8qn": "Daftar",
	"ttfoqd": "Encode",
	"ttsekq": "Decode",
	"tt8xb0": "Mengkodekan beberapa",
	"ttfoed": "Mengkodekan nol ekstra",
	"ttc6o9": "Mengkodekan konstan besar",
	"ttx14w": "ID",
	"ttb79k": "Mengkodekan angka-angka ini:",
	"ttwpve": "Akan menghasilkan:",
	"ttrufg": "Dekode ID ini:",
	"ttj4t7": "Abjad harus memiliki setidaknya {count} karakter",
	"ttoq48": "Spasi dalam abjad akan diabaikan",
	"ttznht": "Kata-kata daftar blokir kurang dari {count} karakter akan diabaikan",
	"tt3dhz": "blokir",
	"ttmzby": "Umum",
	"tttigf": "Untuk apa itu bagus?",
	"ttebza": "Untuk apa itu tidak bagus?",
	"ttlybc": "Dapatkah saya mengkodekan beberapa angka sekaligus?",
	"ttgvw4": "Apakah ID yang dihasilkan unik?",
	"ttakn1": "Apa batasan yang dimiliki oleh {name}?",
	"ttznvt": "Kontribusi",
	"ttn0mi": "Perhatian",
	"ttis6o": "Padding",
	"ttytv6": "Bagaimana cara membuat ID saya unik?",
	"tt6fl3": "Bagaimana cara mengacak abjad default?",
	"tthg1j": "Lebih baik menggunakan abjad yang lebih pendek atau lebih panjang?",
	"tt0wis": "Bisakah abjad saya terdiri hanya dari angka?",
	"tt93lm": "Dapatkah saya menggunakan emoji sebagai abjad?",
	"ttpj1b": "Mengapa perlu padding ID?",
	"ttkrkh": "Dapatkah saya membuat ID yang dihasilkan menjadi lebih panjang?",
	"tt1jbp": "Dapatkah saya membuat ID yang dihasilkan menjadi panjang secara spesifik?",
	"tt4lv5": "Mengapa menggunakan daftar blokir?",
	"ttq1ax": "Bagaimana cara daftar blokir bekerja?",
	"tttoof": "Kata-kata apa saja yang ada di daftar blokir default?",
	"tt5c9u": "Apa yang terjadi ketika semua ID diblokir?",
	"tt7u2r": "Bagaimana cara memeriksa apakah ID valid?",
	"ttd0xn": "Apa yang terjadi ketika daftar blokir default diperbarui?",
	"ttf8xd": "Dapatkah pengkodean angka yang berbeda menghasilkan ID yang identik?",
	"ttsahq": "Apa itu {name}?",
	"tt8wk0": "Mengapa {hashids} ditingkatkan menjadi {name}?",
	"ttf8ad": "Mengapa parameter {salt} dihapus?",
	"ttc389": "Apakah {hashids} kompatibel dengan {name}?",
	"ttxp5w": "Bagaimana cara mengupgrade dari {hashids} ke {name} dengan aman?",
	"ttbrmk": "Dimana saya bisa menemukan perpustakaan {hashids} asli?",
	"ttwb2e": "Bagaimana cara saya berkontribusi?",
	"ttrvdg": "Bagaimana cara memindahkan {name} ke bahasa lain?",
	"ttj5f7": "{name} adalah perpustakaan kecil sumber terbuka yang dapat menghasilkan ID pendek, unik, dengan penampilan acak dari angka.",
	"ttox58": "Cara terbaik untuk memahaminya adalah seperti konverter desimal ke heksadesimal, tetapi dengan beberapa fitur tambahan.",
	"ttzijt": "Pemendekan tautan, menghasilkan ID unik acara untuk logging, menghasilkan ID untuk produk/objek di sebuah situs web (seperti yang dilakukan YouTube untuk video), menghasilkan ID pendek untuk pesan teks, kode konfirmasi dalam surel, dll.",
	"tt3njz": "Setiap data yang sensitif. ID yang dihasilkan bukanlah hash dan bisa didekode kembali menjadi angka. Sebagai contoh, mungkin bukan pilihan yang baik untuk ID pengguna, karena setelah didekode, ID tersebut bisa mengungkap jumlah pengguna aplikasi Anda.",
	"ttmtky": "Ya. {name} dapat mengkodekan satu atau banyak angka non-negatif menjadi satu ID. Tidak ada batasan jumlah angka yang dapat Anda kodelkan, tetapi ada batasan pada seberapa besar angka yang dapat Anda kodelkan (tergantung pada bahasa implementasi).",
	"ttto4f": "Ini berguna untuk beberapa alasan: Anda dapat mengkodekan cap waktu UNIX dan membuat ID yang kedaluwarsa, atau Anda dapat mengkodekan nomor shard database bersama dengan kunci primer dan menghemat permintaan basis data tambahan.",
	"ttekta": "Ya, ID yang dihasilkan unik untuk input dan abjad.",
	"ttl6kc": "Namun, perlu diingat bahwa abjad default mengandung huruf besar dan kecil, sehingga ID default bersifat case-sensitive.",
	"ttg2e4": "{name} tidak dapat mengkodekan angka negatif.",
	"ttahi1": "Panjang abjad minimum adalah {length} karakter.",
	"ttzi2t": "Abjad tidak dapat mengandung karakter multibyte.",
	"ttnsyi": "{name} tidak dapat menghasilkan ID hingga panjang tertentu, hanya setidaknya panjang tertentu. Rentang parameter panjang minimum adalah antara {min} dan {max}.",
	"ttiq3o": "{name} dapat mencoba untuk menghasilkan kembali ID hingga panjang abjad, dikurangi satu.",
	"ttyf26": "Perpustakaan menerima abjad kustom dari mana ia dapat menghasilkan ID. Cukup pra-mengocok abjad default yang disediakan.",
	"tt6dc3": "Harap diingat bahwa dengan cukup usaha, seseorang bisa menerjemahkan kembali abjad yang sudah diacak, jadi ini bukanlah teknik untuk menyembunyikan data sensitif.",
	"tth4pj": "Abjad default dapat ditemukan [di sini]({url}).",
	"tt0eos": "Anda dapat menggunakan salah satu alat pengacakan string online atau [playground](/playground) kami.",
	"tt9zcm": "Tergantung pada kasus penggunaan Anda. Abjad yang lebih pendek akan menghasilkan ID yang lebih panjang, dan abjad yang lebih panjang akan menghasilkan ID yang lebih pendek. Anda dapat menggunakan [playground](/playground) untuk menguji bagaimana penampilan ID Anda mungkin.",
	"ttp7pb": "Ya. Harap diingat bahwa ID yang dihasilkan masih merupakan string dan mungkin dimulai dengan nol.",
	"ttk4jh": "Tidak. {name} tidak mendukung karakter multibyte untuk abjad. Ini termasuk emoji serta banyak karakter lainnya.",
	"tt17kp": "Perpustakaan dapat memperpanjang ID dengan karakter sampah untuk membuatnya terlihat lebih panjang. Ini berguna agar tidak terlalu jelas apakah Anda mengkodekan nomor kecil seperti {min} atau nomor besar seperti {max}.",
	"tt4c25": "Dekode tidak terpengaruh.",
	"ttqp1x": "Ya, perpustakaan menerima parameter panjang minimum yang menjamin bahwa ID akan setidaknya memiliki panjang tersebut.",
	"ttt88f": "Harap dicatat bahwa tidak ada jaminan seberapa lama panjang ID Anda — hanya bahwa mereka tidak akan lebih pendek dari panjang yang Anda tentukan.",
	"tt59mu": "Hingga pada suatu titik.",
	"tt7vlr": "Mengatur panjang maksimal tidak mungkin karena suatu saat nanti ID Anda akan meluap dengan input yang cukup besar. Itulah mengapa hanya parameter panjang minimum yang didukung, dan panjang eksak atau panjang maksimal tidak.",
	"ttdswn": "Daftar blokir dapat mencegah beberapa kata muncul dalam ID Anda. Ini bermanfaat karena ID yang dihasilkan dimaksudkan untuk muncul di tempat-tempat publik, seperti URL.",
	"ttf0wd": "{name} datang dengan [daftar blokir default]({url}) yang berisi kata-kata kasar dan tidak pantas paling dasar dari beberapa bahasa. Tentu saja Anda dapat memperluas daftar blokir itu dengan kata-kata Anda sendiri.",
	"tts1jq": "Pencocokan kata daftar blokir tidak peka huruf besar atau kecil.",
	"tt8eh0": "Kata-kata pendek kurang dari 3 karakter tidak akan diblokir. Kata-kata 3 karakter harus cocok persis dengan ID. Kata-kata 4 karakter atau lebih akan memicu pencocokan jika mereka menjadi substring dari ID.",
	"ttf01d": "Jika kata-kata daftar blokir mengandung angka (leetspeak), mereka hanya akan memicu pencocokan jika mereka berada di awal atau akhir ID.",
	"ttcz09": "Daftar blokir default berisi kata-kata kasar dan tidak pantas paling umum dari beberapa bahasa. Anda dapat menemukan daftar lengkap [di sini]({url}).",
	"ttxbuw": "Ketika ID yang dihasilkan cocok dengan kata dalam daftar blokir, perpustakaan akan mencoba untuk menghasilkan kembali.",
	"ttbgyk": "Jika setiap percobaan gagal untuk menghasilkan kembali ID, fungsi enkode akan gagal dan mengembalikan kesalahan. Menangani kesalahan itu terserah pada pengguna.",
	"ttwkle": "Cara terbaik untuk mengurangi jumlah percobaan regenerasi adalah dengan memiliki abjad yang lebih panjang, tidak menetapkan panjang minimum, dan menyediakan daftar blokir yang lebih kecil. Menyediakan daftar blokir kosong akan menonaktifkan fitur tersebut sepenuhnya.",
	"ttr2ng": "Dekode ID biasanya akan menghasilkan output numerik tertentu, tetapi itu tidak selalu berarti ID tersebut konsisten. Untuk memeriksa apakah ID konsisten, Anda dapat mengodekan kembali angka yang didekode dan memeriksa apakah ID cocok.",
	"ttjud7": "Alasan ini tidak dilakukan secara otomatis adalah jika daftar blokir default berubah di masa depan, kami tidak ingin secara otomatis membuat ID yang dihasilkan sebelumnya menjadi tidak valid dan mungkin cocok dengan kata baru dalam daftar blokir.",
	"ttowu8": "Kami pasti akan memperbarui {changelog} ketika dan jika daftar blokir default berubah.",
	"ttzo7t": "Anda harus mempertimbangkan skenario di mana kata baru mungkin ditambahkan ke daftar blokir default. Dalam hal ini, mengodekan ulang angka mungkin menghasilkan ID yang berbeda.",
	"tt3i7z": "Cara terbaik untuk memastikan ID Anda tetap konsisten dalam pembaruan di masa depan adalah dengan menyediakan daftar blokir kustom, bahkan jika identik dengan daftar blokir default saat ini.",
	"ttmfhy": "Tidak, mengkodekan angka yang berbeda akan menghasilkan ID yang unik.",
	"ttt85f": "Namun, karena desain algoritma, kadang-kadang mendekode ID acak dapat menghasilkan angka yang sama. Cara terbaik untuk memeriksa apakah ID konsisten adalah dengan hanya mengodekan ulang angka yang didekode dan memeriksa apakah ID cocok.",
	"ttehfa": "{hashids} adalah versi pertama dari perpustakaan ini yang keluar sekitar tahun 2013. Itu juga menghasilkan ID yang pendek tetapi menggunakan metode yang sedikit berbeda.",
	"ttl3hc": "{hashids} menangani beberapa hal secara berbeda.",
	"ttgla4": "Perpustakaan ini tidak mendukung daftar blokir kustom, namun bergantung pada kata-kata kasar Bahasa Inggris yang paling umum. Perpustakaan ini juga menggunakan parameter {salt} untuk mengacak abjad, yang membuatnya sedikit membingungkan karena perpustakaan ini tidak ada hubungannya dengan enkripsi. Selain itu, perpustakaan ini menggunakan terlalu banyak karakter yang direserve yang menghasilkan ID yang lebih panjang.",
	"ttajo1": "Oleh karena itu, kami memutuskan untuk melakukan peningkatan dan rebranding. Algoritma telah disederhanakan, beberapa fitur ditambahkan, dan repositori kode semuanya ada di [satu tempat sekarang]({url}).",
	"ttzolt": "Parameter {salt} digunakan untuk mengacak abjad, dan tidak pernah dimaksudkan untuk terkait dengan keamanan atau keselamatan. Baik {hashids} maupun {name} bekerja secara mirip dengan cara konversi desimal ke heksadesimal namun dengan beberapa penyesuaian. Tidak ada enkripsi dari jenis apapun, jadi untuk menghindari kebingungan, parameter itu telah dihapus sepenuhnya.",
	"ttnq6i": "Tidak, {name} memperluas fungsionalitas dari {hashids} dan memiliki tujuan desain & kebutuhan yang berbeda; oleh karena itu, ID yang dihasilkan tidak kompatibel dengan {hashids}.",
	"ttixzo": "Karena tidak ada kompatibilitas antara {hashids} dan {name}, tidak mungkin untuk secara sederhana menggantikan {hashids} dengan {name}.",
	"ttydl6": "Namun, Anda dapat menggabungkan kedua hal tersebut dengan membedakan ID mana yang berasal dari perpustakaan mana.",
	"tt6n93": "Salah satu cara untuk melakukannya adalah dengan panjang ID - jika Anda beralih ke {name}, Anda dapat memberikan panjang minimum yang lebih tinggi. Cara lain adalah dengan secara manual menambahkan/memperlihatkan karakter kustom ke ID yang baru dihasilkan.",
	"tth5bj": "Terakhir, Anda juga dapat mencoba mendekode ID dengan {hashids} untuk melihat apakah itu valid. Jika tidak - dekode dan kode ulang dengan {name} untuk melihat apakah itu berhasil.",
	"tt0a8s": "Setiap implementasi bahasa pada situs web ini menghubungkan ke repositori {hashids} asli jika ada.",
	"tt9t9m": "Jika Anda ingin mendukung proyek ini, kami akan menghargai bintang repositori kami di Github untuk mendapatkan lebih banyak visibilitas.",
	"ttpgkb": "Jika Anda seorang pengembang dan tidak melihat implementasi {name} untuk bahasa tertentu, silakan bantu kami mengonversi perpustakaannya. Hal yang sama berlaku untuk bahasa pemrograman yang tidak terdaftar.",
	"ttk57h": "Jika Anda menemukan bug dalam spesifikasi atau salah satu implementasi, silakan buat isu atau permintaan tarik dengan perbaikan yang disarankan di repositori yang sesuai.",
	"tt1rhp": "Jika Anda bisa berbicara dalam beberapa bahasa, kami bisa menggunakan bantuan Anda dalam [menyempurnakan daftar blokir]({blocklist}) dan [menyesuaikan terjemahan situs web]({i18n}) jika Anda menemui masalah.",
	"tt49l5": "Terakhir, jika Anda memiliki pengalaman dengan {hashids}/{name}, silakan bantu komunitas kami dengan menjawab pertanyaan dari siapa pun.",
	"ttqbpx": "Jika Anda ingin memporting {name} ke salah satu bahasa berikut (atau yang baru yang tidak tercantum di sini):",
	"ttt00f": "Fork repositori resmi ke akun Github Anda sendiri & implementasikan [spesifikasinya]({spec}) bersama dengan semua tesnya. Anda dapat menggunakan kembali salah satu README yang sudah ada ([contohnya]({example})).",
	"tt5myu": "Setelah perpustakaan siap, buat permintaan tarik. Setelah digabungkan, kami akan memperbarui situs web.",
	"tt72cr": "Jika repositori tidak memiliki pengelola aktif, kami akan senang untuk mengundang Anda untuk mengelola repositori tersebut dan menjadi pengelola resmi.",
	"ttdqen": "Jika Anda adalah seorang ahli dalam hal berikut, beri tahu kami jika Anda ingin memporting perpustakaannya:",
	"ttfsed": "Tidak ditemukan",
	"ttsp7q": "Lainnya",
	"tt8aj0": "Coba:",
	"ttfspd": "[{clickhouse}]({url1}) menyediakan fungsi SQL bawaan untuk menghasilkan {name} dengan parameter default. Fungsionalitas ini tersedia sejak {clickhouse} [{version}]({url2})."
}
