{
	"tt52up": "Genera ID Unici Brevi",
	"tt75ra": "{name}{pronounced} è una libreria open-source che ti permette di generare identificatori unici brevi da numeri. Questi ID sono sicuri per gli URL, possono codificare diversi numeri e non contengono parole volgari comuni.",
	"ttd0n6": "Leggi di più",
	"ttf0dj": "Ecco come appaiono:",
	"ttspqb": "Utilizzi",
	"tt810r": "L'uso principale di {name} è puramente visivo. Se desideri utilizzare ID invece di numeri nel tuo progetto, {name} potrebbe essere una buona scelta.",
	"ttfxdj": "Buono Per",
	"ttcn90": "Non Buono Per",
	"ttxrw3": "Codifica delle chiavi primarie",
	"ttblk8": "Se stai usando un database relazionale",
	"ttw5eb": "Risparmio di ricerche nel database",
	"ttrzg4": "Codificando più oggetti",
	"ttj376": "Token di accesso temporanei",
	"ttor8c": "Privi di volgarità e sicuri per gli URL",
	"ttzbtd": "Dati sensibili",
	"tt3bzl": "Questa non è una libreria di crittografia",
	"ttm1yo": "ID Utente",
	"ttt7ff": "Può rivelare il conteggio degli utenti se qualcuno scopre l'alfabeto di codifica",
	"tte6as": "Domande",
	"ttl1c7": "Area di gioco",
	"ttgq43": "Libreria",
	"ttaf1b": "Caratteristiche",
	"ttz5td": "Genera ID brevi da numeri non negativi",
	"ttncim": "Facile codifica e decodifica",
	"ttimoo": "Gli ID generati automaticamente non contengono volgarità comuni",
	"tty56c": "Supporto per ID personalizzati tramite alfabeto mescolato",
	"tt6v30": "Ogni versione produce gli stessi ID",
	"tthejy": "Piccola libreria con licenza permissiva",
	"tt0ds2": "{count} integrazioni ({new} utilizzano un nuovo design)",
	"tt9vmk": "Inizia",
	"ttpebs": "Cosa stai usando?",
	"ttkph9": "Non riesci a trovarlo",
	"tt1ap4": "Fallo sapere a noi?",
	"tt445i": "Esempio",
	"ttqewx": "Alfabeto",
	"tttnnf": "Numeri",
	"tt52lu": "ID Generato",
	"tt74ur": "mescola",
	"ttdosn": "Mescola",
	"ttfisd": "nuovo",
	"ttswbq": "Suggerisci modifica traduzione testo",
	"tt8qp0": "Sponsor",
	"ttfiwd": "Popolare",
	"ttcyi9": "Fai una domanda",
	"ttxagw": "Hai trovato un bug?",
	"ttbjck": "{name} è stato aggiornato e rebrandizzato",
	"ttw1ue": "Metti una stella a {what} su {github}",
	"ttr5tg": "Esempio rapido di codifica e decodifica:",
	"ttjgz7": "Se gli ID sono troppo corti, puoi aggiungere zeri fino a una certa lunghezza:",
	"ttosg8": "Crea ID univoci mescolando l'alfabeto:",
	"ttzdkt": "La documentazione completa si trova su",
	"tt3fkz": "Inizia",
	"ttm3py": "Se stai cercando l'originale {name}, puoi trovarlo qui:",
	"tttnrf": "{name} per {lang} non è ancora pronto.",
	"ttep3a": "Per favore metti una stella al repository per farlo salire nella nostra lista delle cose da fare:",
	"ttlmpc": "Se vuoi contribuire a portare questa versione alla luce, c'è una sezione delle FAQ su come farlo:",
	"ttgux4": "Come portare {name} in un'altra lingua?",
	"ttabd1": "Se stai cercando il progetto originale {name}, puoi trovarlo qui:",
	"ttzdut": "Nota che non sarà compatibile con l'algoritmo attuale una volta completata questa versione.",
	"ttn89i": "{name} è una libreria open-source che ti permette di generare ID univoci brevi da numeri. Supporta {count} linguaggi di programmazione.",
	"tti0yo": "ID univoci brevi in {lang}",
	"ttyzu6": "Genera ID univoci brevi in {lang} utilizzando {name}. Questi identificatori sono sicuri per gli URL, possono codificare diversi numeri e non contengono parole volgari comuni.",
	"tt6t23": "Area di gioco {name}. Esplora la libreria di codifica e decodifica {name}.",
	"tthraj": "Domande frequenti per {name}.",
	"tt0xns": "Lunghezza Minima",
	"tt962m": "Lista nera",
	"ttphab": "Aggiungi le tue parole personalizzate separate da spazi...",
	"ttk7bh": "Usa anche la lista nera predefinita",
	"tt1k1p": "Alfabeto predefinito",
	"tt42u5": "Breve",
	"ttqaex": "Lungo",
	"tttiif": "Lettere",
	"tt5lcu": "Minuscole",
	"tt75vr": "Maiuscole",
	"ttd8qn": "Lista",
	"ttfoqd": "Codifica",
	"ttsekq": "Decodifica",
	"tt8xb0": "Codifica multipla",
	"ttfoed": "Codifica di uno zero aggiuntivo",
	"ttc6o9": "Codifica di una costante grande",
	"ttx14w": "ID",
	"ttb79k": "Codifica di questi numeri:",
	"ttwpve": "Produrrà:",
	"ttrufg": "Decodifica di questo ID:",
	"ttj4t7": "L'alfabeto deve essere lungo almeno {count} caratteri",
	"ttoq48": "Gli spazi dell'alfabeto verranno ignorati",
	"ttznht": "Le parole nella lista nera inferiori a {count} caratteri verranno ignorate",
	"tt3dhz": "blocco",
	"ttmzby": "Generale",
	"tttigf": "A cosa serve?",
	"ttebza": "Cosa non è adatto?",
	"ttlybc": "Posso codificare diversi numeri contemporaneamente?",
	"ttgvw4": "Gli ID generati sono univoci?",
	"ttakn1": "Quali limitazioni ha {name}?",
	"ttznvt": "Contribuisci",
	"ttn0mi": "Sorprese",
	"ttis6o": "Padding",
	"ttytv6": "Come posso rendere unici i miei ID?",
	"tt6fl3": "Come posso mescolare l'alfabeto predefinito?",
	"tthg1j": "È meglio usare un alfabeto più corto o più lungo?",
	"tt0wis": "Il mio alfabeto può consistere solo di numeri?",
	"tt93lm": "Posso usare emoji come alfabeto?",
	"ttpj1b": "Perché aggiungere zeri agli ID?",
	"ttkrkh": "Posso rendere più lunghi gli ID generati?",
	"tt1jbp": "Posso rendere gli ID generati di una lunghezza specifica?",
	"tt4lv5": "Perché usare una lista nera?",
	"ttq1ax": "Come funziona la lista nera?",
	"tttoof": "Quali parole sono nella lista nera predefinita?",
	"tt5c9u": "Cosa succede quando tutti gli ID sono bloccati?",
	"tt7u2r": "Come verificare se gli ID sono validi?",
	"ttd0xn": "Cosa succede quando la lista nera predefinita viene aggiornata?",
	"ttf8xd": "La codifica di numeri diversi può produrre ID identici?",
	"ttsahq": "Cos'è {name}?",
	"tt8wk0": "Perché {hashids} è stato aggiornato a {name}?",
	"ttf8ad": "Perché il parametro {salt} è stato rimosso?",
	"ttc389": "{hashids} è compatibile con {name}?",
	"ttxp5w": "Come posso aggiornare in modo sicuro da {hashids} a {name}?",
	"ttbrmk": "Dove posso trovare le librerie originali {hashids}?",
	"ttwb2e": "Come posso contribuire?",
	"ttrvdg": "Come portare {name} in un'altra lingua?",
	"ttj5f7": "{name} è una piccola libreria open-source che può produrre ID brevi, unici e dall'aspetto casuale da numeri.",
	"ttox58": "Il modo migliore per pensare è come a un convertitore da decimale a esadecimale, ma con alcune funzionalità extra.",
	"ttzijt": "Abbreviazione di link, generazione di ID unici per il logging di eventi, generazione di ID per prodotti/oggetti su un sito web (come fa YouTube per i video), generazione di ID brevi per messaggi di testo, codici di conferma nelle email, ecc.",
	"tt3njz": "Qualsiasi dato che è sensibile. Gli ID generati non sono hash e potrebbero essere decodificati in numeri. Ad esempio, potrebbero non essere una buona scelta per gli ID utente, perché una volta decodificati, potrebbero rivelare il conteggio degli utenti della tua app.",
	"ttmtky": "Sì. {name} può codificare uno o molti numeri non negativi in un singolo ID. Non c'è limite al numero di numeri che puoi codificare, ma c'è un limite a quanto grande può essere un numero che puoi codificare (a seconda del linguaggio di implementazione).",
	"ttto4f": "Questo è utile per diversi motivi: potresti codificare un timestamp UNIX e creare ID che scadono, oppure potresti codificare un numero di frammento del database insieme a una chiave primaria e risparmiare query extra al database.",
	"ttekta": "Sì, gli ID generati sono unici rispetto all'input e all'alfabeto.",
	"ttl6kc": "Tieni presente però che l'alfabeto predefinito contiene sia lettere maiuscole che minuscole, quindi gli ID predefiniti sono sensibili alle maiuscole e minuscole.",
	"ttg2e4": "{name} non può codificare numeri negativi.",
	"ttahi1": "La lunghezza minima dell'alfabeto è di {length} caratteri.",
	"ttzi2t": "L'alfabeto non può contenere caratteri multibyte.",
	"ttnsyi": "{name} non può generare ID fino a una certa lunghezza, solo almeno una certa lunghezza. Il parametro di lunghezza minima è compreso tra {min} e {max}.",
	"ttiq3o": "{name} può tentare di rigenerare gli ID fino alla lunghezza dell'alfabeto, meno uno.",
	"ttyf26": "La libreria accetta un alfabeto personalizzato da cui può generare ID. Basta pre-mescolare l'alfabeto predefinito fornito.",
	"tt6dc3": "Tieni presente che con sufficiente impegno qualcuno potrebbe decodificare il tuo alfabeto mescolato, quindi questa non è in alcun modo una tecnica per nascondere dati sensibili.",
	"tth4pj": "L'alfabeto predefinito si trova [qui]({url}).",
	"tt0eos": "Puoi utilizzare uno qualsiasi degli strumenti online per mescolare stringhe o il nostro [playground](/playground).",
	"tt9zcm": "Dipende dal tuo caso d'uso. Un alfabeto più corto produrrà ID più lunghi, mentre un alfabeto più lungo produrrà ID più corti. Puoi utilizzare il [playground](/playground) per testare come potrebbero apparire i tuoi ID.",
	"ttp7pb": "Sì. Tieni presente che gli ID generati sono comunque stringhe e potrebbero iniziare con uno zero.",
	"ttk4jh": "No. {name} non supporta caratteri multibyte per l'alfabeto. Questo include anche emoji e molti altri caratteri.",
	"tt17kp": "La libreria può estendere gli ID con caratteri casuali per farli sembrare più lunghi. Questo è utile in modo che non sia ovvio se stai codificando un numero piccolo come {min} o un numero grande come {max}.",
	"tt4c25": "La decodifica non è influenzata.",
	"ttqp1x": "Sì, la libreria accetta un parametro di lunghezza minima che garantisce che gli ID siano almeno di quella lunghezza.",
	"ttt88f": "Tieni presente che non c'è alcuna garanzia sulla lunghezza dei tuoi ID: è garantito solo che non saranno più corti della lunghezza specificata.",
	"tt59mu": "Fino a un certo punto.",
	"tt7vlr": "Impostare la lunghezza massima è impossibile perché prima o poi i tuoi ID andranno in overflow con un input sufficientemente grande. Ecco perché è supportato solo il parametro di lunghezza minima e non la lunghezza esatta o massima.",
	"ttdswn": "Una lista nera può impedire che determinate parole appaiano nei tuoi ID. Questo è vantaggioso perché gli ID generati devono apparire in luoghi pubblici, come l'URL.",
	"ttf0wd": "{name} include la [lista nera predefinita]({url}) che contiene le parole volgari e inappropriati più comuni in diverse lingue. Naturalmente puoi estendere quella lista nera con le tue parole.",
	"tts1jq": "Il matching delle parole nella lista nera non fa distinzione tra maiuscole e minuscole.",
	"tt8eh0": "Parole brevi inferiori a 3 caratteri non saranno bloccate. Le parole di 3 caratteri devono corrispondere esattamente agli ID. Le parole di 4 caratteri o più lunghe attiveranno una corrispondenza se sono una sottostringa dell'ID.",
	"ttf01d": "Se le parole nella lista nera contengono numeri (leetspeak), attiveranno una corrispondenza solo se sono all'inizio o alla fine dell'ID.",
	"ttcz09": "La lista nera predefinita contiene le parole volgari e inappropriate più comuni in diverse lingue. Puoi trovare l'elenco completo [qui]({url}).",
	"ttxbuw": "Quando l'ID generato corrisponde a una parola nella lista nera, la libreria tenta di rigenerarlo.",
	"ttbgyk": "Se ogni singolo tentativo fallisce nel rigenerare l'ID, la funzione di codifica fallirà e restituirà un errore. Gestire quell'errore spetta all'utente.",
	"ttwkle": "Il modo migliore per ridurre il numero di tentativi di rigenerazione è avere un alfabeto più lungo, non impostare una lunghezza minima e fornire una lista nera più piccola. Fornire una lista nera vuota disabiliterà completamente la funzione.",
	"ttr2ng": "Decodificare gli ID produrrà di solito un qualche tipo di output numerico, ma ciò non significa necessariamente che l'ID sia canonico. Per verificare che l'ID sia valido, puoi ricodificare i numeri decodificati e verificare che corrispondano all'ID.",
	"ttjud7": "Il motivo per cui questo non avviene automaticamente è che se la lista nera predefinita cambia in futuro, non vogliamo invalidare automaticamente l'ID che è stato generato in passato e potrebbe ora corrispondere a una nuova parola nella lista nera.",
	"ttowu8": "Ci assicureremo di aggiornare il {changelog} quando e se la lista nera predefinita cambierà.",
	"ttzo7t": "Devi considerare scenari in cui potrebbe essere introdotta una nuova parola nella lista nera predefinita. In questo caso, la ricodifica dei numeri potrebbe produrre un ID diverso.",
	"tt3i7z": "Il modo migliore per garantire che i tuoi ID rimangano consistenti attraverso gli aggiornamenti futuri è fornire una lista nera personalizzata, anche se è identica alla lista nera predefinita attuale.",
	"ttmfhy": "No, la codifica di numeri diversi produrrà ID univoci.",
	"ttt85f": "Tuttavia, a causa del design dell'algoritmo, la decodifica di ID casuali talvolta può produrre gli stessi numeri. Il modo migliore per verificare se l'ID è canonico è semplicemente ricodificare i numeri decodificati e verificare che corrispondano all'ID.",
	"ttehfa": "{hashids} è stata la prima versione di questa libreria che è uscita intorno al 2013. Ha anche prodotto ID brevi ma ha usato un metodo leggermente diverso.",
	"ttl3hc": "{hashids} ha gestito alcune cose in modo diverso.",
	"ttgla4": "Non supportava una lista nera personalizzata, ma si basava sulle parole volgari più comuni in inglese. Usava anche il parametro {salt} per mescolare l'alfabeto, il che lo rendeva un po' confuso perché la libreria non ha nulla a che fare con la crittografia. Inoltre, usava troppi caratteri riservati, il che risultava in ID più lunghi.",
	"ttajo1": "Pertanto, abbiamo deciso di fare un upgrade e un rebranding. L'algoritmo è stato semplificato, sono state aggiunte alcune funzionalità e tutti i repository del codice sono sotto [un unico tetto ora]({url}).",
	"ttzolt": "Il parametro {salt} veniva utilizzato per mescolare l'alfabeto e non era mai stato pensato per essere associato a sicurezza o protezione. Entrambi {hashids} e {name} funzionano in modo simile al modo in cui funziona la conversione da decimale ad esadecimale, ma con alcune modifiche. Non c'è alcuna crittografia di alcun tipo, quindi per evitare confusione, quel parametro è stato completamente rimosso.",
	"ttnq6i": "No, {name} espande la funzionalità di {hashids} e ha obiettivi e requisiti di progettazione diversi; pertanto, gli ID generati non sono compatibili con {hashids}.",
	"ttixzo": "Poiché non c'è compatibilità tra {hashids} e {name}, è impossibile sostituire semplicemente {hashids} con {name}.",
	"ttydl6": "Tuttavia, puoi unire i due differenziando a quale libreria appartiene ciascun ID.",
	"tt6n93": "Uno dei modi per farlo è per lunghezza ID: se stai passando a {name}, puoi fornire una lunghezza minima maggiore. Un altro modo è appendere/prependere manualmente un carattere personalizzato agli ID appena generati.",
	"tth5bj": "Infine, potresti anche tentare di decodificare un ID con {hashids} per vedere se è valido. Se no, decodifica e ricodifica con {name} per vedere se funziona.",
	"tt0a8s": "Ciascuna implementazione del linguaggio su questo sito web collega al repository originale di {hashids} se esiste.",
	"tt9t9m": "Se desideri supportare il progetto, apprezziamo se metti una stella ai nostri repository su Github per una maggiore visibilità.",
	"ttpgkb": "Se sei un programmatore e non vedi un'implementazione di {name} per un particolare linguaggio, aiutaci a convertire la libreria. Lo stesso vale per un linguaggio di programmazione che non è elencato.",
	"ttk57h": "Se vedi un bug nello spec o in una delle implementazioni, crea una issue o un pull request con una soluzione suggerita nel repository appropriato.",
	"tt1rhp": "Se parli più lingue, potremmo usare il tuo aiuto per [raffinare la lista nera]({blocklist}) e [aggiustare le traduzioni del sito web]({i18n}) se vedi problemi.",
	"tt49l5": "Infine, se hai un'esperienza con {hashids}/{name}, aiuta la nostra comunità rispondendo a qualsiasi domanda che qualcuno potrebbe avere.",
	"ttqbpx": "Se desideri portare {name} a uno dei seguenti linguaggi (o a uno nuovo non elencato qui):",
	"ttt00f": "Fai il fork del repository ufficiale nel tuo account Github e implementa [lo spec]({spec}) insieme a tutti i test. Puoi riutilizzare uno qualsiasi dei README esistenti ([esempio]({example})).",
	"tt5myu": "Una volta che la libreria è pronta, crea una pull request. Una volta unita, aggiorneremo il sito web.",
	"tt72cr": "Se il repository non ha manutentori attivi, saremmo felici di invitarti a gestire il repository e diventare un manutentore ufficiale.",
	"ttdqen": "Se sei un esperto in quanto segue, per favore contattaci se vuoi portare la libreria:",
	"ttfsed": "Non trovato",
	"ttsp7q": "Altri",
	"tt8aj0": "Provare:",
	"ttfspd": "[{clickhouse}]({url1}) fornisce funzioni SQL integrate per generare {name} con parametri predefiniti. Questa funzionalità è disponibile dalla versione [{version}]({url2}) di {clickhouse}."
}
