{
	"tt52up": "Genereer Korte Unieke ID's",
	"tt75ra": "{name}{pronounced} is een open-source bibliotheek waarmee je korte unieke identifiers kunt genereren vanuit nummers. Deze ID's zijn URL-veilig, kunnen verschillende nummers encoderen en bevatten geen gangbare grove woorden.",
	"ttd0n6": "Lees meer",
	"ttf0dj": "Dit is hoe ze eruit zien:",
	"ttspqb": "Gebruiksscenario's",
	"tt810r": "Het hoofdgebruik van {name} is puur visueel. Als je IDs in plaats van nummers wilt gebruiken in je project, kan {name} een goede keuze zijn.",
	"ttfxdj": "Goed voor",
	"ttcn90": "Niet geschikt voor",
	"ttxrw3": "Coderen van primaire sleutels",
	"ttblk8": "Als je een relationele database gebruikt",
	"ttw5eb": "Besparen van databasezoekopdrachten",
	"ttrzg4": "Door meerdere objecten te coderen",
	"ttj376": "Tijdelijke inlogtokens",
	"ttor8c": "Vrij van grof taalgebruik en URL-veilig",
	"ttzbtd": "Gevoelige data",
	"tt3bzl": "Dit is geen encryptiebibliotheek",
	"ttm1yo": "Gebruikers-IDs",
	"ttt7ff": "Kan het aantal gebruikers onthullen als iemand het coderingsalfabet ontdekt",
	"tte6as": "Vragen",
	"ttl1c7": "Speeltuin",
	"ttgq43": "Taal",
	"ttaf1b": "Functies",
	"ttz5td": "Genereer korte ID's van niet-negatieve getallen",
	"ttncim": "Eenvoudig coderen en decoderen",
	"ttimoo": "Automatisch gegenereerde ID's bevatten geen veelvoorkomend grof taalgebruik",
	"tty56c": "Ondersteuning voor aangepaste ID's via een geschud alfabet",
	"tt6v30": "Elke versie produceert dezelfde ID's",
	"tthejy": "Kleine bibliotheek met een toegeeflijke licentie",
	"tt0ds2": "{count} programmeertalen ({new} met nieuw ontwerp)",
	"tt9vmk": "Aan de slag",
	"ttpebs": "Welke taal gebruik je?",
	"ttkph9": "Kan het niet vinden",
	"tt1ap4": "Laat het ons weten?",
	"tt445i": "Voorbeeld",
	"ttqewx": "Alfabet",
	"tttnnf": "Nummers",
	"tt52lu": "Gegenereerde ID",
	"tt74ur": "schudden",
	"ttdosn": "Schudden",
	"ttfisd": "nieuw",
	"ttswbq": "Suggestie voor tekstvertaling bewerken",
	"tt8qp0": "Sponsor",
	"ttfiwd": "Populair",
	"ttcyi9": "Stel een vraag",
	"ttxagw": "Een bug gevonden?",
	"ttbjck": "{name} is geüpgraded & opnieuw gebrand",
	"ttw1ue": "Star {what} op {github}",
	"ttr5tg": "Snel encode & decode voorbeeld:",
	"ttjgz7": "Als ID's te kort zijn, kun je ze opvullen tot een bepaalde lengte:",
	"ttosg8": "Maak unieke ID's door het alfabet te schudden:",
	"ttzdkt": "De volledige documentatie is te vinden op",
	"tt3fkz": "Aan de Slag",
	"ttm3py": "Als je op zoek bent naar het originele {name}, je kunt het hier vinden:",
	"tttnrf": "{name} voor {lang} is nog niet klaar.",
	"ttep3a": "Gelieve de repo te 'starren' om het hoger op onze todo-lijst te plaatsen:",
	"ttlmpc": "Als je wilt helpen bij het tot leven brengen van deze versie, is er een FAQ-sectie over hoe dat te doen:",
	"ttgux4": "Hoe {name} over te brengen naar een andere taal?",
	"ttabd1": "Als je op zoek bent naar het originele {name}-project, je kunt het hier vinden:",
	"ttzdut": "Let op dat het niet compatibel zal zijn met het huidige algoritme zodra deze versie klaar is.",
	"ttn89i": "{name} is een open-source bibliotheek waarmee je korte unieke ID's kunt genereren vanuit nummers. Het ondersteunt {count} programmeertalen.",
	"tti0yo": "Korte Unieke ID's in {lang}",
	"ttyzu6": "Genereer korte unieke ID's in {lang} met behulp van {name}. Deze identificatoren zijn URL-veilig, kunnen verschillende nummers encoderen en bevatten geen veelvoorkomend grof taalgebruik.",
	"tt6t23": "{name} speeltuin. Verken de {name} codeer- en decodeerbibliotheek.",
	"tthraj": "Veelgestelde vragen voor {name}.",
	"tt0xns": "Minimale lengte",
	"tt962m": "Blocklist",
	"ttphab": "Voeg je eigen aangepaste woorden toe gescheiden door spaties…",
	"ttk7bh": "Gebruik ook de standaard blocklist",
	"tt1k1p": "Standaard",
	"tt42u5": "Kort",
	"ttqaex": "Lang",
	"tttiif": "Letters",
	"tt5lcu": "Kleine letters",
	"tt75vr": "Hoofdletters",
	"ttd8qn": "Lijst",
	"ttfoqd": "Coderen",
	"ttsekq": "Decoderen",
	"tt8xb0": "Codeer meerdere",
	"ttfoed": "Codeer een extra nul",
	"ttc6o9": "Codeer een groot constant",
	"ttx14w": "ID",
	"ttb79k": "Coderen van deze getallen:",
	"ttwpve": "Zal produceren:",
	"ttrufg": "Decoderen van deze ID:",
	"ttj4t7": "Alfabet moet minimaal {count} tekens lang zijn",
	"ttoq48": "Spaties in het alfabet worden genegeerd",
	"ttznht": "Blocklist-woorden korter dan {count} tekens worden genegeerd",
	"tt3dhz": "blok",
	"ttmzby": "Algemeen",
	"tttigf": "Waarvoor is het goed?",
	"ttebza": "Waarvoor is het niet geschikt?",
	"ttlybc": "Kan ik meerdere nummers tegelijk coderen?",
	"ttgvw4": "Zijn gegenereerde ID's uniek?",
	"ttakn1": "Welke beperkingen heeft {name}?",
	"ttznvt": "Bijdragen",
	"ttn0mi": "Valkuilen",
	"ttis6o": "Opvulling",
	"ttytv6": "Hoe kan ik mijn ID's uniek maken?",
	"tt6fl3": "Hoe kan ik het standaard alfabet schudden?",
	"tthg1j": "Is het beter om een korter of langer alfabet te gebruiken?",
	"tt0wis": "Kan mijn alfabet alleen uit nummers bestaan?",
	"tt93lm": "Kan ik emoji's als alfabet gebruiken?",
	"ttpj1b": "Waarom ID's opvullen?",
	"ttkrkh": "Kan ik gegenereerde ID's langer maken?",
	"tt1jbp": "Kan ik gegenereerde ID's een specifieke lengte geven?",
	"tt4lv5": "Waarom een blocklist gebruiken?",
	"ttq1ax": "Hoe werkt de blocklist?",
	"tttoof": "Welke woorden staan er in de standaard blocklist?",
	"tt5c9u": "Wat gebeurt er als alle ID's geblokkeerd zijn?",
	"tt7u2r": "Hoe kan ik controleren of ID's geldig zijn?",
	"ttd0xn": "Wat gebeurt er als de standaard blocklist wordt bijgewerkt?",
	"ttf8xd": "Kan het coderen van verschillende nummers identieke ID's produceren?",
	"ttsahq": "Wat is {name}?",
	"tt8wk0": "Waarom is {hashids} geüpgraded naar {name}?",
	"ttf8ad": "Waarom is de {salt} parameter verwijderd?",
	"ttc389": "Is {hashids} compatibel met {name}?",
	"ttxp5w": "Hoe kan ik veilig upgraden van {hashids} naar {name}?",
	"ttbrmk": "Waar kan ik de originele {hashids}-bibliotheken vinden?",
	"ttwb2e": "Hoe kan ik bijdragen?",
	"ttrvdg": "Hoe {name} naar een andere taal porten?",
	"ttj5f7": "{name} is een kleine open-source bibliotheek die korte, unieke, willekeurig uitziende ID's kan genereren uit getallen.",
	"ttox58": "De beste manier om erover na te denken is als een decimaal-naar-hexadecimaal omzetter, maar met een paar extra functies.",
	"ttzijt": "Link verkorten, het genereren van unieke gebeurtenis-ID's voor logboekregistratie, het genereren van ID's voor producten/objecten op een website (zoals YouTube doet voor video's), het genereren van korte ID's voor tekstberichten, bevestigingscodes in e-mails, enz.",
	"tt3njz": "Alle gevoelige data. Gegenereerde ID's zijn geen hashes en kunnen terug gedecodeerd worden naar getallen. Bijvoorbeeld, ze zijn misschien geen goede keuze voor gebruikers-ID's, omdat ze, eenmaal gedecodeerd, het aantal gebruikers van je app kunnen onthullen.",
	"ttmtky": "Ja. {name} kan één of meerdere niet-negatieve getallen encoderen in één ID. Er is geen limiet aan het aantal getallen dat je kunt encoderen, maar er is wel een limiet aan hoe groot een getal kan zijn dat je kunt encoderen (afhankelijk van de implementatietalen).",
	"ttto4f": "Dit is om verschillende redenen nuttig: je zou een UNIX-tijdstempel kunnen encoderen en vervaldatum-ID's kunnen maken, of je zou een database shard-nummer samen met een primaire sleutel kunnen encoderen en besparen op extra databasequery's.",
	"ttekta": "Ja, gegenereerde ID's zijn uniek voor de invoer en het alfabet.",
	"ttl6kc": "Houd er wel rekening mee dat het standaard alfabet zowel hoofdletters als kleine letters bevat, dus standaard ID's zijn hoofdlettergevoelig.",
	"ttg2e4": "{name} kan geen negatieve getallen encoderen.",
	"ttahi1": "De minimale alfabetlengte is {length} tekens.",
	"ttzi2t": "Het alfabet mag geen meertekenreeks tekens bevatten.",
	"ttnsyi": "{name} kan geen ID's genereren tot een bepaalde lengte, alleen minstens een bepaalde lengte. Het bereik van de minimumlengteparameter ligt tussen {min} en {max}.",
	"ttiq3o": "{name} kan proberen ID's te regenereren tot de lengte van het alfabet, min één.",
	"ttyf26": "De bibliotheek accepteert een aangepast alfabet waaruit het ID's kan genereren. Schud eenvoudig het standaard alfabet dat wordt meegeleverd.",
	"tt6dc3": "Houd er rekening mee dat iemand met voldoende inspanning je geschudde alfabet zou kunnen reverse-engineeren, dus dit is geenszins een techniek om gevoelige gegevens te verbergen.",
	"tth4pj": "Het standaard alfabet is te vinden [hier]({url}).",
	"tt0eos": "Je kunt een van de online tools voor tekenreeks-shuffling gebruiken of onze [speeltuin](/playground).",
	"tt9zcm": "Afhankelijk van je gebruik. Een korter alfabet zal langere ID's produceren, en een langer alfabet zal kortere ID's produceren. Je kunt de [speeltuin](/playground) gebruiken om te testen hoe je ID's eruit zouden kunnen zien.",
	"ttp7pb": "Ja. Houd er rekening mee dat gegenereerde ID's nog steeds tekenreeksen zijn en dat ze met een nul kunnen beginnen.",
	"ttk4jh": "Nee. {name} ondersteunt geen meertekenreeks tekens voor het alfabet. Dat geldt ook voor emoji's en veel andere tekens.",
	"tt17kp": "De bibliotheek kan ID's uitbreiden met overbodige tekens om ze langer te laten lijken. Dit is handig, zodat het niet zo duidelijk is of je een klein getal zoals {min} of een groot getal zoals {max} codeert.",
	"tt4c25": "Decoderen wordt hierdoor niet beïnvloed.",
	"ttqp1x": "Ja, de bibliotheek accepteert een parameter voor de minimale lengte die garandeert dat ID's minstens die lengte hebben.",
	"ttt88f": "Houd er rekening mee dat er geen garantie is hoe lang je ID's zullen zijn, alleen dat ze niet korter zullen zijn dan de door jou opgegeven lengte.",
	"tt59mu": "Tot op zekere hoogte.",
	"tt7vlr": "Het instellen van een maximale lengte is onmogelijk omdat vroeg of laat je ID's zullen overlopen bij een grote genoeg invoer. Daarom wordt alleen de minimumlengteparameter ondersteund en wordt de exacte lengte of maximale lengte niet ondersteund.",
	"ttdswn": "Een blocklist kan voorkomen dat bepaalde woorden in je ID's verschijnen. Dit is nuttig omdat gegenereerde ID's bedoeld zijn om op openbare plaatsen te verschijnen, zoals de URL.",
	"ttf0wd": "{name} wordt geleverd met de [standaard blocklist]({url}) die de meest basis schunnige en ongepaste woorden uit verschillende talen bevat. Je kunt die blocklist natuurlijk uitbreiden met je eigen woorden.",
	"tts1jq": "Woorden in de blocklist worden niet hoofdlettergevoelig gematcht.",
	"tt8eh0": "Korte woorden van minder dan 3 tekens lang zullen niet worden geblokkeerd. Woorden van 3 tekens lang moeten precies overeenkomen met ID's. Woorden van 4 tekens of langer zullen een match veroorzaken als ze een subreeks zijn van de ID.",
	"ttf01d": "Als blocklistwoorden cijfers bevatten (leet speak), zullen ze alleen een match veroorzaken als ze aan het begin of het einde van de ID staan.",
	"ttcz09": "De standaard blocklist bevat de meest voorkomende schunnige en ongepaste woorden uit verschillende talen. Je kunt de volledige lijst [hier]({url}) vinden.",
	"ttxbuw": "Wanneer de gegenereerde ID overeenkomt met een woord in de blocklist, probeert de bibliotheek deze opnieuw te genereren.",
	"ttbgyk": "Als elke poging om de ID opnieuw te genereren mislukt, zal de encode-functie falen en een foutmelding teruggeven. Het is aan de gebruiker om met die foutmelding om te gaan.",
	"ttwkle": "De beste manier om het aantal pogingen tot regeneratie te verminderen is door een langer alfabet te hebben, geen minimumlengte in te stellen, en een kleinere blocklist te gebruiken. Het gebruik van een lege blocklist schakelt de functie volledig uit.",
	"ttr2ng": "Decoderen van ID's zal meestal enige vorm van numerieke output opleveren, maar dat betekent niet noodzakelijkerwijs dat de ID canoniek is. Om te controleren of de ID geldig is, kun je gedecodeerde getallen opnieuw encoderen en controleren of de ID overeenkomt.",
	"ttjud7": "De reden waarom dit niet automatisch wordt gedaan, is dat als de standaard blocklist in de toekomst verandert, we niet automatisch de ID willen ongeldig maken die in het verleden is gegenereerd en mogelijk nu overeenkomt met een nieuw blocklistwoord.",
	"ttowu8": "We zullen er zeker van zijn om de {changelog} bij te werken als en wanneer de standaard blocklist verandert.",
	"ttzo7t": "Je moet rekening houden met scenario's waarin een nieuw woord aan de standaard blocklist kan worden toegevoegd. In dat geval kan het opnieuw encoderen van getallen een andere ID opleveren.",
	"tt3i7z": "De beste manier om ervoor te zorgen dat je ID's consistent blijven bij toekomstige updates, is door een aangepaste blocklist te gebruiken, zelfs als die identiek is aan de huidige standaard blocklist.",
	"ttmfhy": "Nee, het encoderen van verschillende getallen zal unieke ID's opleveren.",
	"ttt85f": "Echter, vanwege het ontwerp van het algoritme kan het decoderen van willekeurige ID's soms dezelfde getallen produceren. De beste manier om te controleren of de ID canoniek is, is door simpelweg gedecodeerde getallen opnieuw te encoderen en te controleren of de ID overeenkomt.",
	"ttehfa": "{hashids} was de eerste versie van deze bibliotheek die rond 2013 uitkwam. Het produceerde ook korte ID's maar gebruikte een iets andere methode.",
	"ttl3hc": "{hashids} behandelde een paar dingen anders.",
	"ttgla4": "Het ondersteunde geen aangepaste blocklist, maar vertrouwde in plaats daarvan op de meest voorkomende Engelse scheldwoorden. Het gebruikte ook de {salt}-parameter om het alfabet te schudden wat het een beetje verwarrend maakte omdat de bibliotheek niets met encryptie te maken heeft. Bovendien gebruikte het te veel gereserveerde tekens, waardoor langere ID's werden geproduceerd.",
	"ttajo1": "Daarom hebben we besloten te upgraden en opnieuw te branden. Het algoritme is vereenvoudigd, er zijn een paar functies toegevoegd en de code repositories zijn nu allemaal onder [één dak]({url}).",
	"ttzolt": "De {salt}-parameter werd gebruikt om het alfabet te schudden, en het was nooit bedoeld om geassocieerd te worden met veiligheid of beveiliging. Zowel {hashids} als {name} werken op een vergelijkbare manier als de omzetting van decimaal naar hexadecimaal, maar met een paar aanpassingen. Er is geen enkele vorm van encryptie, dus om verwarring te voorkomen, is die parameter volledig verwijderd.",
	"ttnq6i": "Nee, {name} breidt de functionaliteit van {hashids} uit en heeft verschillende ontwerpdoelen en vereisten; daarom zijn gegenereerde ID's niet compatibel met {hashids}.",
	"ttixzo": "Omdat er geen compatibiliteit is tussen {hashids} en {name}, is het onmogelijk om eenvoudig {hashids} te vervangen door {name}.",
	"ttydl6": "Je kunt echter de twee samenvoegen door te differentiëren welke ID bij welke bibliotheek hoort.",
	"tt6n93": "Een van de manieren om dat te doen, is op ID-lengte - als je overschakelt naar {name}, kun je een hogere minimale lengte opgeven. Een andere manier is om handmatig een aangepast teken toe te voegen/vooraf toe te voegen aan de nieuw gegenereerde ID's.",
	"tth5bj": "Tenslotte kun je ook proberen een ID te decoderen met {hashids} om te zien of het geldig is. Zo niet - decodeer en codeer opnieuw met {name} om te zien of dat werkt.",
	"tt0a8s": "Elke taalimplementatie op deze website linkt naar de originele {hashids}-repository als die bestaat.",
	"tt9t9m": "Als je het project wilt ondersteunen, waarderen we het als je onze repos op Github een ster geeft voor meer zichtbaarheid.",
	"ttpgkb": "Als je een ontwikkelaar bent en geen implementatie van {name} ziet voor een bepaalde taal, help ons dan om de bibliotheek om te zetten. Hetzelfde geldt voor een programmeertaal die niet wordt vermeld.",
	"ttk57h": "Als je een fout ziet in de specificatie of een van de implementaties, maak dan een issue of een pullverzoek aan met een voorgestelde fix in de juiste repository.",
	"tt1rhp": "Als je meerdere talen spreekt, kunnen we je hulp gebruiken bij [het verfijnen van de blocklist]({blocklist}) en [het aanpassen van websitevertalingen]({i18n}) als je problemen ziet.",
	"tt49l5": "Als je ervaring hebt met {hashids}/{name}, help dan onze gemeenschap te begeleiden door vragen van anderen te beantwoorden.",
	"ttqbpx": "Als je {name} wilt omzetten naar een van de volgende talen (of een nieuwe die hier niet wordt vermeld):",
	"ttt00f": "Fork de officiële repo naar je eigen Github-account & implementeer [de specificatie]({spec}) samen met alle tests. Je kunt een van de bestaande README's hergebruiken ([voorbeeld]({example})).",
	"tt5myu": "Zodra de bibliotheek klaar is, maak je een pullverzoek. Zodra samengevoegd, zullen we de website bijwerken.",
	"tt72cr": "Als de repo geen actieve beheerders heeft, nodigen we je graag uit om de repo te beheren en een officiële beheerder te worden.",
	"ttdqen": "Als je een expert bent in de volgende dingen, geef ons dan een seintje als je de bibliotheek wilt omzetten:",
	"ttfsed": "Niet gevonden",
	"ttsp7q": "Andere talen"
}
