{
	"tt52up": "Generuj krótkie unikatowe identyfikatory",
	"tt75ra": "{name}{pronounced} to biblioteka typu open-source, która pozwala generować krótkie, unikatowe identyfikatory na podstawie liczb. Identyfikatory te są bezpieczne dla adresów URL, mogą kodować kilka liczb i nie zawierają popularnych wulgaryzmów.",
	"ttd0n6": "Czytaj więcej",
	"ttf0dj": "Oto jak one wyglądają:",
	"ttspqb": "Zastosowania",
	"tt810r": "Głównym zastosowaniem {name} jest aspekt wizualny. Jeśli chcesz używać identyfikatorów zamiast liczb w swoim projekcie, {name} może być dobrym wyborem.",
	"ttfxdj": "Dobre dla",
	"ttcn90": "Nie dobre dla",
	"ttxrw3": "Kodowanie kluczy głównych",
	"ttblk8": "Jeśli używasz bazy danych relacyjnej",
	"ttw5eb": "Oszczędzanie zapytań do bazy danych",
	"ttrzg4": "Poprzez kodowanie wielu obiektów",
	"ttj376": "Tymczasowe tokeny logowania",
	"ttor8c": "Bez wulgaryzmów i bezpieczne dla adresów URL",
	"ttzbtd": "Dane wrażliwe",
	"tt3bzl": "Nie jest to biblioteka szyfrująca",
	"ttm1yo": "Identyfikatory użytkowników",
	"ttt7ff": "Może ujawnić liczbę użytkowników, jeśli ktoś pozna alfabet kodowania",
	"tte6as": "FAQ",
	"ttl1c7": "Plac zabaw",
	"ttgq43": "Biblioteka",
	"ttaf1b": "Funkcje",
	"ttz5td": "Generuj krótkie identyfikatory na podstawie liczb nieujemnych",
	"ttncim": "Proste kodowanie i dekodowanie",
	"ttimoo": "Automatycznie generowane identyfikatory nie zawierają popularnych wulgaryzmów",
	"tty56c": "Wsparcie dla niestandardowych identyfikatorów za pomocą przemieszanego alfabetu",
	"tt6v30": "Każda wersja generuje te same identyfikatory",
	"tthejy": "Mała biblioteka z licencją pozwalającą na swobodne wykorzystanie",
	"tt0ds2": "{count} integracji ({new} korzystających z nowego projektu)",
	"tt9vmk": "Zacznij",
	"ttpebs": "Co używasz?",
	"ttkph9": "Nie mogę go znaleźć",
	"tt1ap4": "Daj nam znać o tym?",
	"tt445i": "Przykład",
	"ttqewx": "Alfabet",
	"tttnnf": "Liczby",
	"tt52lu": "Wygenerowany identyfikator",
	"tt74ur": "mieszaj",
	"ttdosn": "Mieszaj",
	"ttfisd": "nowy",
	"ttswbq": "Zaproponuj edycję tłumaczenia tekstu",
	"tt8qp0": "Sponsor",
	"ttfiwd": "Popularny",
	"ttcyi9": "Zadaj pytanie",
	"ttxagw": "Znalazłeś błąd?",
	"ttbjck": "{name} został ulepszony i odświeżony",
	"ttw1ue": "Oceń {what} na {github}",
	"ttr5tg": "Szybki przykład szyfrowania i deszyfrowania:",
	"ttjgz7": "Jeśli identyfikatory są zbyt krótkie, możesz je wydłużyć do określonej długości:",
	"ttosg8": "Twórz unikalne identyfikatory poprzez przetasowywanie alfabetu:",
	"ttzdkt": "Pełna dokumentacja znajduje się na",
	"tt3fkz": "Rozpocznij",
	"ttm3py": "Jeśli szukasz oryginalnego {name}, znajdziesz go tutaj:",
	"tttnrf": "{name} dla {lang} nie jest jeszcze gotowy.",
	"ttep3a": "Prosimy o oznaczenie repozytorium gwiazdką, aby umieścić je na naszej liście zadań do wykonania:",
	"ttlmpc": "Jeśli chcesz pomóc w urzeczywistnieniu tej wersji, znajdziesz sekcję FAQ dotyczącą tego jak to zrobić:",
	"ttgux4": "Jak przenieść {name} do innego języka?",
	"ttabd1": "Jeśli szukasz oryginalnego projektu {name}, znajdziesz go tutaj:",
	"ttzdut": "Prosimy zauważyć, że nie będzie on kompatybilny z obecnym algorytmem, gdy ta wersja zostanie ukończona.",
	"ttn89i": "{name} to biblioteka typu open-source, która pozwala generować krótkie unikatowe identyfikatory na podstawie liczb. Obsługuje {count} języków programowania.",
	"tti0yo": "Krótkie unikatowe identyfikatory w {lang}",
	"ttyzu6": "Generuj krótkie unikatowe identyfikatory w {lang} za pomocą {name}. Te identyfikatory są bezpieczne dla adresów URL, mogą kodować kilka liczb i nie zawierają popularnych wulgaryzmów.",
	"tt6t23": "Plac zabaw {name}. Eksploruj bibliotekę kodowania i dekodowania {name}.",
	"tthraj": "Najczęściej zadawane pytania dotyczące {name}.",
	"tt0xns": "Minimalna długość",
	"tt962m": "Lista blokowana",
	"ttphab": "Dodaj własne niestandardowe słowa oddzielone spacją...",
	"ttk7bh": "Użyj domyślnej listy blokowanej także",
	"tt1k1p": "Domyślny",
	"tt42u5": "Krótki",
	"ttqaex": "Długi",
	"tttiif": "Litery",
	"tt5lcu": "Małe litery",
	"tt75vr": "Wielkie litery",
	"ttd8qn": "Lista",
	"ttfoqd": "Szyfruj",
	"ttsekq": "Deszyfruj",
	"tt8xb0": "Szyfruj wielokrotnie",
	"ttfoed": "Szyfruj dodatkowe zero",
	"ttc6o9": "Szyfruj dułą stałą",
	"ttx14w": "Identyfikator",
	"ttb79k": "Kodowanie tych liczb:",
	"ttwpve": "Wygeneruje:",
	"ttrufg": "Odkodowanie tego ID:",
	"ttj4t7": "Alfabet musi mieć co najmniej {count} znaków",
	"ttoq48": "Spacje w alfabecie zostaną zignorowane",
	"ttznht": "Słowa na liście blokowanej krótsze niż {count} znaków będą ignorowane",
	"tt3dhz": "blok",
	"ttmzby": "Ogólnie",
	"tttigf": "Do czego to służy?",
	"ttebza": "Do czego to się nie nadaje?",
	"ttlybc": "Czy mogę zakodować kilka liczb naraz?",
	"ttgvw4": "Czy wygenerowane ID są unikalne?",
	"ttakn1": "Jakie ograniczenia ma {name}?",
	"ttznvt": "Wspomóż",
	"ttn0mi": "Czyhające pułapki",
	"ttis6o": "Wypełnienie",
	"ttytv6": "Jak mogę uczynić moje ID unikalnymi?",
	"tt6fl3": "Jak mogę przetasować domyślny alfabet?",
	"tthg1j": "Czy lepiej używać krótszego czy dłuższego alfabetu?",
	"tt0wis": "Czy mój alfabet może składać się wyłącznie z liczb?",
	"tt93lm": "Czy mogę używać emoji jako alfabetu?",
	"ttpj1b": "Dlaczego wypełniać ID?",
	"ttkrkh": "Czy mogę wygenerować dłuższe ID?",
	"tt1jbp": "Czy mogę ustawić określoną długość wygenerowanych ID?",
	"tt4lv5": "Dlaczego używać listy blokowanej?",
	"ttq1ax": "Jak działa lista blokowana?",
	"tttoof": "Jakie słowa znajdują się na domyślnej liście blokowanej?",
	"tt5c9u": "Co się dzieje, gdy wszystkie ID są zablokowane?",
	"tt7u2r": "Jak sprawdzić, czy ID są ważne?",
	"ttd0xn": "Co się dzieje, gdy domyślna lista blokowana zostanie zaktualizowana?",
	"ttf8xd": "Czy zakodowanie różnych liczb może dać identyczne ID?",
	"ttsahq": "Co to jest {name}?",
	"tt8wk0": "Dlaczego {hashids} został ulepszony do {name}?",
	"ttf8ad": "Dlaczego parametr {salt} został usunięty?",
	"ttc389": "Czy {hashids} jest kompatybilny z {name}?",
	"ttxp5w": "Jak mogę bezpiecznie zaktualizować z {hashids} do {name}?",
	"ttbrmk": "Gdzie mogę znaleźć oryginalne biblioteki {hashids}?",
	"ttwb2e": "Jak mogę przyczynić się?",
	"ttrvdg": "Jak przenieść {name} do innego języka?",
	"ttj5f7": "{name} to niewielka, otwarta biblioteka, która może generować krótkie, unikalne identyfikatory wyglądające na losowe z liczb.",
	"ttox58": "Najlepiej myśleć o tym jak o konwerterze dziesiętnym na szesnastkowy, ale z kilkoma dodatkowymi funkcjami.",
	"ttzijt": "Skracanie linków, generowanie unikalnych identyfikatorów zdarzeń do logowania, generowanie identyfikatorów dla produktów/obiektów na stronie internetowej (jak to robi YouTube dla filmów), generowanie krótkich identyfikatorów dla wiadomości tekstowych, kodów potwierdzających w e-mailach itp.",
	"tt3njz": "Dowolne dane, które są wrażliwe. Generowane identyfikatory nie są skrótami (haszami) i mogą być odkodowane z powrotem na liczby. Na przykład mogą nie być dobrym wyborem dla identyfikatorów użytkowników, ponieważ po odkodowaniu mogą ujawnić liczbę użytkowników Twojej aplikacji.",
	"ttmtky": "Tak. {name} może zakodować jedną lub wiele liczb nieujemnych do jednego identyfikatora. Nie ma ograniczenia co do liczby liczb, które możesz zakodować, ale istnieje ograniczenie, jak dużą liczbę możesz zakodować (w zależności od języka implementacji).",
	"ttto4f": "Jest to przydatne z kilku powodów: możesz zakodować znacznik czasu UNIX i tworzyć identyfikatory wygasające, lub możesz zakodować numer fragmentu bazy danych razem z kluczem głównym i zaoszczędzić na dodatkowych zapytaniach do bazy danych.",
	"ttekta": "Tak, wygenerowane identyfikatory są unikalne dla danego wejścia i alfabetu.",
	"ttl6kc": "Pamiętaj jednak, że domyślny alfabet zawiera zarówno małe, jak i duże litery, więc domyślne identyfikatory są rozróżniające wielkość liter.",
	"ttg2e4": "{name} nie może zakodować liczb ujemnych.",
	"ttahi1": "Minimalna długość alfabetu to {length} znaków.",
	"ttzi2t": "Alfabet nie może zawierać znaków wielobajtowych.",
	"ttnsyi": "{name} nie może generować identyfikatorów do określonej długości, jedynie co najmniej określonej długości. Zakres parametru minimalnej długości mieści się między {min} a {max}.",
	"ttiq3o": "{name} może próbować odtworzyć identyfikatory do długości alfabetu minus jeden.",
	"ttyf26": "Biblioteka akceptuje niestandardowy alfabet, z którego można generować identyfikatory. Wystarczy wcześniej przetasować domyślny alfabet.",
	"tt6dc3": "Proszę pamiętać, że przy wystarczających wysiłkach ktoś mógłby odtworzyć Twój przetasowany alfabet, więc nie jest to w żadnym wypadku technika ukrywania danych wrażliwych.",
	"tth4pj": "Domyślny alfabet można znaleźć [tutaj]({url}).",
	"tt0eos": "Możesz użyć dowolnego narzędzia online do tasowania ciągów znaków lub naszego [placu zabaw](/playground).",
	"tt9zcm": "Zależy od Twojego przypadku użycia. Krótszy alfabet wygeneruje dłuższe identyfikatory, a dłuższy alfabet wygeneruje krótsze identyfikatory. Możesz użyć [placu zabaw](/playground), aby sprawdzić, jak mogą wyglądać Twoje identyfikatory.",
	"ttp7pb": "Tak. Pamiętaj, że wygenerowane identyfikatory są ciągami znaków i mogą zaczynać się od zera.",
	"ttk4jh": "Nie. {name} nie obsługuje znaków wielobajtowych dla alfabetu. Dotyczy to także emoji oraz wielu innych znaków.",
	"tt17kp": "Biblioteka może rozszerzać identyfikatory o znaki śmieciowe, aby wydawały się dłuższe. Jest to przydatne, aby nie było tak oczywiste, czy kodujesz małą liczbę jak {min}, czy dużą liczbę jak {max}.",
	"tt4c25": "Odkodowanie nie jest dotknięte.",
	"ttqp1x": "Tak, biblioteka akceptuje parametr minimalnej długości, który gwarantuje, że identyfikatory będą miały przynajmniej taką długość.",
	"ttt88f": "Proszę zauważyć, że nie ma gwarancji, jak długie będą Twoje identyfikatory — tylko, że nie będą krótsze niż określona przez Ciebie długość.",
	"tt59mu": "Do pewnego stopnia.",
	"tt7vlr": "Ustalenie maksymalnej długości jest niemożliwe, ponieważ wcześniej czy później Twoje identyfikatory przekroczą rozmiar przy dostatecznie dużym wejściu. Dlatego obsługiwany jest tylko parametr minimalnej długości, a dokładna długość lub maksymalna długość nie jest.",
	"ttdswn": "Lista blokowanych słów może zapobiec pojawianiu się pewnych słów w Twoich identyfikatorach. Jest to korzystne, ponieważ generowane identyfikatory mają pojawiać się w miejscach publicznych, takich jak adres URL.",
	"ttf0wd": "{name} zawiera [domyślną listę blokowanych słów]({url}), która zawiera najbardziej podstawowe wulgaryzmy i nieodpowiednie słowa z kilku języków. Oczywiście możesz rozszerzyć tę listę blokowanych słów o własne słowa.",
	"tts1jq": "Porównywanie słów z listy blokowanych jest niezależne od wielkości liter.",
	"tt8eh0": "Krótkie słowa krótsze niż 3 znaki nie będą blokowane. Słowa o długości 3 znaków muszą dokładnie pasować do identyfikatorów. Słowa o długości 4 znaków lub dłuższe spowodują dopasowanie, jeśli są podciągiem identyfikatora.",
	"ttf01d": "Jeśli słowa z listy blokowanych zawierają liczby (w języku przestępnym), dopasowanie następuje tylko wtedy, gdy znajdują się na początku lub na końcu identyfikatora.",
	"ttcz09": "Domyślna lista blokowanych słów zawiera najczęstsze wulgaryzmy i nieodpowiednie słowa z kilku języków. Pełną listę znajdziesz [tutaj]({url}).",
	"ttxbuw": "Jeśli wygenerowany identyfikator pasuje do słowa z listy blokowanych, biblioteka próbuje go odtworzyć.",
	"ttbgyk": "Jeśli każda próba odtworzenia identyfikatora kończy się niepowodzeniem, funkcja kodowania zakończy się błędem. Obsługa tego błędu należy do użytkownika.",
	"ttwkle": "Najlepszym sposobem zmniejszenia liczby prób odtworzenia jest posiadanie dłuższego alfabetu, nieustawianie minimalnej długości i podanie mniejszej listy blokowanych słów. Podanie pustej listy blokowanych wyłączy tę funkcję całkowicie.",
	"ttr2ng": "Odkodowywanie identyfikatorów zazwyczaj generuje jakiegoś rodzaju wynik liczbowy, ale to nie oznacza koniecznie, że identyfikator jest kanoniczny. Aby sprawdzić, czy identyfikator jest poprawny, możesz ponownie zakodować odkodowane liczby i sprawdzić, czy identyfikator się zgadza.",
	"ttjud7": "Powodem, dla którego to nie jest robione automatycznie, jest to, że jeśli domyślna lista blokowanych słów zmieni się w przyszłości, nie chcemy automatycznie unieważnić identyfikatora, który został wygenerowany w przeszłości i teraz może pasować do nowego słowa z listy blokowanych.",
	"ttowu8": "Upewnimy się, że zaktualizujemy {changelog}, kiedy i jeśli domyślna lista blokowanych słów ulegnie zmianie.",
	"ttzo7t": "Musisz uwzględnić przypadki, gdy do domyślnej listy blokowanych słów może zostać wprowadzone nowe słowo. W takim przypadku ponowne kodowanie liczb może spowodować wygenerowanie innego identyfikatora.",
	"tt3i7z": "Najlepszym sposobem zapewnienia spójności Twoich identyfikatorów podczas przyszłych aktualizacji jest dostarczenie niestandardowej listy blokowanych słów, nawet jeśli jest identyczna z aktualną domyślną listą blokowanych słów.",
	"ttmfhy": "Nie, zakodowanie różnych liczb spowoduje wygenerowanie unikalnych identyfikatorów.",
	"ttt85f": "Jednakże, ze względu na sposób działania algorytmu, odkodowanie losowych identyfikatorów czasami może wygenerować te same liczby. Najlepszym sposobem sprawdzenia, czy identyfikator jest kanoniczny, jest po prostu ponowne zakodowanie odkodowanych liczb i sprawdzenie, czy identyfikator się zgadza.",
	"ttehfa": "{hashids} był pierwszą wersją tej biblioteki, która pojawiła się około 2013 roku. Również generował krótkie identyfikatory, ale używał nieco innej metody.",
	"ttl3hc": "{hashids} obsługiwał kilka rzeczy inaczej.",
	"ttgla4": "Nie wspierał niestandardowej listy blokowanych słów, lecz polegał na najczęstszych angielskich wulgaryzmach. Wykorzystywał także parametr {salt} do przetasowywania alfabetu, co sprawiało pewne zamieszanie, ponieważ biblioteka nie miała nic wspólnego z szyfrowaniem. Dodatkowo używał zbyt wielu zarezerwowanych znaków, co skutkowało dłuższymi identyfikatorami.",
	"ttajo1": "W związku z tym postanowiliśmy dokonać ulepszenia i rebrandingu. Algorytm został uproszczony, dodano kilka funkcji, a wszystkie repozytoria kodu znajdują się teraz [pod jednym adresem]({url}).",
	"ttzolt": "Parametr {salt} służył do przetasowywania alfabetu i nigdy nie miał związku z bezpieczeństwem. Zarówno {hashids}, jak i {name} działają podobnie do konwersji dziesiętnej na szesnastkową, ale z kilkoma dostosowaniami. Nie ma tu żadnego szyfrowania, dlatego w celu uniknięcia zamieszania ten parametr został całkowicie usunięty.",
	"ttnq6i": "Nie, {name} rozwija funkcjonalność {hashids} i ma inne cele i wymagania projektowe; dlatego wygenerowane identyfikatory nie są kompatybilne z {hashids}.",
	"ttixzo": "Ponieważ nie ma kompatybilności między {hashids} a {name}, niemożliwe jest po prostu zastąpienie {hashids} przez {name}.",
	"ttydl6": "Jednakże, możesz połączyć oba, różnicując, które identyfikatory należą do której biblioteki.",
	"tt6n93": "Jednym ze sposobów na to jest długość identyfikatora - jeśli przechodzisz na {name}, możesz podać wyższą minimalną długość. Innym sposobem jest ręczne dodawanie/odrzucanie niestandardowego znaku do nowo wygenerowanych identyfikatorów.",
	"tth5bj": "Wreszcie, możesz także spróbować odkodować identyfikator za pomocą {hashids}, aby sprawdzić, czy jest poprawny. Jeśli nie - odkoduj i zakoduj ponownie za pomocą {name}, aby sprawdzić, czy to działa.",
	"tt0a8s": "Każda implementacja językowa na tej stronie odnosi się do oryginalnego repozytorium {hashids}, jeśli istnieje.",
	"tt9t9m": "Jeśli chcesz wesprzeć projekt, będziemy wdzięczni za dodanie gwiazdki do naszych repozytoriów na Githubie, aby były bardziej widoczne.",
	"ttpgkb": "Jeśli jesteś programistą i nie widzisz implementacji {name} dla określonego języka, pomóż nam przekonwertować bibliotekę. To samo dotyczy języka programowania, który nie jest wymieniony.",
	"ttk57h": "Jeśli zauważysz błąd w specyfikacji lub którejkolwiek z implementacji, proszę utwórz problem lub żądanie przeciągnięcia z sugerowaną poprawką w odpowiednim repozytorium.",
	"tt1rhp": "Jeśli znasz kilka języków, możemy potrzebować Twojej pomocy w [dostosowaniu listy blokowanych słów]({blocklist}) i [poprawie tłumaczeń na stronie]({i18n}), jeśli zauważysz jakieś problemy.",
	"tt49l5": "Wreszcie, jeśli masz doświadczenie z {hashids}/{name}, pomóż prowadzić naszą społeczność, odpowiadając na pytania, które mogą się pojawić.",
	"ttqbpx": "Jeśli chcesz przenieść {name} do jednego z poniższych języków (lub nowego, który nie jest tu wymieniony):",
	"ttt00f": "Sforkuj oficjalne repozytorium na swoje konto Github i zaimplementuj [specyfikację]({spec}) wraz z wszystkimi testami. Możesz ponownie wykorzystać któreś z istniejących plików README ([przykład]({example})).",
	"tt5myu": "Gdy biblioteka będzie gotowa, utwórz żądanie przeciągnięcia. Po scaleniu zaktualizujemy stronę internetową.",
	"tt72cr": "Jeśli repozytorium nie ma aktywnych opiekunów, chętnie zaprosimy Cię do zarządzania nim i zostania oficjalnym opiekunem.",
	"ttdqen": "Jeśli jesteś ekspertem w tych dziedzinach, daj nam znać, jeśli chcesz przenieść bibliotekę:",
	"ttfsed": "Nie znaleziono",
	"ttsp7q": "Inne",
	"tt8aj0": "Wypróbuj:",
	"ttfspd": "[{clickhouse}]({url1}) oferuje wbudowaną funkcję SQL do generowania {name} z domyślnymi parametrami. Funkcja jest dostępna od wersji {clickhouse} [{version}]({url2}):"
}
