{
	"tt52up": "Генерация коротких уникальных идентификаторов",
	"tt75ra": "{name}{pronounced} - это библиотека с открытым исходным кодом, которая позволяет генерировать короткие уникальные идентификаторы из чисел. Эти идентификаторы безопасны для URL, могут кодировать несколько чисел и не содержат обычные слова из списка непристойной лексики.",
	"ttd0n6": "Подробнее",
	"ttf0dj": "Вот как они выглядят:",
	"ttspqb": "Варианты использования",
	"tt810r": "Основное применение {name} - это чисто визуальное. Если вы хотите использовать идентификаторы вместо чисел в своем проекте, {name} может быть хорошим выбором.",
	"ttfxdj": "Подходит для",
	"ttcn90": "Не подходит для",
	"ttxrw3": "Кодирование первичных ключей",
	"ttblk8": "Если вы используете реляционную базу данных",
	"ttw5eb": "Экономия запросов к базе данных",
	"ttrzg4": "Путем кодирования нескольких объектов",
	"ttj376": "Временные токены входа",
	"ttor8c": "Без непристойной лексики и безопасные для URL",
	"ttzbtd": "Чувствительные данные",
	"tt3bzl": "Это не библиотека шифрования",
	"ttm1yo": "Идентификаторы пользователей",
	"ttt7ff": "Могут раскрывать количество пользователей, если кто-то узнает алфавит кодирования",
	"tte6as": "ЧаВо",
	"ttl1c7": "Площадка",
	"ttgq43": "Библиотека",
	"ttaf1b": "Особенности",
	"ttz5td": "Генерация коротких идентификаторов из неотрицательных чисел",
	"ttncim": "Простое кодирование и декодирование",
	"ttimoo": "Автоматически сгенерированные идентификаторы не содержат общей непристойной лексики",
	"tty56c": "Поддержка пользовательских идентификаторов через перемешанный алфавит",
	"tt6v30": "Каждая версия производит одинаковые идентификаторы",
	"tthejy": "Небольшая библиотека с разрешительной лицензией",
	"tt0ds2": "{count} интеграций ({new} с использованием нового дизайна)",
	"tt9vmk": "Начать",
	"ttpebs": "Что вы используете?",
	"ttkph9": "Не можете найти?",
	"tt1ap4": "Сообщите нам об этом?",
	"tt445i": "Пример",
	"ttqewx": "Алфавит",
	"tttnnf": "Числа",
	"tt52lu": "Сгенерированный идентификатор",
	"tt74ur": "перемешивание",
	"ttdosn": "Перемешать",
	"ttfisd": "новый",
	"ttswbq": "Предложите правку перевода текста",
	"tt8qp0": "Спонсор",
	"ttfiwd": "Популярные",
	"ttcyi9": "Задать вопрос",
	"ttxagw": "Нашли баг?",
	"ttbjck": "{name} был обновлен и переименован",
	"ttw1ue": "Поставьте звезду {what} на {github}",
	"ttr5tg": "Быстрый пример кодирования и декодирования:",
	"ttjgz7": "Если идентификаторы слишком короткие, вы можете дополнить их до определенной длины:",
	"ttosg8": "Создание уникальных идентификаторов путем перемешивания алфавита:",
	"ttzdkt": "Полная документация находится на",
	"tt3fkz": "Начать",
	"ttm3py": "Если вы ищете оригинальный {name}, вы можете найти его здесь:",
	"tttnrf": "{name} для {lang} еще не готов.",
	"ttep3a": "Пожалуйста, поставьте звезду репозиторию, чтобы поднять его в нашем списке задач:",
	"ttlmpc": "Если вы хотите помочь оживить эту версию, есть раздел FAQ о том, как это сделать:",
	"ttgux4": "Как перенести {name} на другой язык?",
	"ttabd1": "Если вы ищете оригинальный проект {name}, вы можете найти его здесь:",
	"ttzdut": "Обратите внимание, что он не будет совместим с текущим алгоритмом, как только эта версия будет завершена.",
	"ttn89i": "{name} - это библиотека с открытым исходным кодом, которая позволяет генерировать короткие уникальные идентификаторы из чисел. Поддерживает {count} языков программирования.",
	"tti0yo": "Короткие уникальные идентификаторы на {lang}",
	"ttyzu6": "Генерация коротких уникальных идентификаторов на {lang} с использованием {name}. Эти идентификаторы безопасны для URL, могут кодировать несколько чисел и не содержат общей непристойной лексики.",
	"tt6t23": "Площадка {name}. Изучение кодирования и декодирования библиотеки {name}.",
	"tthraj": "Часто задаваемые вопросы для {name}.",
	"tt0xns": "Минимальная длина",
	"tt962m": "Список блокировки",
	"ttphab": "Добавьте свои собственные слова для блокировки, разделяя их пробелами…",
	"ttk7bh": "Использовать также стандартный список блокировки",
	"tt1k1p": "Стандартный",
	"tt42u5": "Короткий",
	"ttqaex": "Длинный",
	"tttiif": "Буквы",
	"tt5lcu": "Строчные буквы",
	"tt75vr": "Прописные буквы",
	"ttd8qn": "Список",
	"ttfoqd": "Кодировать",
	"ttsekq": "Декодировать",
	"tt8xb0": "Кодировать несколько",
	"ttfoed": "Кодировать дополнительный ноль",
	"ttc6o9": "Кодировать большую константу",
	"ttx14w": "Идентификатор",
	"ttb79k": "Кодирование этих чисел:",
	"ttwpve": "Будет сгенерировано:",
	"ttrufg": "Декодирование этого идентификатора:",
	"ttj4t7": "Алфавит должен содержать как минимум {count} символов",
	"ttoq48": "Пробелы в алфавите будут проигнорированы",
	"ttznht": "Слова из списка блокировки короче {count} символов будут проигнорированы",
	"tt3dhz": "блок",
	"ttmzby": "Общее",
	"tttigf": "Для чего это полезно?",
	"ttebza": "Что ему не подходит?",
	"ttlybc": "Могу ли я кодировать сразу несколько чисел?",
	"ttgvw4": "Являются ли сгенерированные идентификаторы уникальными?",
	"ttakn1": "Какие ограничения у {name}?",
	"ttznvt": "Внести вклад",
	"ttn0mi": "Подводные камни",
	"ttis6o": "Дополнение",
	"ttytv6": "Как сделать мои идентификаторы уникальными?",
	"tt6fl3": "Как перемешать стандартный алфавит?",
	"tthg1j": "Что лучше использовать - короткий или длинный алфавит?",
	"tt0wis": "Может ли алфавит состоять только из чисел?",
	"tt93lm": "Могу ли я использовать эмодзи в качестве алфавита?",
	"ttpj1b": "Почему дополнять идентификаторы?",
	"ttkrkh": "Могу ли я увеличить длину сгенерированных идентификаторов?",
	"tt1jbp": "Могу ли я сделать длину сгенерированных идентификаторов определенной?",
	"tt4lv5": "Зачем использовать список блокировки?",
	"ttq1ax": "Как работает список блокировки?",
	"tttoof": "Какие слова находятся в списке блокировки?",
	"tt5c9u": "Что произойдет, если все идентификаторы будут заблокированы?",
	"tt7u2r": "Как проверить, являются ли идентификаторы допустимыми?",
	"ttd0xn": "Что происходит при обновлении стандартного списка блокировки?",
	"ttf8xd": "Может ли кодирование разных чисел дать идентичные идентификаторы?",
	"ttsahq": "Что такое {name}?",
	"tt8wk0": "Почему {hashids} был обновлен до {name}?",
	"ttf8ad": "Почему был удален параметр {salt}?",
	"ttc389": "Совместим ли {hashids} с {name}?",
	"ttxp5w": "Как безопасно обновиться с {hashids} до {name}?",
	"ttbrmk": "Где я могу найти оригинальные библиотеки {hashids}?",
	"ttwb2e": "Как я могу внести свой вклад?",
	"ttrvdg": "Как перенести {name} на другой язык?",
	"ttj5f7": "{name} - это небольшая библиотека с открытым исходным кодом, которая может создавать короткие, уникальные и случайные идентификаторы из чисел.",
	"ttox58": "Лучший способ понять это - это как конвертер из десятичной в шестнадцатеричную систему с несколькими дополнительными функциями.",
	"ttzijt": "Для сокращения ссылок, генерации уникальных идентификаторов событий для журналирования, генерации идентификаторов для продуктов/объектов на веб-сайте (как делает YouTube для видеороликов), генерации коротких идентификаторов для текстовых сообщений, кодов подтверждения в электронных письмах и т. д.",
	"tt3njz": "Любые данные, которые не являются конфиденциальными. Сгенерированные идентификаторы не являются хэшами и могут быть раскодированы обратно в числа. Например, они могут не подходить для идентификаторов пользователей, потому что после декодирования они могут раскрыть количество пользователей вашего приложения.",
	"ttmtky": "Да, {name} может кодировать одно или несколько неотрицательных чисел в один идентификатор. Нет ограничений на количество чисел, которые вы можете закодировать, но есть ограничение на размер числа (в зависимости от языка реализации).",
	"ttto4f": "Это полезно по нескольким причинам: вы можете закодировать временную метку UNIX и создать идентификаторы с ограниченным сроком действия, или вы можете закодировать номер базы данных вместе с первичным ключом и сэкономить на дополнительных запросах к базе данных.",
	"ttekta": "Да, сгенерированные идентификаторы уникальны для входных данных и алфавита.",
	"ttl6kc": "Тем не менее, стандартный алфавит содержит как строчные, так и прописные буквы, поэтому идентификаторы регистрозависимы.",
	"ttg2e4": "{name} не может кодировать отрицательные числа.",
	"ttahi1": "Минимальная длина алфавита - {length} символов.",
	"ttzi2t": "Алфавит не может содержать многобайтовые символы.",
	"ttnsyi": "{name} не может генерировать идентификаторы до определенной длины, только как минимум определенной длины. Диапазон параметра минимальной длины составляет от {min} до {max}.",
	"ttiq3o": "{name} может попытаться восстановить идентификаторы до длины алфавита минус один.",
	"ttyf26": "Библиотека принимает пользовательский алфавит, из которого можно генерировать идентификаторы. Просто предварительно перемешайте стандартный алфавит, предоставленный.",
	"tt6dc3": "Пожалуйста, имейте в виду, что при достаточных усилиях кто-то может провести обратную инженерию вашего перемешанного алфавита, поэтому это ни в коем случае не приемлемый способ скрыть конфиденциальные данные.",
	"tth4pj": "Стандартный алфавит можно найти [здесь]({url}).",
	"tt0eos": "Вы можете использовать любые онлайн-инструменты для перемешивания строк или наш [плейграунд](/playground).",
	"tt9zcm": "Зависит от вашего случая использования. Более короткий алфавит создаст более длинные идентификаторы, а более длинный алфавит создаст более короткие идентификаторы. Вы можете использовать [плейграунд](/playground), чтобы протестировать, как будут выглядеть ваши идентификаторы.",
	"ttp7pb": "Да. Имейте в виду, что сгенерированные идентификаторы всё равно будут строками, и они могут начинаться с нуля.",
	"ttk4jh": "Нет. {name} не поддерживает многобайтовые символы для алфавита. Сюда также относятся эмодзи, а также многие другие символы.",
	"tt17kp": "Библиотека может расширять идентификаторы ненужными символами, чтобы они выглядели длиннее. Это полезно, чтобы было не так очевидно, кодируете ли вы маленькое число, такое как {min}, или большое число, такое как {max}.",
	"tt4c25": "Декодирование не затрагивается.",
	"ttqp1x": "Да, библиотека принимает параметр минимальной длины, который гарантирует, что идентификаторы будут как минимум такой длины.",
	"ttt88f": "Имейте в виду, что нет гарантии на длину ваших идентификаторов - только то, что они не будут короче указанной вами длины.",
	"tt59mu": "До определенного предела.",
	"tt7vlr": "Установка максимальной длины невозможна, потому что рано или поздно ваши идентификаторы превысят допустимую длину при достаточно большом входе данных. Поэтому поддерживается только параметр минимальной длины, и точная или максимальная длина не поддерживается.",
	"ttdswn": "Список блокировки может предотвратить появление определенных слов в ваших идентификаторах. Это полезно, потому что сгенерированные идентификаторы должны появляться в публичных местах, таких как URL.",
	"ttf0wd": "{name} поставляется со [стандартным списком блокировки]({url}), который содержит наиболее распространенные ненормативную лексику и неподобающие слова из нескольких языков. Конечно же, вы можете расширить этот список собственными словами.",
	"tts1jq": "Сопоставление слов из списка блокировки не зависит от регистра.",
	"tt8eh0": "Короткие слова, менее 3 символов, не будут заблокированы. Слова длиной 3 символа должны полностью совпадать с идентификатором. Слова длиной 4 символа или более будут считаться соответствующими, если они являются подстрокой идентификатора.",
	"ttf01d": "Если слова из списка блокировки содержат цифры (leet-язык), они будут считаться соответствующими, только если они находятся в начале или в конце идентификатора.",
	"ttcz09": "Стандартный список блокировки содержит наиболее распространенную ненормативную лексику и неподобающие слова из нескольких языков. Полный список можно найти [здесь]({url}).",
	"ttxbuw": "Когда сгенерированный идентификатор соответствует слову в черном списке, библиотека пытается его восстановить.",
	"ttbgyk": "Если каждая попытка восстановить идентификатор не удалась, функция кодирования завершится неудачно и вернет ошибку. Обработка этой ошибки зависит от пользователя.",
	"ttwkle": "Лучший способ уменьшить количество попыток регенерации — использовать более длинный алфавит, не устанавливать минимальную длину и предоставить меньший черный список. Предоставление пустого черного списка приведет к полному отключению этой функции.",
	"ttr2ng": "Декодирование идентификаторов обычно дает какой-то числовой результат, но это не обязательно означает, что идентификатор является каноническим. Чтобы проверить корректность идентификатора, вы можете перекодировать декодированные числа и проверить соответствие идентификатора.",
	"ttjud7": "Причина, по которой это не делается автоматически, заключается в том, что если черный список по умолчанию изменится в будущем, мы не хотим автоматически аннулировать идентификатор, который был сгенерирован в прошлом и теперь может соответствовать новому слову черного списка.",
	"ttowu8": "Мы обязательно обновим {changelog}, когда и если изменится черный список по умолчанию.",
	"ttzo7t": "Вы должны учитывать сценарии, в которых новое слово может быть добавлено в черный список по умолчанию. В этом случае перекодирование чисел может привести к получению другого идентификатора.",
	"tt3i7z": "Лучший способ обеспечить согласованность ваших идентификаторов в будущих обновлениях — предоставить собственный черный список, даже если он идентичен текущему черному списку по умолчанию.",
	"ttmfhy": "Нет, кодирование разных чисел приведет к созданию уникальных идентификаторов.",
	"ttt85f": "Однако из-за конструкции алгоритма декодирование случайных идентификаторов иногда может давать одни и те же числа. Лучший способ проверить каноничность идентификатора — просто перекодировать декодированные числа и проверить совпадение идентификатора.",
	"ttehfa": "{hashids} была первой версией этой библиотеки, вышедшей примерно в 2013 году. Она также создавала короткие идентификаторы, но использовала немного другой метод.",
	"ttl3hc": "{hashids} обрабатывает некоторые вещи по-другому.",
	"ttgla4": "Он не поддерживал собственный черный список, а вместо этого использовал наиболее распространенные английские ненормативную лексику. Он также использовал параметр {salt} для перетасовки алфавита, что немного сбивало с толку, поскольку библиотека не имеет ничего общего с шифрованием. Кроме того, было использовано слишком много зарезервированных символов, что привело к созданию более длинных идентификаторов.",
	"ttajo1": "Поэтому мы решили обновить и провести ребрендинг. Алгоритм был упрощен, добавлено несколько функций, и все репозитории кода теперь находятся под [одной крышей]({url}).",
	"ttzolt": "Параметр {salt} использовался для перетасовки алфавита и никогда не предназначался для связи с безопасностью. И {hashids}, и {name} работают аналогично преобразованию десятичных чисел в шестнадцатеричные, но с некоторыми изменениями. Никакого шифрования не существует, поэтому во избежание путаницы этот параметр полностью удален.",
	"ttnq6i": "Нет, {name} расширяет функциональность {hashids} и имеет другие цели и требования к дизайну; следовательно, сгенерированные идентификаторы несовместимы с {hashids}.",
	"ttixzo": "Поскольку между {hashids} и {name} нет совместимости, невозможно просто заменить {hashids} на {name}.",
	"ttydl6": "Однако вы можете объединить их, определив, какой идентификатор принадлежит какой библиотеке.",
	"tt6n93": "Один из способов сделать это — использовать длину идентификатора: если вы переключаетесь на {name}, вы можете указать более высокую минимальную длину. Другой способ — вручную добавить собственный символ к вновь сгенерированным идентификаторам.",
	"tth5bj": "Наконец, вы также можете попытаться декодировать идентификатор с помощью {hashids}, чтобы проверить, действителен ли он. Если нет — декодируйте и перекодируйте с помощью {name}, чтобы проверить, работает ли это.",
	"tt0a8s": "Каждая языковая реализация на этом веб-сайте ссылается на исходный репозиторий {hashids}, если он существует.",
	"tt9t9m": "Если вы хотите поддержать проект, мы будем признательны за пометку наших репозиториев на Github для большей наглядности.",
	"ttpgkb": "Если вы разработчик и не видите реализации {name} для определенного языка, помогите нам преобразовать библиотеку. То же самое касается языка программирования, которого нет в списке.",
	"ttk57h": "Если вы видите ошибку в спецификации или какой-либо реализации, создайте проблему или запрос на включение с предлагаемым исправлением в соответствующем репозитории.",
	"tt1rhp": "Если вы говорите на нескольких языках, нам может пригодиться ваша помощь в [тонкой настройке черного списка]({blocklist}) и [корректировке переводов веб-сайтов]({i18n}), если вы обнаружите какие-либо проблемы.",
	"tt49l5": "Наконец, если у вас есть некоторый опыт работы с {hashids}/{name}, пожалуйста, помогите нашему сообществу, ответив на любые вопросы, которые могут возникнуть у кого-либо.",
	"ttqbpx": "Если вы хотите перенести {name} на один из следующих языков (или новый, не указанный здесь):",
	"ttt00f": "Создайте форк официального репозитория в своей учетной записи Github и внедрите [спецификацию]({spec}) вместе со всеми тестами. Вы можете повторно использовать любой из существующих файлов README ([пример]({example})).",
	"tt5myu": "Как только библиотека будет готова, создайте запрос на включение. После объединения мы обновим сайт.",
	"tt72cr": "Если у репозитория нет активных сопровождающих, мы будем рады предложить вам управлять репозиторием и стать официальным сопровождающим.",
	"ttdqen": "Если вы являетесь экспертом в следующем, пожалуйста, свяжитесь с нами, если вы хотите портировать библиотеку:",
	"ttfsed": "Не найдено",
	"ttsp7q": "Другие",
	"tt8aj0": "Попробуйте:",
	"ttfspd": "[{clickhouse}]({url1}) предоставляет встроенную SQL-функцию для генерации {name} с параметрами по умолчанию. Функция доступна с версии {clickhouse} [{version}]({url2}):"
}
