{
	"tt52up": "Generiši Kratke Jedinstvene ID-ove",
	"tt75ra": "{name}{pronounced} je open-source biblioteka koja vam omogućava da generišete kratke jedinstvene identifikatore iz brojeva. Ovi ID-ovi su bezbedni za URL, mogu kodirati nekoliko brojeva i ne sadrže uobičajene psovke.",
	"ttd0n6": "Pročitaj više",
	"ttf0dj": "Ovako izgledaju:",
	"ttspqb": "Upotrebe",
	"tt810r": "Glavna upotreba {name} je čisto vizuelna. Ako želite da koristite ID-ove umesto brojeva u svom projektu, {name} bi mogao biti dobar izbor.",
	"ttfxdj": "Dobar za",
	"ttcn90": "Nije dobar za",
	"ttxrw3": "Kodiranje primarnih ključeva",
	"ttblk8": "Ako koristite relacionu bazu podataka",
	"ttw5eb": "Čuvanje pretraga baze podataka",
	"ttrzg4": "Kodiranjem više objekata",
	"ttj376": "Privremeni login tokeni",
	"ttor8c": "Bez psovki i siguran za URL",
	"ttzbtd": "Osetljivi podaci",
	"tt3bzl": "Ovo nije biblioteka za šifrovanje",
	"ttm1yo": "Korisnički ID-ovi",
	"ttt7ff": "Može otkriti broj korisnika ako neko sazna abecedu enkodiranja",
	"tte6as": "FAQ",
	"ttl1c7": "Igralište",
	"ttgq43": "Biblioteka",
	"ttaf1b": "Funkcionalnosti",
	"ttz5td": "Generisanje kratkih ID-ova iz ne-negativnih brojeva",
	"ttncim": "Lako kodiranje i dekodiranje",
	"ttimoo": "Automatski generisani ID-ovi ne sadrže uobičajene psovke",
	"tty56c": "Podrška za prilagođene ID-ove putem promenjenog abecede",
	"tt6v30": "Svaka verzija proizvodi iste ID-ove",
	"tthejy": "Mala biblioteka sa dozvolom za upotrebu",
	"tt0ds2": "{count} integracija ({new} koristi novi dizajn)",
	"tt9vmk": "Počnite",
	"ttpebs": "Šta koristite?",
	"ttkph9": "Ne možete da ga pronađete",
	"tt1ap4": "Obavestite nas o tome?",
	"tt445i": "Primer",
	"ttqewx": "Abeceda",
	"tttnnf": "Brojevi",
	"tt52lu": "Generisani ID",
	"tt74ur": "mešanje",
	"ttdosn": "Mešanje",
	"ttfisd": "novi",
	"ttswbq": "Predložite uređivanje prevoda teksta",
	"tt8qp0": "Sponzori",
	"ttfiwd": "Popularno",
	"ttcyi9": "Postavite pitanje",
	"ttxagw": "Pronašli ste grešku?",
	"ttbjck": "{name} je nadograđen i rebranded",
	"ttw1ue": "Oceni {what} na {github}",
	"ttr5tg": "Brzi primer enkodiranja i dekodiranja:",
	"ttjgz7": "Ako su ID-ovi prekratki, možete ih produžiti do određene dužine:",
	"ttosg8": "Kreirajte jedinstvene ID-ove mešanjem abecede:",
	"ttzdkt": "Cela dokumentacija je na",
	"tt3fkz": "Počnite",
	"ttm3py": "Ako tražite originalni {name}, možete ga pronaći ovde:",
	"tttnrf": "{name} za {lang} još uvek nije spreman.",
	"ttep3a": "Molimo vas ocenite repozitorijum kako biste ga pomakli na našoj listi obaveza:",
	"ttlmpc": "Ako želite pomoći u oživljavanju ove verzije, postoji sekcija sa često postavljanim pitanjima o tome kako to učiniti:",
	"ttgux4": "Kako preneti {name} na drugi jezik?",
	"ttabd1": "Ako tražite originalni projekat {name}, možete ga pronaći ovde:",
	"ttzdut": "Napomena: Neće biti kompatibilan sa trenutnim algoritmom nakon završetka ove verzije.",
	"ttn89i": "{name} je open-source biblioteka koja vam omogućava da generišete kratke jedinstvene ID-ove iz brojeva. Podržava {count} programskih jezika.",
	"tti0yo": "Kratki jedinstveni ID-ovi na {lang}",
	"ttyzu6": "Generišite kratke jedinstvene ID-ove na {lang} koristeći {name}. Ovi identifikatori su bezbedni za URL, mogu kodirati nekoliko brojeva i ne sadrže uobičajene psovke.",
	"tt6t23": "{name} igralište. Istražite {name} biblioteku za enkodiranje i dekodiranje.",
	"tthraj": "Često postavljana pitanja za {name}.",
	"tt0xns": "Minimalna dužina",
	"tt962m": "Lista blokiranih",
	"ttphab": "Dodajte svoje reči razdvojene razmacima...",
	"ttk7bh": "Koristite i podrazumevanu listu blokiranih reči",
	"tt1k1p": "Podrazumevano",
	"tt42u5": "Kratko",
	"ttqaex": "Dugo",
	"tttiif": "Slova",
	"tt5lcu": "Mala slova",
	"tt75vr": "Velika slova",
	"ttd8qn": "Lista",
	"ttfoqd": "Enkodiraj",
	"ttsekq": "Dekodiraj",
	"tt8xb0": "Enkodiraj više",
	"ttfoed": "Enkodiraj dodatnu nulu",
	"ttc6o9": "Enkodiraj veliku konstantu",
	"ttx14w": "ID",
	"ttb79k": "Enkodiranje ovih brojeva:",
	"ttwpve": "Proizvešće:",
	"ttrufg": "Dekodiranje ovog ID-a:",
	"ttj4t7": "Abeceda mora imati bar {count} karaktera",
	"ttoq48": "Razmaci u abecedi će biti ignorisani",
	"ttznht": "Reči na listi manje od {count} karaktera biće ignorisane",
	"tt3dhz": "Blokiraj",
	"ttmzby": "Opšte",
	"tttigf": "Za šta je dobro?",
	"ttebza": "Za šta nije dobro?",
	"ttlybc": "Mogu li enkodirati više brojeva odjednom?",
	"ttgvw4": "Da li su generisani ID-ovi jedinstveni?",
	"ttakn1": "Koje su ograničenja {name}?",
	"ttznvt": "Doprinos",
	"ttn0mi": "Sitnice",
	"ttis6o": "Popunjavanje",
	"ttytv6": "Kako mogu učiniti svoje ID-ove jedinstvenim?",
	"tt6fl3": "Kako mogu promešati podrazumevanu abecedu?",
	"tthg1j": "Da li je bolje koristiti kraću ili dužu abecedu?",
	"tt0wis": "Može li moja abeceda sadržati samo brojeve?",
	"tt93lm": "Mogu li koristiti emojije kao abecedu?",
	"ttpj1b": "Zašto popunjavati ID-ove?",
	"ttkrkh": "Mogu li generisani ID-ovi biti duži?",
	"tt1jbp": "Mogu li generisani ID-ovi biti određene dužine?",
	"tt4lv5": "Zašto koristiti listu blokiranih reči?",
	"ttq1ax": "Kako lista blokiranih reči funkcioniše?",
	"tttoof": "Koje reči se nalaze na podrazumevanoj listi blokiranih reči?",
	"tt5c9u": "Šta se dešava kada su svi ID-ovi blokirani?",
	"tt7u2r": "Kako proveriti da li su ID-ovi validni?",
	"ttd0xn": "Šta se dešava kada se podrazumevana lista blokiranih reči ažurira?",
	"ttf8xd": "Može li enkodiranje različitih brojeva proizvesti identične ID-ove?",
	"ttsahq": "Šta je {name}?",
	"tt8wk0": "Zašto je {hashids} nadograđen u {name}?",
	"ttf8ad": "Zašto je parametar {salt} uklonjen?",
	"ttc389": "Da li je {hashids} kompatibilan sa {name}?",
	"ttxp5w": "Kako sigurno nadograditi sa {hashids} na {name}?",
	"ttbrmk": "Gde mogu pronaći originalne biblioteke {hashids}?",
	"ttwb2e": "Kako mogu doprineti?",
	"ttrvdg": "Kako preneti {name} na drugi jezik?",
	"ttj5f7": "{name} je mala open-source biblioteka koja može proizvesti kratke, jedinstvene, nasumične ID-ove iz brojeva.",
	"ttox58": "Najbolji način razmišljanja je kao o konverteru iz decimalnog u heksadecimalni broj, ali sa nekoliko dodatnih funkcija.",
	"ttzijt": "Skraćivanje linkova, generisanje jedinstvenih ID-ova događaja za beleženje, generisanje ID-ova za proizvode/objekte na veb-sajtu (kao što YouTube radi za video zapise), generisanje kratkih ID-ova za SMS poruke, kodove za potvrdu u emailovima, itd.",
	"tt3njz": "Svi podaci koji nisu osetljivi. Generisani ID-ovi nisu heševi i mogu biti dekodirani u brojeve. Na primer, možda nisu dobar izbor za ID-ove korisnika, jer, kada se dekodiraju, mogu otkriti broj korisnika vaše aplikacije.",
	"ttmtky": "Da, {name} može enkodirati jedan ili više ne-negativnih brojeva u jedan ID. Ne postoji ograničenje koliko brojeva možete enkodirati, ali postoji ograničenje koliko veliki broj možete enkodirati (zavisno od programske jezika implementacije).",
	"ttto4f": "Ovo je korisno iz nekoliko razloga: možete enkodirati UNIX vremensku oznaku i kreirati ID-ove koji ističu, ili možete enkodirati broj fragmenta baze podataka zajedno sa primarnim ključem i uštedeti na dodatnim upitima baze podataka.",
	"ttekta": "Da, generisani ID-ovi su jedinstveni za ulazne podatke i abecedu.",
	"ttl6kc": "Imajte na umu da podrazumevana abeceda sadrži i velika i mala slova, pa su podrazumevani ID-ovi osetljivi na veličinu slova.",
	"ttg2e4": "{name} ne može enkodirati negativne brojeve.",
	"ttahi1": "Minimalna dužina abecede je {length} karaktera.",
	"ttzi2t": "Abeceda ne može sadržati višebajtni karaktere.",
	"ttnsyi": "{name} ne može generisati ID-ove do određene dužine, već samo barem određene dužine. Raspon parametra minimalne dužine je između {min} i {max}.",
	"ttiq3o": "{name} može pokušati da regeneriše ID-ove do dužine abecede, umanjene za jedan.",
	"ttyf26": "Biblioteka prihvata prilagođenu abecedu iz koje može generisati ID-ove. Jednostavno unapred promešajte podrazumevanu abecedu koja je obezbeđena.",
	"tt6dc3": "Imajte na umu da uz dovoljno truda, neko može rekonstruisati vašu promešanu abecedu, pa ovo nikako nije tehnika za sakrivanje osetljivih podataka.",
	"tth4pj": "Podrazumevana abeceda se može pronaći [ovde]({url}).",
	"tt0eos": "Možete koristiti bilo koji od online alata za mešanje stringova ili naš [igralište](/playground).",
	"tt9zcm": "Zavisi od vaše upotrebe. Kraća abeceda će proizvesti duže ID-ove, a duža abeceda će proizvesti kraće ID-ove. Možete koristiti [igralište](/playground) da testirate kako bi vaši ID-ovi mogli izgledati.",
	"ttp7pb": "Da. Imajte na umu da su generisani ID-ovi i dalje stringovi i da bi mogli početi nulom.",
	"ttk4jh": "Ne. {name} ne podržava višebajtni karaktere za abecedu. To uključuje i emojije, kao i mnoge druge karaktere.",
	"tt17kp": "Biblioteka može proširiti ID-ove sa beskorisnim karakterima kako bi izgledali duže. Ovo je korisno da ne bi bilo očigledno da li enkodirate mali broj kao što je {min} ili veliki broj kao što je {max}.",
	"tt4c25": "Dekodiranje nije pogođeno.",
	"ttqp1x": "Da, biblioteka prihvata parametar minimalne dužine koji garantuje da će ID-ovi biti barem te dužine.",
	"ttt88f": "Imajte na umu da nema garancije koliko će dugački biti vaši ID-ovi - samo da neće biti kraći od dužine koju navedete.",
	"tt59mu": "Do određene granice.",
	"tt7vlr": "Postavljanje maksimalne dužine je nemoguće jer će pre ili kasnije vaši ID-ovi premašiti datu dužinu. Zato se podržava samo minimalni parametar dužine, a tačna dužina ili maksimalna dužina nije podržana.",
	"ttdswn": "Lista blokiranih reči može sprečiti pojavljivanje određenih reči u vašim ID-ovima. Ovo je korisno jer su generisani ID-ovi namenjeni da se pojavljuju na javnim mestima, poput URL-a.",
	"ttf0wd": "{name} dolazi sa [podrazumevanom listom blokiranih reči]({url}) koja sadrži osnovne psovke i neprimerene reči iz više jezika. Naravno, možete proširiti tu listu sa svojim rečima.",
	"tts1jq": "Poređenje reči sa listom blokiranih reči ne zavisi od veličine slova.",
	"tt8eh0": "Kratke reči kraće od 3 karaktera neće biti blokirane. Reči od 3 karaktera se moraju tačno podudarati sa ID-ovima. Reči od 4 karaktera ili duže će pokrenuti podudaranje ako su podniska ID-a.",
	"ttf01d": "Ako reči na listi zabrane sadrže brojeve (leetspeak), pokrenuće se samo ako se nalaze na početku ili kraju ID-ja.",
	"ttcz09": "Podrazumevana lista zabrane sadrži najčešće psovke i neprimerene reči iz više jezika. Kompletan spisak možete pronaći [ovde]({url}).",
	"ttxbuw": "Kada se generisani ID poklopi sa rečju na listi zabrane, biblioteka pokušava da ga ponovo generiše.",
	"ttbgyk": "Ako svaki pokušaj da se ponovo generiše ID ne uspe, funkcija enkodiranja će zakažiti i vratiti grešku. Na korisniku je da upravlja tom greškom.",
	"ttwkle": "Najbolji način da se smanji broj pokušaja regeneracije je da imate dužu abecedu, ne postavite minimalnu dužinu i pružite manju listu zabrane. Primenom prazne liste zabrane, ova funkcija će biti potpuno isključena.",
	"ttr2ng": "Dekodiranje ID-ova obično će proizvesti neku vrstu numeričkog izlaza, ali to ne znači nužno da je ID kanonski. Da biste proverili da li je ID validan, možete ponovo enkodirati dekodirane brojeve i proveriti da li se ID poklapa.",
	"ttjud7": "Razlog zbog kojeg ovo nije automatski urađeno je taj da, ako se podrazumevana lista zabrane promeni u budućnosti, ne želimo automatski da ugrozimo ID koji je bio generisan u prošlosti, a možda se sada poklapa sa novom rečju sa liste zabrane.",
	"ttowu8": "Budite sigurni da ćemo ažurirati {changelog} ako se i kada podrazumevana lista zabrane promeni.",
	"ttzo7t": "Morate uzeti u obzir scenarije u kojima bi nova reč mogla biti uvedena na podrazumevanu listu zabrane. U tom slučaju, ponovno enkodiranje brojeva može proizvesti drugačiji ID.",
	"tt3i7z": "Najbolji način da obezbedite doslednost vaših ID-ova kroz buduće ažuriranje je da obezbedite prilagođenu listu zabrane, čak i ako je identična trenutnoj podrazumevanoj listi zabrane.",
	"ttmfhy": "Ne, enkodiranje različitih brojeva će proizvesti jedinstvene ID-ove.",
	"ttt85f": "Međutim, zbog dizajna algoritma, dekodiranje slučajnih ID-ova ponekad može proizvesti iste brojeve. Najbolji način da proverite da li je ID kanonski je jednostavno ponovno enkodirati dekodirane brojeve i proveriti da li se ID poklapa.",
	"ttehfa": "{hashids} je bio prva verzija ove biblioteke koja je izašla oko 2013. godine. Takođe je proizvodila kratke ID-ove, ali koristila je nešto drugačiju metodu.",
	"ttl3hc": "{hashids} je obrađivao neke stvari drugačije.",
	"ttgla4": "Nije podržavala prilagođenu listu zabrane, već se oslanjala na najčešće engleske psovke. Takođe je koristila parametar {salt} za mešanje abecede, što je malo zbunjujuće jer biblioteka nema veze sa enkripcijom. Dodatno, koristila je previše rezervisanih karaktera što je rezultiralo produkcijom dužih ID-ova.",
	"ttajo1": "Zbog toga smo odlučili da napravimo nadogradnju i rebrandujemo. Algoritam je pojednostavljen, dodate su neke funkcionalnosti i svi kodovi repozitorijuma su sada pod [jednim krovom]({url}).",
	"ttzolt": "Parametar {salt} se koristio za mešanje abecede i nikada nije bio povezan sa bezbednošću ili sigurnošću. I {hashids} i {name} rade slično kao konverzija iz decimalnog u heksadecimalni broj, ali sa nekoliko prilagođavanja. Nema nikakve enkripcije, tako da je taj parametar potpuno uklonjen da bi se izbegla konfuzija.",
	"ttnq6i": "Ne, {name} proširuje funkcionalnosti {hashids}-a i ima drugačije ciljeve i zahteve za dizajn, stoga generisani ID-ovi nisu kompatibilni sa {hashids}-om.",
	"ttixzo": "Pošto nema kompatibilnosti između {hashids}-a i {name}-a, nemoguće je jednostavno zameniti {hashids} sa {name}-om.",
	"ttydl6": "Međutim, možete spojiti dva tako što ćete razlikovati koji ID pripada kojoj biblioteci.",
	"tt6n93": "Jedan od načina za to je dužina ID-a - ako prelazite na {name}, možete postaviti višu minimalnu dužinu. Drugi način je ručno dodavanje/uklanjanje prilagođenog karaktera novoprodukovanim ID-ovima.",
	"tth5bj": "Napokon, takođe možete pokušati da dekodirate ID sa {hashids}-om da biste videli da li je validan. Ako nije - dekodirajte i ponovo enkodirajte sa {name}-om da biste videli da li radi.",
	"tt0a8s": "Svaka implementacija jezika na ovom sajtu linkuje ka originalnom {hashids} repozitorijumu ako postoji.",
	"tt9t9m": "Ako želite da podržite projekat, bili bismo zahvalni ako ozvezdite naše repozitorijume na Github-u za veću vidljivost.",
	"ttpgkb": "Ako ste programer i ne vidite implementaciju za određeni jezik, molimo vas da nam pomognete da konvertujemo biblioteku. Isti slučaj važi za programski jezik koji nije naveden.",
	"ttk57h": "Ako primetite grešku u specifikaciji ili bilo kojoj od implementacija, molimo vas da kreirate problem ili zahtev za spajanje sa predloženim popravkom u odgovarajućem repozitorijumu.",
	"tt1rhp": "Ako govorite više jezika, mogli bismo koristiti vašu pomoć pri [poboljšanju liste zabrane]({blocklist}) i [prilagođavanju prevoda na sajtu]({i18n}) ako primetite bilo kakve probleme.",
	"tt49l5": "Na kraju, ako imate iskustva sa {hashids}/{name}, molimo vas da pomognete vođenjem naše zajednice odgovaranjem na bilo kakva pitanja koja neko može imati.",
	"ttqbpx": "Ako biste želeli da prenesete {name} na neki od sledećih jezika (ili novi jezik koji nije naveden ovde):",
	"ttt00f": "Forkujte zvanični repozitorijum na svoj Github nalog i implementirajte [specifikaciju]({spec}) zajedno sa svim testovima. Možete ponovo koristiti bilo koji od postojećih README fajlova ([primer]({example})).",
	"tt5myu": "Kada je biblioteka spremna, kreirajte zahtev za spajanje. Nakon spajanja, ažuriraćemo sajt.",
	"tt72cr": "Ako repozitorijum nema aktivne održavaoce, bili bismo srećni da vas pozovemo da upravljate repozitorijumom i postanete zvanični održavalac.",
	"ttdqen": "Ako ste stručnjak za sledeće, molimo vas da nas kontaktirate ako biste želeli da prenesete biblioteku:",
	"ttfsed": "Nije pronađeno",
	"ttsp7q": "Ostali",
	"tt8aj0": "Pokušaj:",
	"ttfspd": "[{clickhouse}]({url1}) pruža ugrađene SQL funkcije za generisanje {name} sa podrazumevanim parametrima. Ova funkcionalnost je dostupna od {clickhouse} [{version}]({url2})."
}
