{
	"tt52up": "Generera korta unika ID:n",
	"tt75ra": "{name}{pronounced} är ett öppen-källkods-bibliotek som låter dig generera korta unika identifierare från nummer. Dessa ID:n är URL-säkra, kan koda flera nummer och innehåller inte vanliga svordomar.",
	"ttd0n6": "Läs mer",
	"ttf0dj": "Så här ser de ut:",
	"ttspqb": "Användningsområden",
	"tt810r": "Det primära användningsområdet för {name} är rent visuellt. Om du vill använda ID:n istället för nummer i ditt projekt kan {name} vara ett bra val.",
	"ttfxdj": "Bra för",
	"ttcn90": "Inte bra för",
	"ttxrw3": "Kodning av primärnycklar",
	"ttblk8": "Om du använder en relationsdatabas",
	"ttw5eb": "Spara databashämtningar",
	"ttrzg4": "Genom att koda flera objekt",
	"ttj376": "Tillfälliga inloggnings-token",
	"ttor8c": "Fri från svordomar och URL-säkra",
	"ttzbtd": "Känsliga data",
	"tt3bzl": "Detta är inte ett krypteringsbibliotek",
	"ttm1yo": "Användar-ID:n",
	"ttt7ff": "Kan avslöja antalet användare om någon får tag på kodningsalfabetet",
	"tte6as": "Frågor",
	"ttl1c7": "Lekplats",
	"ttgq43": "Bibliotek",
	"ttaf1b": "Funktioner",
	"ttz5td": "Generera korta ID:n från icke-negativa nummer",
	"ttncim": "Enkel kodning och avkodning",
	"ttimoo": "Auto-genererade ID:n innehåller inte vanliga svordomar",
	"tty56c": "Stöd för anpassade ID:n via skufflat alfabet",
	"tt6v30": "Varje version producerar samma ID:n",
	"tthejy": "Litet bibliotek med en tillåtande licens",
	"tt0ds2": "{count} integrationer ({new} använder en ny design)",
	"tt9vmk": "Kom igång",
	"ttpebs": "Vad använder du?",
	"ttkph9": "Kan inte hitta det",
	"tt1ap4": "Låt oss veta det?",
	"tt445i": "Exempel",
	"ttqewx": "Alfabet",
	"tttnnf": "Nummer",
	"tt52lu": "Genererat ID",
	"tt74ur": "blandning",
	"ttdosn": "Blanda",
	"ttfisd": "ny",
	"ttswbq": "Föreslå textöversättningsredigering",
	"tt8qp0": "Sponsorer",
	"ttfiwd": "Populär",
	"ttcyi9": "Ställ en fråga",
	"ttxagw": "Hittat en bugg?",
	"ttbjck": "{name} har uppgraderats och fått nytt namn",
	"ttw1ue": "Stjärnmärk {what} på {github}",
	"ttr5tg": "Snabb kodnings- och avkodningsexempel:",
	"ttjgz7": "Om ID:n är för korta kan du fylla på dem till en viss längd:",
	"ttosg8": "Skapa unika ID:n genom att blanda alfabetet:",
	"ttzdkt": "Fullständig dokumentation finns på",
	"tt3fkz": "Kom igång",
	"ttm3py": "Om du letar efter det ursprungliga {name}, hittar du det här:",
	"tttnrf": "{name} för {lang} är ännu inte redo.",
	"ttep3a": "Stjärnmärk gärna repot för att flytta upp det på vår att-göra-lista:",
	"ttlmpc": "Om du vill hjälpa till att få denna version att leva finns det en FAQ-sektion om hur du kan göra det:",
	"ttgux4": "Hur man porterar {name} till ett annat språk?",
	"ttabd1": "Om du letar efter det ursprungliga {name}-projektet hittar du det här:",
	"ttzdut": "Observera att det inte kommer att vara kompatibelt med den nuvarande algoritmen när denna version är klar.",
	"ttn89i": "{name} är ett öppen-källkods-bibliotek som låter dig generera korta unika ID:n från nummer. Det stödjer {count} programmeringsspråk.",
	"tti0yo": "Korta unika ID:n på {lang}",
	"ttyzu6": "Generera korta unika ID:n på {lang} med {name}. Dessa identifierare är URL-säkra, kan koda flera nummer och innehåller inte vanliga svordomar.",
	"tt6t23": "{name}-lekplatsen. Utforska {name} kodnings- och avkodningsbibliotek.",
	"tthraj": "Vanliga frågor för {name}.",
	"tt0xns": "Minsta längd",
	"tt962m": "Blocklista",
	"ttphab": "Lägg till dina egna anpassade ord separerade av mellanslag...",
	"ttk7bh": "Använd även standardblocklistan",
	"tt1k1p": "Standard",
	"tt42u5": "Kort",
	"ttqaex": "Lång",
	"tttiif": "Bokstäver",
	"tt5lcu": "Gemener",
	"tt75vr": "Versaler",
	"ttd8qn": "Lista",
	"ttfoqd": "Koda",
	"ttsekq": "Avkoda",
	"tt8xb0": "Koda en multipel",
	"ttfoed": "Koda en extra nolla",
	"ttc6o9": "Koda en stor konstant",
	"ttx14w": "ID",
	"ttb79k": "Kodning av dessa nummer:",
	"ttwpve": "Kommer att producera:",
	"ttrufg": "Avkodning av detta ID:",
	"ttj4t7": "Alfabetet måste vara minst {count} tecken långt",
	"ttoq48": "Alfabetets mellanslag ignoreras",
	"ttznht": "Blockerar ord som är kortare än {count} tecken",
	"tt3dhz": "blockera",
	"ttmzby": "Allmänt",
	"tttigf": "Vad är det bra för?",
	"ttebza": "Vad är det inte bra för?",
	"ttlybc": "Kan jag koda flera nummer samtidigt?",
	"ttgvw4": "Är genererade ID:n unika?",
	"ttakn1": "Vilka begränsningar har {name}?",
	"ttznvt": "Bidra",
	"ttn0mi": "Hak",
	"ttis6o": "Fyllning",
	"ttytv6": "Hur kan jag göra mina ID:n unika?",
	"tt6fl3": "Hur kan jag blanda det förvalda alfabetet?",
	"tthg1j": "Är det bättre att använda ett kortare eller längre alfabet?",
	"tt0wis": "Kan mitt alfabet bestå av bara siffror?",
	"tt93lm": "Kan jag använda emojis som alfabet?",
	"ttpj1b": "Varför fylla på ID:n?",
	"ttkrkh": "Kan jag göra genererade ID:n längre?",
	"tt1jbp": "Kan jag göra genererade ID:n till en specifik längd?",
	"tt4lv5": "Varför använda en blocklista?",
	"ttq1ax": "Hur fungerar blocklistan?",
	"tttoof": "Vilka ord finns i standardblocklistan?",
	"tt5c9u": "Vad händer när alla ID:n är blockerade?",
	"tt7u2r": "Hur kan jag kontrollera om ID:n är giltiga?",
	"ttd0xn": "Vad händer när standardblocklistan uppdateras?",
	"ttf8xd": "Kan kodning av olika nummer producera identiska ID:n?",
	"ttsahq": "Vad är {name}?",
	"tt8wk0": "Varför uppgraderades {hashids} till {name}?",
	"ttf8ad": "Varför togs {salt}-parametern bort?",
	"ttc389": "Är {hashids} kompatibelt med {name}?",
	"ttxp5w": "Hur kan jag säkert uppgradera från {hashids} till {name}?",
	"ttbrmk": "Var kan jag hitta de ursprungliga {hashids}-biblioteken?",
	"ttwb2e": "Hur kan jag bidra?",
	"ttrvdg": "Hur portar jag {name} till ett annat språk?",
	"ttj5f7": "{name} är en liten open-source-bibliotek som kan producera korta, unika, slumpartade ID:n från nummer.",
	"ttox58": "Det bästa sättet att tänka på det är som en decimal-till-hexadecimalomvandlare, men med några extra funktioner.",
	"ttzijt": "Förkortning av länkar, generering av unika händelse-ID:n för loggning, generering av ID:n för produkter/objekt på en webbplats (som YouTube gör för videor), generering av korta ID:n för textmeddelanden, bekräftelsekoder i e-postmeddelanden, etc.",
	"tt3njz": "All data som är känslig. Genererade ID:n är inte hash-funktioner och kan avkodas tillbaka till nummer. Till exempel kan de kanske inte vara ett bra val för användar-ID:n, eftersom de, när de avkodas, kan avslöja antalet användare i din app.",
	"ttmtky": "Ja. {name} kan koda ett eller många icke-negativa nummer till ett enda ID. Det finns ingen begränsning för hur många nummer du kan koda, men det finns en begränsning för hur stora nummer du kan koda (beroende på implementeringsspråket).",
	"ttto4f": "Detta är användbart av flera anledningar: du kan koda en UNIX-timestamp och skapa förfallna ID:n, eller så kan du koda ett databasshardnummer tillsammans med en primärnyckel och spara extra databasförfrågningar.",
	"ttekta": "Ja, genererade ID:n är unika för inmatningen och alfabetet.",
	"ttl6kc": "Kom ihåg att det förvalda alfabetet innehåller både versaler och gemener, så standard-ID:n är skiftlägeskänsliga.",
	"ttg2e4": "{name} kan inte koda negativa nummer.",
	"ttahi1": "Minsta alfabetets längd är {length} tecken.",
	"ttzi2t": "Alfabetet kan inte innehålla flerbytestecken.",
	"ttnsyi": "{name} kan inte generera ID:n upp till en viss längd, endast åtminstone en viss längd. Parametern för minsta längd ligger mellan {min} och {max}.",
	"ttiq3o": "{name} kan försöka återskapa ID:n upp till alfabetets längd minus ett.",
	"ttyf26": "Biblioteket accepterar ett anpassat alfabet från vilket det kan generera ID:n. Bara förskuffa det förvalda alfabetet som tillhandahålls.",
	"tt6dc3": "Tänk på att med tillräckligt mycket ansträngning kan någon reversa ditt förskuffade alfabet, så detta är inte på något sätt en teknik för att dölja känslig data.",
	"tth4pj": "Det förvalda alfabetet kan hittas [här]({url}).",
	"tt0eos": "Du kan använda vilket onlineverktyg för strängförskjutning som helst eller vår [lekhage](/playground).",
	"tt9zcm": "Beror på ditt användningsfall. Ett kortare alfabet kommer att producera längre ID:n, och ett längre alfabet kommer att producera kortare ID:n. Du kan använda [lekhage](/playground) för att testa hur dina ID:n kan se ut.",
	"ttp7pb": "Ja. Tänk på att genererade ID:n fortfarande är strängar och de kan börja med en nolla.",
	"ttk4jh": "Nej. {name} stöder inte flerbytestecken för alfabetet. Det inkluderar emojis och många andra tecken.",
	"tt17kp": "Biblioteket kan förlänga ID:n med skräptecken för att få dem att se längre ut. Detta är användbart så att det inte är lika uppenbart om du kodar ett litet nummer som {min} eller ett stort nummer som {max}.",
	"tt4c25": "Avkodning påverkas inte.",
	"ttqp1x": "Ja, biblioteket accepterar en parameter för minsta längd som garanterar att ID:n kommer att vara åtminstone den längden.",
	"ttt88f": "Observera att det inte finns någon garanti för hur långa dina ID:n kommer att vara - bara att de inte blir kortare än den längd du specificerar.",
	"tt59mu": "Upp till en viss punkt.",
	"tt7vlr": "Att sätta maxlängd är omöjligt eftersom förr eller senare kommer dina ID:n att överbelastas med tillräckligt stor inmatning. Det är därför bara parametern för minsta längd som stöds, och den exakta längden eller maxlängden stöds inte.",
	"ttdswn": "En blocklista kan förhindra att vissa ord visas i dina ID:n. Detta är fördelaktigt eftersom genererade ID:n är avsedda att visas på offentliga platser, som URL:er.",
	"ttf0wd": "{name} kommer med [standardblocklistan]({url}) som innehåller de mest grundläggande svordomarna och olämpliga ord från flera språk. Du kan naturligtvis utöka den blocklistan med dina egna ord.",
	"tts1jq": "Matchning av blocklistord är skiftlägesokänslig.",
	"tt8eh0": "Korta ord som är mindre än 3 tecken långa kommer inte att blockeras. Ord som är 3 tecken långa måste matcha ID:n exakt. Ord som är 4 tecken eller längre kommer att trigga en match om de är en delsträng av ID:t.",
	"ttf01d": "Om blocklistords innehåller siffror (leetspeak) kommer de bara att trigga en match om de är i början eller slutet av ID:t.",
	"ttcz09": "Standardblocklistan innehåller de vanligaste svordomarna och olämpliga orden från flera språk. Du kan hitta den fullständiga listan [här]({url}).",
	"ttxbuw": "När det genererade ID:t matchar ett ord i blocklistan försöker biblioteket att generera om det.",
	"ttbgyk": "Om varje enskilt försök att generera om ID:t misslyckas kommer kodningsfunktionen att misslyckas och returnera ett fel. Hanteringen av detta fel är upp till användaren.",
	"ttwkle": "Det bästa sättet att minska antalet försök att generera om är att ha ett längre alfabet, inte sätta en minsta längd och tillhandahålla en mindre blocklista. Att tillhandahålla en tom blocklista kommer att inaktivera funktionen helt.",
	"ttr2ng": "Avkodning av ID:n kommer vanligtvis att producera någon form av numerisk utdata, men det betyder inte nödvändigtvis att ID:t är kanoniskt. För att kontrollera att ID:t är giltigt kan du återkoda avkodade nummer och kontrollera att ID:t matchar.",
	"ttjud7": "Anledningen till att detta inte görs automatiskt är att om standardblocklistan ändras i framtiden vill vi inte automatiskt ogiltigförklara ID:t som har genererats tidigare och kanske nu matchar ett nytt blocklistord.",
	"ttowu8": "Vi kommer säkerställa att {changelog} uppdateras om och när standardblocklistan ändras.",
	"ttzo7t": "Du måste ta hänsyn till scenarier där ett nytt ord kan införas i standardblocklistan. I det här fallet kan återkodning av nummer producera ett annorlunda ID.",
	"tt3i7z": "Det bästa sättet att säkerställa att dina ID:n förblir konsekventa genom framtida uppdateringar är att tillhandahålla en anpassad blocklista, även om den är identisk med den aktuella standardblocklistan.",
	"ttmfhy": "Nej, kodning av olika nummer kommer att producera unika ID:n.",
	"ttt85f": "Men på grund av algoritmens design kan avkodning av slumpmässiga ID:n ibland producera samma nummer. Det bästa sättet att kontrollera om ID:t är kanoniskt är att helt enkelt återkoda avkodade nummer och kontrollera att ID:t matchar.",
	"ttehfa": "{hashids} var den första versionen av detta bibliotek som kom ut runt 2013. Den producerade också korta ID:n men använde en något annorlunda metod.",
	"ttl3hc": "{hashids} hanterade några saker annorlunda.",
	"ttgla4": "Den stödde inte en anpassad blocklista, utan förlitade sig istället på de vanligaste engelska svordomarna. Den använde också parameter {salt} för att blanda alfabetet vilket gjorde det lite förvirrande eftersom biblioteket inte har något att göra med kryptering. Dessutom användes för många reserverade tecken vilket resulterade i längre ID:n.",
	"ttajo1": "Därför har vi beslutat att uppgradera och ge nytt namn. Algoritmen har förenklats, några funktioner har lagts till och kodlagrarna finns nu allihop under [ett tak]({url}).",
	"ttzolt": "Parametern {salt} användes för att blanda alfabetet, och den var aldrig menad att associeras med säkerhet eller trygghet. Både {hashids} och {name} fungerar på ett liknande sätt som omvandling från decimal till hexadecimal men med några justeringar. Det finns ingen form av kryptering, så för att undvika förvirring har den parametern tagits bort helt och hållet.",
	"ttnq6i": "Nej, {name} utökar funktionaliteten hos {hashids} och har olika designmål och krav; därför är de genererade ID:na inte kompatibla med {hashids}.",
	"ttixzo": "Eftersom det inte finns någon kompatibilitet mellan {hashids} och {name} är det omöjligt att helt enkelt ersätta {hashids} med {name}.",
	"ttydl6": "Du kan dock sammanföra de två genom att skilja vilket ID som tillhör vilket bibliotek.",
	"tt6n93": "Ett sätt att göra det är genom ID-längd - om du byter till {name} kan du ange en högre minsta längd. Ett annat sätt är att manuellt lägga till en anpassad teckensträng till de nygenererade ID:na.",
	"tth5bj": "Slutligen kan du också försöka avkoda ett ID med {hashids} för att se om det är giltigt. Om inte - avkoda och koda om med {name} för att se om det fungerar.",
	"tt0a8s": "Varje språkimplementation på denna webbplats länkar till den ursprungliga {hashids}-lagringsplatsen om den finns.",
	"tt9t9m": "Om du vill stödja projektet skulle vi uppskatta om du stjärnmarkerade våra lagringsplatser på Github för att få mer synlighet.",
	"ttpgkb": "Om du är utvecklare och inte ser någon implementation av {name} för ett specifikt språk, hjälp oss att konvertera biblioteket. Samma sak gäller för ett programmeringsspråk som inte är listat.",
	"ttk57h": "Om du ser en bugg i specifikationen eller någon av implementationerna, skapa gärna en fråga eller en begäran om ändring med ett föreslaget fix i den lämpliga lagringsplatsen.",
	"tt1rhp": "Om du talar flera språk kan vi använda din hjälp med [finjustering av blocklistan]({blocklist}) och [justering av webbplatstranslationer]({i18n}) om du ser några problem.",
	"tt49l5": "Slutligen, om du har erfarenhet av {hashids}/{name}, var god hjälp till att guida vår community genom att svara på eventuella frågor som någon kan ha.",
	"ttqbpx": "Om du vill portera {name} till ett av följande språk (eller ett nytt som inte listas här):",
	"ttt00f": "Forka den officiella lagringsplatsen till ditt eget Github-konto och implementera [specifikationen]({spec}) tillsammans med alla tester. Du kan återanvända någon av de befintliga README-filerna ([exempel]({example})).",
	"tt5myu": "När biblioteket är klart, skapa en begäran om ändring. När den har införlivats kommer vi att uppdatera webbplatsen.",
	"tt72cr": "Om lagringsplatsen inte har några aktiva underhållare skulle vi vara glada att bjuda in dig för att hantera lagringsplatsen och bli en officiell underhållare.",
	"ttdqen": "Om du är expert på följande, var god kontakta oss om du vill portera biblioteket:",
	"ttfsed": "Inte hittat",
	"ttsp7q": "Andra",
	"tt8aj0": "Försök:",
	"ttfspd": "[{clickhouse}]({url1}) tillhandahåller inbyggda SQL-funktioner för att generera {name} med standardparametrar. Denna funktionalitet är tillgänglig sedan {clickhouse} [{version}]({url2})."
}
