{
	"tt52up": "สร้าง ID ที่สั้นและไม่ซ้ำกัน",
	"tt75ra": "{name}{pronounced} เป็นไลบรารีโอเพนซอร์สที่ช่วยให้คุณสามารถสร้างตัวระบุที่สั้นและไม่ซ้ำกันจากตัวเลขได้ การระบุเหล่านี้ปลอดภัยสำหรับ URL สามารถเข้ารหัสตัวเลขหลายตัวและไม่มีคำหยาบที่พบบ่อย",
	"ttd0n6": "อ่านเพิ่มเติม",
	"ttf0dj": "นี่คือรูปแบบของพวกเขา:",
	"ttspqb": "การใช้งาน",
	"tt810r": "การใช้งานหลักของ {name} เป็นเพียงแค่การมองเห็น หากคุณต้องการใช้รหัสตัวระบุแทนตัวเลขในโปรเจกต์ของคุณ {name} อาจเป็นทางเลือกที่ดี",
	"ttfxdj": "เหมาะสำหรับ",
	"ttcn90": "ไม่เหมาะสำหรับ",
	"ttxrw3": "การเข้ารหัสคีย์หลัก",
	"ttblk8": "หากคุณกำลังใช้ฐานข้อมูลเชิงสัมพันธ์",
	"ttw5eb": "การเก็บค้นภายในฐานข้อมูล",
	"ttrzg4": "โดยการเข้ารหัสวัตถุหลายรายการ",
	"ttj376": "โทเค็นการเข้าสู่ระบบชั่วคราว",
	"ttor8c": "ปลอดคำหยาบและปลอดภัยสำหรับ URL",
	"ttzbtd": "ข้อมูลที่อ่อนไหว",
	"tt3bzl": "นี่ไม่ใช่ไลบรารีการเข้ารหัส",
	"ttm1yo": "ไอดีผู้ใช้",
	"ttt7ff": "สามารถแสดงจำนวนผู้ใช้หากมีใครสังเกตเห็นอักขระที่ใช้เข้ารหัส",
	"tte6as": "คำถามที่พบบ่อย",
	"ttl1c7": "สนามเล่น",
	"ttgq43": "ห้องสมุด",
	"ttaf1b": "คุณสมบัติ",
	"ttz5td": "สร้าง ID สั้นจากตัวเลขที่ไม่เป็นลบ",
	"ttncim": "การเข้ารหัสและถอดรหัสง่าย",
	"ttimoo": "รหัสที่สร้างอัตโนมัติไม่มีคำหยาบที่พบบ่อย",
	"tty56c": "รองรับการใช้รหัสที่กำหนดเองผ่านอักษรตกแต่ง",
	"tt6v30": "ทุกเวอร์ชันสร้างรหัสเดียวกัน",
	"tthejy": "ไลบรารีขนาดเล็กที่มีใบอนุญาตโปร่งใส",
	"tt0ds2": "{count} การผสาน ({new} โดยใช้การออกแบบใหม่)",
	"tt9vmk": "เริ่มต้น",
	"ttpebs": "คุณกำลังใช้อะไร?",
	"ttkph9": "ไม่พบ",
	"tt1ap4": "แจ้งเราเกี่ยวกับมัน?",
	"tt445i": "ตัวอย่าง",
	"ttqewx": "อักษร",
	"tttnnf": "ตัวเลข",
	"tt52lu": "ID ที่สร้าง",
	"tt74ur": "การสลับ",
	"ttdosn": "สลับ",
	"ttfisd": "ใหม่",
	"ttswbq": "แนะนำแก้ไขข้อความแปล",
	"tt8qp0": "ผู้สนับสนุน",
	"ttfiwd": "นิยม",
	"ttcyi9": "ถามคำถาม",
	"ttxagw": "พบข้อบกพร่อง?",
	"ttbjck": "{name} ได้รับการอัปเกรดและเปลี่ยนแบรนด์",
	"ttw1ue": "ดาว {what} ใน {github}",
	"ttr5tg": "ตัวอย่างการเข้ารหัสและถอดรหัสด่วน:",
	"ttjgz7": "หาก ID สั้นเกินไปคุณสามารถเติมขยายความยาว:",
	"ttosg8": "สร้าง ID ที่ไม่ซ้ำกันโดยการสลับอักษร:",
	"ttzdkt": "คำแนะนำแบบเต็มอยู่ที่",
	"tt3fkz": "เริ่มต้น",
	"ttm3py": "หากคุณกำลังมองหา {name} เวอร์ชันต้นฉบับคุณสามารถหาได้ที่นี่:",
	"tttnrf": "{name} สำหรับ {lang} ยังไม่พร้อมใช้งาน",
	"ttep3a": "โปรดให้ดาวให้เรปอาส์เพื่อย้ายไปในรายการสิ่งที่ต้องทำของเรา:",
	"ttlmpc": "หากคุณต้องการช่วยเป็นสิ่งที่ชีวิตสามารถทำได้มีส่วนสำหรับคำถามที่พบบ่อยเกี่ยวกับวิธีที่จะทำ:",
	"ttgux4": "วิธีการโพรต์ {name} ไปยังภาษาอื่น?",
	"ttabd1": "หากคุณกำลังมองหาโครงการต้นฉบับ {name} คุณสามารถหาได้ที่นี่:",
	"ttzdut": "โปรดทราบว่ามันจะไม่สามารถที่จะเข้ากันได้กับอัลกอริทึมปัจจุบันเมื่อเวอร์ชันนี้เสร็จสมบูรณ์",
	"ttn89i": "{name} เป็นไลบรารีโอเพนซอร์สที่ช่วยให้คุณสามารถสร้าง ID ที่สั้นและไม่ซ้ำกันจากตัวเลขได้ รองรับ {count} ภาษาโปรแกรม",
	"tti0yo": "ID ที่สั้นและไม่ซ้ำกันใน {lang}",
	"ttyzu6": "สร้าง ID ที่สั้นและไม่ซ้ำกันใน {lang} โดยใช้ {name} ตัวระบุเหล่านี้ปลอดภัย URL สามารถเข้ารหัสตัวเลขหลายตัวและไม่มีคำหยาบที่ใช้บ่อย",
	"tt6t23": "{name} พื้นที่เล่น. สำรวจไลบรารีการเข้ารหัสและถอดรหัส {name}",
	"tthraj": "คำถามที่ถามบ่อยสำหรับ {name}",
	"tt0xns": "ความยาวขั้นต่ำ",
	"tt962m": "รายการบล็อก",
	"ttphab": "เพิ่มคำที่กำหนดเองของคุณโดยแยกด้วยช่องว่าง...",
	"ttk7bh": "ใช้รายการบล็อกเริ่มต้นด้วย",
	"tt1k1p": "ค่าเริ่มต้น",
	"tt42u5": "สั้น",
	"ttqaex": "ยาว",
	"tttiif": "ตัวอักษร",
	"tt5lcu": "ตัวพิมพ์เล็ก",
	"tt75vr": "ตัวพิมพ์ใหญ่",
	"ttd8qn": "รายการ",
	"ttfoqd": "เข้ารหัส",
	"ttsekq": "ถอดรหัส",
	"tt8xb0": "เข้ารหัสแบบหลาย",
	"ttfoed": "เข้ารหัสเพิ่มศูนย์หนึ่ง",
	"ttc6o9": "เข้ารหัสค่าคงที่ขนาดใหญ่",
	"ttx14w": "ID",
	"ttb79k": "การเข้ารหัสตัวเลขเหล่านี้:",
	"ttwpve": "จะสร้าง:",
	"ttrufg": "การถอดรหัส ID นี้:",
	"ttj4t7": "ตัวอักษรต้องมีความยาวอย่างน้อย {count} ตัวอักษร",
	"ttoq48": "ช่องว่างในอักษรจะถูกข้ามไป",
	"ttznht": "คำในรายการบล็อกที่น้อยกว่า {count} ตัวอักษรจะถูกข้ามไป",
	"tt3dhz": "บล็อก",
	"ttmzby": "ทั่วไป",
	"tttigf": "มันดีอย่างไร?",
	"ttebza": "มันไม่เหมาะกับอะไร?",
	"ttlybc": "ฉันสามารถเข้ารหัสตัวเลขหลายตัวพร้อมกันได้หรือไม่?",
	"ttgvw4": "ID ที่สร้างมีความเป็นเอกลักษณ์หรือไม่?",
	"ttakn1": "ข้อจำกัดของ {name} คืออะไร?",
	"ttznvt": "สนับสนุน",
	"ttn0mi": "ปัญหาที่ควรระวัง",
	"ttis6o": "การแจกแจง",
	"ttytv6": "ฉันจะทำให้ ID ของฉันเป็นเอกลักษณ์ได้อย่างไร?",
	"tt6fl3": "ฉันจะสลับอักษรตัวอักษรเริ่มต้นได้อย่างไร?",
	"tthg1j": "การใช้อักษรที่สั้นหรือยาวดีกว่า?",
	"tt0wis": "อักษรของฉันสามารถประกอบไปด้วยตัวเลขเท่านั้นหรือไม่?",
	"tt93lm": "ฉันสามารถใช้ emoji เป็นอักษรได้หรือไม่?",
	"ttpj1b": "ทำไมต้องแจกแจง ID?",
	"ttkrkh": "ฉันสามารถทำให้ ID ที่สร้างมีความยาวได้มั้ย?",
	"tt1jbp": "ฉันสามารถทำให้ ID ที่สร้างมีความยาวแบบที่กำหนดได้หรือไม่?",
	"tt4lv5": "ทำไมต้องใช้รายการบล็อก?",
	"ttq1ax": "รายการบล็อกทำงานอย่างไร?",
	"tttoof": "คำใดบ้างที่อยู่ในรายการบล็อกเริ่มต้น?",
	"tt5c9u": "เมื่อ ID ทั้งหมดถูกบล็อกไปแล้วจะเกิดอะไรขึ้น?",
	"tt7u2r": "วิธีการตรวจสอบว่า ID ถูกต้องหรือไม่?",
	"ttd0xn": "เมื่อรายการบล็อกเริ่มต้นถูกอัปเดตเสร็จแล้วจะเกิดอะไรขึ้น?",
	"ttf8xd": "การเข้ารหัสตัวเลขที่แตกต่างกันสามารถสร้าง ID ที่เหมือนกันได้หรือไม่?",
	"ttsahq": "{name} คืออะไร?",
	"tt8wk0": "ทำไม {hashids} ถูกอัปเกรดเป็น {name}?",
	"ttf8ad": "ทำไมพารามิเตอร์ {salt} ถูกนำออก?",
	"ttc389": "{hashids} เข้ากันได้กับ {name} หรือไม่?",
	"ttxp5w": "ฉันจะอัปเกรดจาก {hashids} เป็น {name} ได้อย่างปลอดภัยอย่างไร?",
	"ttbrmk": "ฉันจะหาไฟล์ต้นฉบับของ {hashids} ได้ที่ไหน?",
	"ttwb2e": "ฉันจะช่วยเหลือได้อย่างไร?",
	"ttrvdg": "วิธีการโปรต {name} ไปยังภาษาอื่น?",
	"ttj5f7": "{name} เป็นไลบรารีที่เล็กน้อยที่เปิดเผยและสามารถสร้าง ID ที่มีลักษณะเหมือนสุ่มและสั้นจากตัวเลขได้",
	"ttox58": "วิธีที่ดีที่สุดในการคิดเกี่ยวกับมันคือเหมือนเครื่องแปลงทศนิยมเป็นฐานสิบหก แต่มีคุณลักษณะเพิ่มเติมบางอย่าง",
	"ttzijt": "การย่อลิงก์ สร้าง ID อย่างเป็นเอกลักษณ์สำหรับการเข้าสู่ระบบการเข้าถึง เพิ่ม ID สำหรับผลิตภัณฑ์/วัตถุบนเว็บไซต์ (เช่น YouTube ทำสำหรับวิดีโอ) สร้าง ID สั้นสำหรับข้อความในข้อความ รหัสยืนยันในอีเมล ฯลฯ",
	"tt3njz": "ข้อมูลที่ละเอียดอ่อน การสร้าง ID ไม่ใช่การทำ hash และสามารถถอดรหัสกลับเป็นตัวเลขได้ ตัวอย่างเช่น อาจจะไม่เป็นทางเลือกที่ดีสำหรับ ID ของผู้ใช้ เพราะเมื่อถอดรหัสแล้ว อาจเปิดเผยจำนวนผู้ใช้แอปของคุณ",
	"ttmtky": "ใช่ {name} สามารถเข้ารหัสตัวเลขหนึ่งหรือหลายตัวเลขไม่เป็นติดกันเป็น ID เดียวได้ ไม่มีขีดจำกัดในจำนวนที่คุณสามารถเข้ารหัสได้ แต่มีขีดจำกัดในจำนวนที่คุณสามารถเข้ารหัสได้ (ขึ้นอยู่กับภาษาการดำเนินงาน)",
	"ttto4f": "นี่เป็นประโยชน์หลายประการ: คุณสามารถเข้ารหัสเวลา UNIX และสร้าง ID ที่หมดอายุ หรือคุณสามารถเข้ารหัสหมายเลขชาร์ดฐานข้อมูลพร้อมกับกุญแจหลักและประหยัดในการค้นซอร์สฐานข้อมูลเพิ่มเติม",
	"ttekta": "ใช่ ID ที่สร้างมีความเป็นเอกลักษณ์ต่อข้อมูลนำเข้าและอักษรตัวอักษร",
	"ttl6kc": "อย่าลืมว่าอักษรตัวเล็กและตัวพิมพ์ใหญ่อยู่ในอักษรเริ่มต้น ดังนั้น ID เริ่มต้นเป็นตัวอักษรที่สำคัญ",
	"ttg2e4": "{name} ไม่สามารถเข้ารหัสตัวเลขที่เป็นลบ",
	"ttahi1": "ความยาวขั้นต่ำของตัวอักษรอักษรมี {length} ตัวอักษร",
	"ttzi2t": "อักษรตัวอักษรไม่สามารถมีอักขระหลายไบต์ได้",
	"ttnsyi": "{name} ไม่สามารถสร้าง ID ได้ในความยาวบางอย่าง แต่ต้องอย่างน้อยความยาวหนึ่งความยาวพารามิเตอร์ขั้นต่ำอยู่ระหว่าง {min} และ {max}",
	"ttiq3o": "{name} สามารถพยายามทำการสร้าง ID ใหม่ได้ สูงสุดความยาวของตัวอักษรลบหนึ่ง",
	"ttyf26": "ไลบรารียอมรับอักษรตัวอักษรที่กำหนดเองที่สามารถสร้าง ID ได้ แค่การสับเปลี่ยนตัวอักษรเริ่มต้นที่ให้มา",
	"tt6dc3": "โปรดทราบว่าด้วยความพยายามเพียงพอ ใครบางคนอาจถอดรหัสตัวอักษรที่คุณสับเปลี่ยนได้ ดังนั้นนี่ไม่ใช่เทคนิคที่จะซ่อนข้อมูลที่ละเอียดอ่อน",
	"tth4pj": "ตัวอักษรเริ่มต้นสามารถพบได้ [ที่นี่]({url})",
	"tt0eos": "คุณสามารถใช้เครื่องมือการสับเปลี่ยนสตริงออนไลน์ใดๆหรือ [playground](/playground) ของเรา",
	"tt9zcm": "ขึ้นอยู่กับกรณีการใช้งานของคุณ อักษรตัวอักษรที่สั้นจะทำให้ ID ยาวขึ้น และอักษรตัวอักษรที่ยาวจะทำให้ ID สั้นลง คุณสามารถใช้ [playground](/playground) เพื่อทดสอบว่า ID ของคุณอาจจะมีลักษณะอย่างไร",
	"ttp7pb": "ใช่ โปรดทราบว่า ID ที่สร้างขึ้นยังคงเป็นสตริงและอาจเริ่มต้นด้วยศูนย์",
	"ttk4jh": "ไม่  {name} ไม่รองรับอักขระหลายไบต์สำหรับตัวอักษร ซึ่งรวมถึง emoji และอักขระอื่นๆมากมาย",
	"tt17kp": "ไลบรารีสามารถเพิ่ม ID ด้วยตัวอักษรขยะเพื่อทำให้ดูยาวขึ้น สิ่งนี้เป็นประโยชน์โดยที่มันจะไม่ชัดเจนว่าคุณกำลังเข้ารหัสจำนวนเล็กเช่น {min} หรือจำนวนใหญ่เช่น {max}",
	"tt4c25": "การถอดรหัสไม่ได้รับผลกระทบ",
	"ttqp1x": "ใช่ ไลบรารีรับพารามิเตอร์ความยาวขั้นต่ำซึ่งสรรพคุณให้ ID จะมีความยาวอย่างน้อย",
	"ttt88f": "โปรดทราบว่าไม่มีการรับประกันความยาวของ ID ของคุณ - แค่ว่ามันจะไม่สั้นกว่าความยาวที่คุณระบุ",
	"tt59mu": "จนถึงจุดหนึ่ง",
	"tt7vlr": "การตั้งค่าความยาวสูงสุดเป็นเรื่องที่เป็นไปไม่ได้เพราะในไม่ช้า IDs ของคุณจะเกินเมื่อมีข้อมูลเพียงพอมากนัก นั่นคือเหตุผลที่มีเพียงพารามิเตอร์ความยาวขั้นต่ำเท่านั้นที่รองรับ และความยาวที่แน่นอนหรือความยาวสูงสุดไม่ได้รับการสนับสนุน",
	"ttdswn": "บล็อกลิสต์สามารถป้องกันคำบางคำไม่ให้ปรากฏใน ID ของคุณ สิ่งนี้มีประโยชน์เพราะ ID ที่สร้างขึ้นมีไว้ให้แสดงในสถานที่สาธารณะ เช่น URL",
	"ttf0wd": "{name} มาพร้อมกับ [บล็อกลิสต์เริ่มต้น]({url}) ที่มีคำหยาบและคำที่ไม่เหมาะสมที่สุดจากหลายภาษา คุณสามารถขยายบล็อกลิสต์นั้นด้วยคำของคุณเองได้",
	"tts1jq": "การตรวจสอบคำในบล็อกลิสต์ไม่สนใจตัวพิมพ์ใหญ่หรือตัวพิมพ์เล็ก",
	"tt8eh0": "คำที่สั้นกว่า 3 ตัวอักษรจะไม่ถูกบล็อก คำที่มีความยาว 3 ตัวอักษรจะต้องตรงกับ ID อย่างแม่นยำ และคำที่มีความยาว 4 ตัวอักษรหรือมากกว่าจะทำให้มีการตรงกันถ้าเป็นสตริงย่อยของ ID",
	"ttf01d": "หากคำในบล็อกลิสต์มีตัวเลข (leetspeak) จะทำให้เกิดการตรงกันเฉพาะเมื่ออยู่ที่จุดเริ่มต้นหรือที่สุดของ ID",
	"ttcz09": "บล็อกลิสต์เริ่มต้นประกอบด้วยคำหยาบและคำที่ไม่เหมาะสมที่สุดจากหลายภาษา คุณสามารถดูรายการทั้งหมด [ที่นี่]({url})",
	"ttxbuw": "เมื่อ ID ที่สร้างขึ้นตรงกับคำในบล็อกลิสต์ ไลบรารีจะพยายามทำการสร้างใหม่",
	"ttbgyk": "หากทุกครั้งที่พยายามทำการสร้างใหม่ ID ล้มเหลว ฟังก์ชันการเข้ารหัสจะล้มเหลวและส่งข้อผิดพลาดกลับ การจัดการข้อผิดพลาดนั้นอยู่ในความรับผิดชอบของผู้ใช้",
	"ttwkle": "วิธีที่ดีที่สุดในการลดจำนวนครั้งที่ทำการสร้างใหม่คือ การมีอักษรที่ยาวกว่า ไม่ตั้งค่าความยาวขั้นต่ำ และการให้บล็อกลิสต์ที่เล็กกว่า การให้บล็อกลิสต์ว่างเปล่าจะปิดใช้งานคุณลักษณะนี้อย่างสมบูรณ์",
	"ttr2ng": "การถอดรหัส ID จะทำให้มีผลลัพธ์ตัวเลขบางประเภท แต่นั้นไม่ได้หมายความว่า ID เป็นแบบกฎหมาย หากต้องการตรวจสอบว่า ID เป็นที่ถูกต้อง คุณสามารถทำการเข้ารหัสตัวเลขที่ถอดรหัสและตรวจสอบว่า ID ตรงกันหรือไม่",
	"ttjud7": "เหตุผลที่ไม่ทำการนี้อัตโนมัติคือถ้าบล็อกลิสต์เริ่มต้นเปลี่ยนไปในอนาคตเราไม่ต้องการที่จะทำให้ ID ที่ถูกสร้างไว้ในอดีตเป็นโมฆะโดยอัตโนมัติและอาจตรงกันกับคำในบล็อกลิสต์เริ่มต้นใหม่",
	"ttowu8": "เราจะอัปเดต {changelog} เมื่อและหากบล็อกลิสต์เริ่มต้นมีการเปลี่ยนแปลง",
	"ttzo7t": "คุณต้องคำนึงถึงสถานการณ์ที่คำใหม่อาจถูกนำเข้าไปในบล็อกลิสต์เริ่มต้น ในกรณีนี้การทำการเข้ารหัสตัวเลขอาจทำให้ได้ ID ที่แตกต่างกัน",
	"tt3i7z": "วิธีที่ดีที่สุดในการให้แน่ใจว่า ID ของคุณยังคงเหมือนเดิมตลอดการอัปเดตในอนาคตคือการให้บล็อกลิสต์ที่กำหนดเอง แม้ว่าจะเหมือนกับบล็อกลิสต์เริ่มต้นปัจจุบัน",
	"ttmfhy": "ไม่ การเข้ารหัสตัวเลขที่แตกต่างกันจะสร้าง ID ที่ไม่ซ้ำกัน",
	"ttt85f": "อย่างไรก็ตาม เนื่องจากการออกแบบของอัลกอริทึมการถอดรหัส ID สุ่มอาจสร้างตัวเลขเดียวกันได้บางครั้ง วิธีที่ดีที่สุดในการตรวจสอบว่า ID เป็นแบบกฎหมายคือที่จะทำการเข้ารหัสตัวเลขที่ถอดรหัสและตรวจสอบว่า ID ตรงกันหรือไม่",
	"ttehfa": "{hashids} เป็นรุ่นแรกของไลบรารีนี้ที่ปรากฏในปี 2013 นอกจากนี้ยังสร้าง ID สั้นๆ แต่ใช้วิธีที่ไม่ใช่เดียวกับนี้เล็กน้อย",
	"ttl3hc": "{hashids} จัดการกับสิ่งที่ไม่ซ้ำกันอย่างไม่เหมือนกัน",
	"ttgla4": "มันไม่รองรับบล็อกลิสต์ที่กำหนดเองแต่ใช้คำหยาบที่มักจะพบบ่อยในภาษาอังกฤษ นอกจากนี้ยังใช้พารามิเตอร์ {salt} เพื่อการสับเบิลอักษรซึ่งทำให้เกิดความสับสนเล็กน้อยเพราะไลบรารีนี้ไม่มีความเกี่ยวข้องกับการเข้ารหัส อีกทั้งยังใช้ตัวอักษรที่สงวนไว้มากมายทำให้ได้ IDs ที่ยาวขึ้น",
	"ttajo1": "ด้วยเหตุผลนี้เราตัดสินใจที่จะอัปเกรดและเปลี่ยนชื่อ เราได้ทำการปรับปรุงอัลกอริทึมให้เรียบง่ายลง เพิ่มคุณสมบัติบางอย่างและเก็บรวบรวมรหัสทั้งหมดไว้ภายใต้ [ที่เดียวกันนี้]({url})",
	"ttzolt": "พารามิเตอร์ {salt} ถูกใช้สำหรับการสับเบิลอักษร และไม่เคยมีความหมายที่เกี่ยวข้องกับความปลอดภัย ทั้ง {hashids} และ {name} ทำงานอย่างเดียวกันกับการแปลงเลขฐานสิบเข้าเลขฐานสิบหก แต่มีการปรับปรุงบางอย่าง ไม่มีการเข้ารหัสใดๆ เพื่อหลีกเลี่ยงความสับสน พารามิเตอร์นี้ได้ถูกลบออกโดยสมบูรณ์",
	"ttnq6i": "ไม่ {name} ขยายความสามารถของ {hashids} และมีวัตถุประสงค์และความต้องการในการออกแบบที่แตกต่างกัน ดังนั้น IDs ที่สร้างขึ้นไม่สามารถที่จะใช้งานร่วมกับ {hashids} ได้",
	"ttixzo": "เนื่องจากไม่มีความเข้ากันได้ระหว่าง {hashids} และ {name} การแทนที่ {hashids} ด้วย {name} เป็นเรื่องที่เป็นไปไม่ได้",
	"ttydl6": "อย่างไรก็ตามคุณสามารถรวมการใช้งานร่วมกันโดยการแยกแยะว่า ID ใดเป็นของไลบรารีไหน",
	"tt6n93": "วิธีหนึ่งในการทำเช่นนั้นคือด้วยความยาวของ ID - หากคุณกำลังเปลี่ยนไปใช้ {name} คุณสามารถให้ความยาวขั้นต่ำสูงกว่าได้ อีกวิธีหนึ่งคือการเพิ่มตัวอักษรที่กำหนดเองไปยัง ID ที่สร้างขึ้นใหม่เอง",
	"tth5bj": "สุดท้ายนี้คุณยังสามารถพยายามที่จะถอดรหัส ID ด้วย {hashids} เพื่อดูว่ามันเป็น ID ที่ถูกต้องหรือไม่ หากไม่ถูกต้อง - ถอดรหัสและเข้ารหัสใหม่ด้วย {name} เพื่อดูว่ามันทำงานหรือไม่",
	"tt0a8s": "การสร้างภาษาแต่ละภาษาบนเว็บไซต์นี้ลิงก์ไปยังที่เก็บรวบรวมของ {hashids} ด้วยถ้ามีอยู่",
	"tt9t9m": "หากคุณต้องการสนับสนุนโปรเจคเราขอแสดงความนับถือในการเพิ่มดาวให้กับเราบน Github เพื่อให้มีความมองเห็นมากขึ้น",
	"ttpgkb": "หากคุณเป็นนักพัฒนาและไม่พบการประมวลแหล่งข้อมูล {name} สำหรับภาษาเฉพาะใดๆ โปรดช่วยเราในการแปลงไลบรารี และเช่นเดียวกันสำหรับภาษาที่ไม่ได้รับการระบุ",
	"ttk57h": "หากคุณพบข้อบกพร่องในข้อกำหนดหรือทั้งหมดในการประมวล โปรดสร้างปัญหาหรือคำขอดึงด้วยการแนะนำการแก้ไขที่เหมาะสมในเกณฑ์ในที่เก็บรวบรวมข้อมูลที่เหมาะสม",
	"tt1rhp": "หากคุณพูดหลายภาษาเราต้องการความช่วยเหลือจากคุณในการ [ปรับปรุงบล็อกลิสต์]({blocklist}) และ [ปรับการแปลเว็บไซต์]({i18n}) หากคุณพบปัญหาใดๆ",
	"tt49l5": "สุดท้ายหากคุณมีประสบการณ์บางอย่างกับ {hashids}/{name} โปรดช่วยเสริมแรงชุมชนของเราด้วยการตอบคำถามของใครสักคน",
	"ttqbpx": "หากคุณต้องการที่จะพอร์ต {name} ไปยังหนึ่งในภาษาต่อไปนี้ (หรือภาษาใหม่ที่ยังไม่ได้รับการระบุที่นี่):",
	"ttt00f": "โคลนเก็บรวบรวมอย่างเป็นทางการไปยังบัญชี Github ของคุณเองและปรับใช้ [ข้อกำหนดการใช้งาน]({spec}) พร้อมกับการทดสอบทั้งหมด คุณสามารถใช้ READMEs ที่มีอยู่แล้วได้ ([ตัวอย่าง]({example}))",
	"tt5myu": "เมื่อไลบรารีพร้อมใช้งาน สร้างคำขอดึงด้วยการถอดรหัสเสร็จเรียบร้อยแล้วเราจะอัปเดตเว็บไซต์",
	"tt72cr": "หากเก็บรวบรวมไม่มีผู้ดูแลแล้วเรายินดีที่จะเชิญคุณมาดูแลเก็บรวบรวมและเป็นผู้ดูแลที่เป็นทางการ",
	"ttdqen": "หากคุณเป็นผู้เชี่ยวชาญในสิ่งต่อไปนี้ โปรดแจ้งเราหากคุณต้องการที่จะพอร์ตไลบรารี:",
	"ttfsed": "ไม่พบ",
	"ttsp7q": "อื่น ๆ",
	"tt8aj0": "ลอง:",
	"ttfspd": "[{clickhouse}]({url1}) ให้ฟังก์ชัน SQL ที่ซ่อนอยู่สำหรับการสร้าง {name} ด้วยพารามิเตอร์เริ่มต้น ฟังก์ชันนี้มีให้บริการตั้งแต่ {clickhouse} [{version}]({url2}):"
}
