{
	"tt52up": "Kısa Eşsiz Kimlikler Oluştur",
	"tt75ra": "{name}{pronounced} sayılarından kısa eşsiz tanımlayıcılar oluşturmanıza izin veren açık kaynaklı bir kütüphanedir. Bu kimlikler URL'ye uygun, birkaç sayıyı kodlayabilir ve yaygın küfür içermemektedir.",
	"ttd0n6": "Daha Fazla Oku",
	"ttf0dj": "Bunlar nasıl görünüyor:",
	"ttspqb": "Kullanım Alanları",
	"tt810r": "{name} ana kullanımı tamamen görseldir. Projede sayılar yerine kimlik kullanmak isterseniz, {name} iyi bir seçenek olabilir.",
	"ttfxdj": "İyi İçin",
	"ttcn90": "İyi Değil İçin",
	"ttxrw3": "Birincil anahtarları kodlama",
	"ttblk8": "İlişkisel veritabanı kullanıyorsanız",
	"ttw5eb": "Veritabanı sorgularını kaydetme",
	"ttrzg4": "Birden fazla nesneyi kodlayarak",
	"ttj376": "Geçici giriş belirteçleri",
	"ttor8c": "Küfürsüz ve URL uyumlu",
	"ttzbtd": "Duyarlı veri",
	"tt3bzl": "Bu bir şifreleme kütüphanesi değil",
	"ttm1yo": "Kullanıcı kimlikleri",
	"ttt7ff": "Kodlamayı alanbilirse kullanıcı sayısını ortaya çıkarabilir",
	"tte6as": "SSS",
	"ttl1c7": "Oyun Alanı",
	"ttgq43": "Dil",
	"ttaf1b": "Özellikler",
	"ttz5td": "Negatif olmayan sayılardan kısa kimlikler oluştur",
	"ttncim": "Kolay kodlama ve kod çözme",
	"ttimoo": "Otomatik oluşturulan kimlikler genel küfür içermez",
	"tty56c": "Karışık alfabe ile özel kimlikleri destekleme",
	"tt6v30": "Her sürüm aynı kimlikleri üretir",
	"tthejy": "Hoşgörülü lisanslı küçük kütüphane",
	"tt0ds2": "{count} programlama dilleri ({new} yeni tasarım kullanıyor)",
	"tt9vmk": "Başla",
	"ttpebs": "Hangi dili kullanıyorsunuz?",
	"ttkph9": "Bulamıyorum",
	"tt1ap4": "Bize bildirin?",
	"tt445i": "Örnek",
	"ttqewx": "Alfabe",
	"tttnnf": "Sayılar",
	"tt52lu": "Oluşturulan Kimlik",
	"tt74ur": "karıştır",
	"ttdosn": "Karıştır",
	"ttfisd": "yeni",
	"ttswbq": "Metin çevirisi düzenleme öner",
	"tt8qp0": "Sponsor",
	"ttfiwd": "Popüler",
	"ttcyi9": "Soru sor",
	"ttxagw": "Hata buldunuz mu?",
	"ttbjck": "{name} yükseltildi ve yeniden markalandı",
	"ttw1ue": "{github} üzerinde {what}ı yıldızla",
	"ttr5tg": "Hızlı kodlama ve kod çözme örneği:",
	"ttjgz7": "Eğer kimlikler çok kısa ise, onları belirli bir uzunluğa kadar doldurabilirsiniz:",
	"ttosg8": "Alfabeyi karıştırarak benzersiz kimlikler oluştur:",
	"ttzdkt": "Tam belge burada bulunmaktadır",
	"tt3fkz": "Başlangıç",
	"ttm3py": "Orijinal {name}'i arıyorsanız, burada bulabilirsiniz:",
	"tttnrf": "{lang} için {name} henüz hazır değil.",
	"ttep3a": "Görev listemizi yükseltmek için lütfen depoyu yıldızlayın:",
	"ttlmpc": "Bu sürümü hayata geçirmeye yardımcı olmak istiyorsanız, bunun nasıl yapılacağına dair bir SSS bölümü bulunmaktadır:",
	"ttgux4": "{name}'i başka bir dile taşımak için nasıl?",
	"ttabd1": "Orijinal {name} projesini arıyorsanız, burada bulabilirsiniz:",
	"ttzdut": "Lütfen bu sürüm tamamlandığında mevcut algoritma ile uyumlu olmayacağını unutmayın.",
	"ttn89i": "{name}, sayılardan kısa benzersiz kimlikler oluşturmanıza izin veren açık kaynaklı bir kütüphanedir. {count} programlama dillerini destekler.",
	"tti0yo": "{lang}'da Kısa Benzersiz Kimlikler",
	"ttyzu6": "{lang}'da {name} kullanarak kısa benzersiz kimlikler oluşturun. Bu tanımlayıcılar URL uyumlu, birkaç sayıyı kodlayabilir ve yaygın küfür içermez.",
	"tt6t23": "{name} oyun alanı. {name} kodlama ve kod çözme kütüphanesini keşfedin.",
	"tthraj": "{name} için Sıkça Sorulan Sorular.",
	"tt0xns": "Minimum Uzunluk",
	"tt962m": "Engelleme Listesi",
	"ttphab": "Kendi özel kelimelerinizi boşluklarla ayırarak ekleyin...",
	"ttk7bh": "Varsayılan engelleme listesini de kullan",
	"tt1k1p": "Varsayılan",
	"tt42u5": "Kısa",
	"ttqaex": "Uzun",
	"tttiif": "Harfler",
	"tt5lcu": "Küçük harf",
	"tt75vr": "Büyük harf",
	"ttd8qn": "Liste",
	"ttfoqd": "Kodla",
	"ttsekq": "Çöz",
	"tt8xb0": "Çoklu kodla",
	"ttfoed": "Ekstra sıfır kodla",
	"ttc6o9": "Büyük sabit kodla",
	"ttx14w": "Kimlik",
	"ttb79k": "Bu sayıları kodlama:",
	"ttwpve": "Üretecek:",
	"ttrufg": "Bu kimliği çözme:",
	"ttj4t7": "Alfabenin en az {count} karakter uzunluğunda olması gerekiyor",
	"ttoq48": "Alfabedeki boşluklar ihmal edilecek",
	"ttznht": "{count} karakterden az olan engelleme listesi kelimeleri ihmal edilecek",
	"tt3dhz": "blok",
	"ttmzby": "Genel",
	"tttigf": "Ne için iyidir?",
	"ttebza": "Ne için iyi değildir?",
	"ttlybc": "Bir seferde birden fazla sayıyı kodlayabilir miyim?",
	"ttgvw4": "Üretilen kimlikler benzersiz midir?",
	"ttakn1": "{name}'ın hangi kısıtlamaları var?",
	"ttznvt": "Katılım",
	"ttn0mi": "Dikkat Edilmesi Gerekenler",
	"ttis6o": "Doldurma",
	"ttytv6": "Kimliklerimi nasıl benzersiz yapabilirim?",
	"tt6fl3": "Varsayılan alfabeyi nasıl karıştırabilirim?",
	"tthg1j": "Daha kısa mı yoksa daha uzun bir alfabe mi kullanmak daha iyidir?",
	"tt0wis": "Alfabem yalnızca sayılardan oluşabilir mi?",
	"tt93lm": "Alfabeyi emoji olarak kullanabilir miyim?",
	"ttpj1b": "Neden kimlikleri doldurmalıyım?",
	"ttkrkh": "Üretilmiş kimlikleri daha uzun yapabilir miyim?",
	"tt1jbp": "Üretilmiş kimlikleri belirli bir uzunlukta yapabilir miyim?",
	"tt4lv5": "Neden bir engelleme listesi kullanmalı?",
	"ttq1ax": "Engelleme listesi nasıl çalışır?",
	"tttoof": "Varsayılan engelleme listesinde hangi kelimeler var?",
	"tt5c9u": "Tüm kimlikler engellendiğinde ne olur?",
	"tt7u2r": "Kimliklerin geçerli olup olmadığını nasıl kontrol edebilirim?",
	"ttd0xn": "Varsayılan engelleme listesi güncellendiğinde ne olur?",
	"ttf8xd": "Farklı sayıları kodlama aynı kimlikleri üretebilir mi?",
	"ttsahq": "{name} nedir?",
	"tt8wk0": "{hashids} neden {name} olarak yükseltildi?",
	"ttf8ad": "{salt} parametresi neden kaldırıldı?",
	"ttc389": "{hashids} {name} ile uyumlu mu?",
	"ttxp5w": "{hashids} 'den {name} 'e nasıl güvenli bir şekilde yükseltilebilirim?",
	"ttbrmk": "Orijinal {hashids} kütüphanelerini nereden bulabilirim?",
	"ttwb2e": "Nasıl katkıda bulunabilirim?",
	"ttrvdg": "{name}'i başka bir dile nasıl taşıyabilirim?",
	"ttj5f7": "{name}, sayılardan kısa, benzersiz, rastgele görünümlü kimlikler üretebilen küçük bir açık kaynaklı kütüphanedir.",
	"ttox58": "Onu düşünmenin en iyi yolu bir ondalık-hexadecimal dönüştürücüsü gibi, ancak birkaç ek özellikle.",
	"ttzijt": "Bağlantı kısaltma, kayıt için benzersiz etkinlik kimlikleri oluşturma, web sitesindeki ürün/nesne kimlikleri oluşturma (videolar için YouTube'un yaptığı gibi), metin mesajları için kısa kimlikler oluşturma, e-postalardaki onay kodları vb.",
	"tt3njz": "Hassas veriler her türlüdür. Üretilen kimlikler kripto değildir ve sayılara geri çözülebilirler. Örneğin, kullanıcı kimlikleri için iyi bir seçim olmayabilir, çünkü çözüldükten sonra uygulamanızın kullanıcı sayısını ortaya çıkarabilirler.",
	"ttmtky": "Evet. {name}, bir veya birden fazla negatif olmayan sayıyı tek bir kimliğe kodlayabilir. Kaç sayıyı kodlayabileceğiniz konusunda bir sınırlama yoktur, ancak kodlayabileceğiniz sayının büyüklüğüne (uygulama diline bağlı olarak) bir sınırlama vardır.",
	"ttto4f": "Bu çeşitli nedenler için faydalıdır: Bir UNIX zaman damgasını kodlayabilir ve sona eren kimlikler oluşturabilir veya bir veritabanı parçacık numarasını birincil anahtarla kodlayabilir ve ekstra veritabanı sorgularında tasarruf edebilirsiniz.",
	"ttekta": "Evet, üretilen kimlikler girdi ve alfabeye özgüdür.",
	"ttl6kc": "Ancak, varsayılan alfabe hem büyük harfleri hem de küçük harfleri içerdiğinden, varsayılan kimlikler büyük/küçük harfe duyarlıdır.",
	"ttg2e4": "{name} negatif sayıları kodlayamaz.",
	"ttahi1": "Minimum alfabe uzunluğu {length} karakterdir.",
	"ttzi2t": "Alfabe çoklu baytlı karakter içeremez.",
	"ttnsyi": "{name}, belirli bir uzunluğa kadar kimlik üretemez, sadece belirli bir uzunluğun altında. Minimum uzunluk parametre aralığı {min} ile {max} arasındadır.",
	"ttiq3o": "{name}, alfabe uzunluğuna eksi bir kadar kimlik yeniden oluşturmayı deneyebilir.",
	"ttyf26": "Kütüphane, kimlikler oluşturabileceği özel bir alfabeyi kabul eder. Sadece sağlanan varsayılan alfabeyi önceden karıştırın.",
	"tt6dc3": "Lütfen yeterli çaba harcanırsa, birisi karışık alfabenizi tersine mühendislik yapabilir, bu nedenle bu hassas verileri gizlemek için bir teknik kesinlikle değildir.",
	"tth4pj": "Varsayılan alfabe [burada]({url}) bulunabilir.",
	"tt0eos": "Herhangi bir çevrimiçi dize karıştırma aracını veya [oyun alanımızı](/playground) kullanabilirsiniz.",
	"tt9zcm": "Kullanım durumunuza bağlıdır. Daha kısa bir alfabe daha uzun kimlikler üretecek, daha uzun bir alfabe ise daha kısa kimlikler üretecektir. Kimliklerinizin nasıl görünebileceğini test etmek için [oyun alanını](/playground) kullanabilirsiniz.",
	"ttp7pb": "Evet. Üretilen kimlikler hala dizelerdir ve sıfır ile başlayabilirler.",
	"ttk4jh": "Hayır. {name}, alfabede çoklu baytlı karakterleri desteklemez. Bu, emojilerin yanı sıra birçok başka karakteri de içerir.",
	"tt17kp": "Kütüphane, kimlikleri göründüklerinden daha uzun göstermek için gereksiz karakterlerle genişletebilir. Bu, {min} gibi küçük bir sayıyı kodladığınızda veya {max} gibi büyük bir sayıyı kodladığınızda bu kadar açık olmadığı için yararlıdır.",
	"tt4c25": "Çözme etkilenmez.",
	"ttqp1x": "Evet, kütüphane, kimliklerin en az o uzunlukta olacağını garanti eden bir minimum uzunluk parametresini kabul eder.",
	"ttt88f": "Lütfen kimliklerinizin ne kadar uzun olacağı konusunda bir garanti olmadığını, sadece belirttiğiniz uzunluktan daha kısa olmayacaklarını unutmayın.",
	"tt59mu": "Belli bir noktaya kadar.",
	"tt7vlr": "Maksimum uzunluğu belirlemek mümkün değil çünkü elbet bir noktada kimlikleriniz büyük bir giriş verildiğinde taşacak. Bu nedenle yalnızca minimum uzunluk parametresi desteklenir ve kesin uzunluk veya maksimum uzunluk desteklenmez.",
	"ttdswn": "Engelleme listesi, kimliklerinizde belirli kelimelerin görünmesini engelleyebilir. Bu, üretilen kimliklerin URL gibi halka açık yerlerde görünmesi amaçlandığı için faydalıdır.",
	"ttf0wd": "{name}, çeşitli dillerden en temel küfür ve uygunsuz kelimeleri içeren [varsayılan engelleme listesi]({url}) ile birlikte gelir. Elbette bu engelleme listesini kendi kelimelerinizle genişletebilirsiniz.",
	"tts1jq": "Engelleme listesi kelime eşleme durumu duyarlı değildir.",
	"tt8eh0": "3 karakterden daha kısa olan kısa kelimeler engellenmeyecek. 3 karakter uzunluğundaki kelimeler tam olarak kimliklerle eşleşmelidir. 4 karakter veya daha uzun kelimeler, kimliklerin bir alt dizisi olmaları durumunda bir eşleşme tetikleyecektir.",
	"ttf01d": "Engelleme listesi kelimeleri sayılar içeriyorsa (leetspeak), yalnızca kimliklerin başında veya sonunda olduklarında bir eşleşme tetikleyeceklerdir.",
	"ttcz09": "Varsayılan engelleme listesi, birçok dildeki en yaygın küfürleri ve uygunsuz kelimeleri içerir. Tam listeyi [burada]({url}) bulabilirsiniz.",
	"ttxbuw": "Oluşturulan kimlik engelleme listesindeki bir kelimeyle eşleştiğinde, kütüphane kimliği yeniden oluşturmaya çalışır.",
	"ttbgyk": "Her bir deneme kimliği yeniden oluşturamazsa, kodlama işlevi başarısız olacak ve bir hata döndürecektir. Bu hatayı işlemek kullanıcının sorumluluğundadır.",
	"ttwkle": "Yeniden oluşturma denemelerinin sayısını azaltmanın en iyi yolu, daha uzun bir alfabeye sahip olmak, minimum uzunluğu belirlememek ve daha küçük bir engelleme listesi sağlamaktır. Boş bir engelleme listesi sağlamak özelliği tamamen devre dışı bırakır.",
	"ttr2ng": "Kimlikleri çözme genellikle bir tür sayısal çıktı üretir, ancak bu her zaman kimliğin kanonik olduğu anlamına gelmez. Kimliğin geçerli olup olmadığını kontrol etmek için, çözülmüş sayıları yeniden kodlayabilir ve kimliğin eşleşip eşleşmediğini kontrol edebilirsiniz.",
	"ttjud7": "Bunun otomatik olarak yapılmamasının nedeni, varsayılan engelleme listesinin gelecekte değişmesi durumunda, geçmişte oluşturulmuş olan ve şimdi yeni bir engelleme listesi kelimesiyle eşleşen kimlikleri otomatik olarak geçersiz kılmak istememizdir.",
	"ttowu8": "Varsayılan engelleme listesi değişirse, {changelog}'i güncelleyeceğiz.",
	"ttzo7t": "Varsayılan engelleme listesine yeni bir kelimenin eklenme olasılığını hesaba katmalısınız. Bu durumda, sayıları yeniden kodlama farklı bir kimlik üretebilir.",
	"tt3i7z": "Gelecekteki güncellemeler boyunca kimliklerinizin tutarlı kalmasının en iyi yolu, mevcut varsayılan engelleme listesi ile aynı olsa bile özel bir engelleme listesi sağlamaktır.",
	"ttmfhy": "Hayır, farklı sayıları kodlamak benzersiz kimlikler üretecektir.",
	"ttt85f": "Ancak, algoritmanın tasarımı nedeniyle rastgele kimlikleri çözme bazen aynı sayıları üretebilir. Kimliğin kanonik olup olmadığını kontrol etmenin en iyi yolu, basitçe çözülmüş sayıları yeniden kodlamak ve kimliğin eşleşip eşleşmediğini kontrol etmektir.",
	"ttehfa": "{hashids}, 2013 civarında piyasaya çıkan bu kütüphanenin ilk sürümüydü. Ayrıca kısa kimlikler üretiyordu ancak biraz farklı bir yöntem kullanıyordu.",
	"ttl3hc": "{hashids} birkaç şeyi farklı ele alıyordu.",
	"ttgla4": "Özel bir engelleme listesini desteklemedi, bunun yerine en yaygın İngiliz küfür kelimelerine güveniyordu. Ayrıca, kütüphane şifrelemeyle hiçbir ilgisi olmadığı için alfabeyi karıştırmak için {salt} parametresini kullanması biraz kafa karıştırıcıydı. Ayrıca, çok sayıda rezerve karakter kullanılması daha uzun kimliklerin üretilmesine neden oldu.",
	"ttajo1": "Bu nedenle, yükseltmeye ve yeniden markalaşmaya karar verdik. Algoritma basitleştirildi, birkaç özellik eklendi ve kod depoları artık [bir çatı altında]({url}) toplandı.",
	"ttzolt": "{salt} parametresi alfabeyi karıştırmak için kullanılmıştı ve güvenlik veya güvenlikle ilişkilendirilmek istenmemiştir. Hem {hashids} hem de {name}, ondalık sayıdan onaltılık dönüşümün nasıl çalıştığına benzer bir şekilde çalışır, ancak bazı ayarlamalarla. Herhangi bir şifreleme yoktur, bu nedenle karışıklığı önlemek için o parametre tamamen kaldırılmıştır.",
	"ttnq6i": "Hayır, {name}, {hashids}'in işlevselliğini genişletir ve farklı tasarım hedefleri ve gereksinimleri vardır; bu nedenle üretilen kimlikler {hashids} ile uyumlu değildir.",
	"ttixzo": "{hashids} ve {name} arasında uyumluluk olmadığı için {hashids}'i basitçe {name} ile değiştirmek imkansızdır.",
	"ttydl6": "Ancak, her bir kimliğin hangi kütüphaneye ait olduğunu ayırarak ikisini birleştirebilirsiniz.",
	"tt6n93": "Bunun bir yolu, kimlik uzunluğuna göre - {name}'e geçiyorsanız, daha yüksek bir minimum uzunluk sağlayabilirsiniz. Başka bir yol, yeni oluşturulan kimliklere manuel olarak özel bir karakter eklemektir.",
	"tth5bj": "Son olarak, bir kimliği {hashids} ile çözümlemeyi ve geçerli olup olmadığını görmek için deneyebilirsiniz. Değilse - {name} ile çözümleyip yeniden kodlamayı deneyin.",
	"tt0a8s": "Bu web sitesindeki her dil uygulaması, varsa orijinal {hashids} deposuna bağlantı sağlar.",
	"tt9t9m": "Projeyi desteklemek istiyorsanız, Github'daki depolarımızı yıldızlayarak daha fazla görünürlük sağlarız.",
	"ttpgkb": "Bir geliştiriciyseniz ve belirli bir dil için {name} uygulaması bulamıyorsanız, lütfen kütüphaneyi dönüştürmemize yardımcı olun. Aynı durum listelenmeyen bir programlama dili için de geçerlidir.",
	"ttk57h": "Özellikle özellikte veya uygulamalardan herhangi bir hata görürseniz, uygun depoda önerilen bir düzeltme ile bir sorun veya bir birleştirme isteği oluşturun.",
	"tt1rhp": "Birden fazla dil konuşuyorsanız, [engelleme listesini hassas bir şekilde ayarlama]({blocklist}) ve [web sitesi çevirilerini ayarlama]({i18n}) konusunda yardımınıza ihtiyacımız varsa, lütfen herhangi bir sorun görürseniz.",
	"tt49l5": "Son olarak, {hashids}/{name} ile biraz deneyiminiz varsa, lütfen topluluğumuzu herhangi birinin sorularına cevaplayarak yönlendirmemize yardımcı olun.",
	"ttqbpx": "{name}'i aşağıdaki dillerden birine (veya burada listelenmeyen yeni bir dile) taşımak istiyorsanız:",
	"ttt00f": "Resmi deposunu kendi Github hesabınıza klonlayın ve [spec]({spec}) ile birlikte tüm testleri uygulayın. Mevcut README'lerden herhangi birini tekrar kullanabilirsiniz ([örnek]({example})).",
	"tt5myu": "Kütüphane hazır olduğunda bir birleştirme isteği oluşturun. Birleştirildikten sonra, web sitesini güncelleyeceğiz.",
	"tt72cr": "Eğer depoda aktif bakıcı yoksa, sizin yönetmeniz ve resmi bakıcı olmanız için sizi davet etmekten mutluluk duyarız.",
	"ttdqen": "Aşağıdaki konuda bir uzman değilseniz, kütüphaneyi taşımak istiyorsanız lütfen bize ping atın:",
	"ttfsed": "Bulunamadı",
	"ttsp7q": "Diğer diller",
	"tt8aj0": "Dene:"
}
