{
	"tt52up": "Створення коротких унікальних ідентифікаторів",
	"tt75ra": "{name}{pronounced} - це бібліотека з відкритим вихідним кодом, яка дозволяє генерувати короткі унікальні ідентифікатори з чисел. Ці ідентифікатори безпечні для URL, можуть кодувати кілька чисел і не містять спільних нецензурних слів.",
	"ttd0n6": "Дізнатися більше",
	"ttf0dj": "Отак вони виглядають:",
	"ttspqb": "Використання",
	"tt810r": "Основне використання {name} - це виключно візуальне. Якщо ви хочете використовувати ідентифікатори замість чисел у своєму проекті, {name} може бути хорошим вибором.",
	"ttfxdj": "Добре підходить для",
	"ttcn90": "Не підходить для",
	"ttxrw3": "Кодування основних ключів",
	"ttblk8": "Якщо використовуєте реляційну базу даних",
	"ttw5eb": "Економія запитів до бази даних",
	"ttrzg4": "Кодуючи кілька об'єктів",
	"ttj376": "Тимчасові токени входу",
	"ttor8c": "Без нецензурної лексики та безпечні для URL",
	"ttzbtd": "Чутлива інформація",
	"tt3bzl": "Це не бібліотека шифрування",
	"ttm1yo": "Ідентифікатори користувачів",
	"ttt7ff": "Може розкрити кількість користувачів, якщо хтось дізнається алфавіт кодування",
	"tte6as": "Питання",
	"ttl1c7": "Майданчик",
	"ttgq43": "Бібліотека",
	"ttaf1b": "Функції",
	"ttz5td": "Генерувати короткі ідентифікатори з не-від'ємних чисел",
	"ttncim": "Просте кодування та декодування",
	"ttimoo": "Автоматично згенеровані ідентифікатори не містять спільних нецензурних слів",
	"tty56c": "Підтримка власних ідентифікаторів через випадковий алфавіт",
	"tt6v30": "Кожна версія генерує однакові ідентифікатори",
	"tthejy": "Невелика бібліотека з дозволеною ліцензією",
	"tt0ds2": "{count} інтеграцій ({new} за допомогою нового дизайну)",
	"tt9vmk": "Початок роботи",
	"ttpebs": "Що ви використовуєте?",
	"ttkph9": "Не знаходите?",
	"tt1ap4": "Сповістіть нас про це?",
	"tt445i": "Приклад",
	"ttqewx": "Алфавіт",
	"tttnnf": "Числа",
	"tt52lu": "Згенерований ідентифікатор",
	"tt74ur": "перемішати",
	"ttdosn": "Перемішати",
	"ttfisd": "новий",
	"ttswbq": "Запропонувати виправлення перекладу тексту",
	"tt8qp0": "Спонсор",
	"ttfiwd": "Популярне",
	"ttcyi9": "Задати питання",
	"ttxagw": "Виявили помилку?",
	"ttbjck": "{name} було оновлено та перейменовано",
	"ttw1ue": "Поставте зірочку {what} на {github}",
	"ttr5tg": "Швидкий приклад кодування та декодування:",
	"ttjgz7": "Якщо ID занадто короткі, ви можете доповнити їх до певної довжини:",
	"ttosg8": "Створіть унікальні ID, переставляючи алфавіт:",
	"ttzdkt": "Повна документація доступна на",
	"tt3fkz": "Початок роботи",
	"ttm3py": "Якщо ви шукаєте оригінальний {name}, ви можете знайти його тут:",
	"tttnrf": "{name} для {lang} ще не готовий.",
	"ttep3a": "Будь ласка, поставте зірочку репозиторію, щоб підняти його в нашому списку справ:",
	"ttlmpc": "Якщо ви хочете допомогти оживити цю версію, є розділ Часті питання з інструкціями, як це зробити:",
	"ttgux4": "Як перенести {name} на іншу мову?",
	"ttabd1": "Якщо ви шукаєте оригінальний проект {name}, ви можете знайти його тут:",
	"ttzdut": "Зверніть увагу, що він не буде сумісний з поточним алгоритмом після завершення цієї версії.",
	"ttn89i": "{name} - це бібліотека з відкритим вихідним кодом, яка дозволяє вам генерувати короткі унікальні ID з чисел. Вона підтримує {count} мов програмування.",
	"tti0yo": "Короткі унікальні ID у {lang}",
	"ttyzu6": "Створіть короткі унікальні ID у {lang} за допомогою {name}. Ці ідентифікатори безпечні для URL, можуть кодувати кілька чисел і не містять спільних нецензурних слів.",
	"tt6t23": "Майданчик {name}. Досліджуйте кодування та декодування бібліотеки {name}.",
	"tthraj": "Часті питання для {name}.",
	"tt0xns": "Мінімальна довжина",
	"tt962m": "Чорний список",
	"ttphab": "Додайте свої власні слова через пробіл…",
	"ttk7bh": "Використовуйте також стандартний чорний список",
	"tt1k1p": "Стандартний",
	"tt42u5": "Короткий",
	"ttqaex": "Довгий",
	"tttiif": "Букви",
	"tt5lcu": "Рядковий регістр",
	"tt75vr": "Великий регістр",
	"ttd8qn": "Список",
	"ttfoqd": "Кодувати",
	"ttsekq": "Декодувати",
	"tt8xb0": "Кодувати кілька",
	"ttfoed": "Кодувати додатковий нуль",
	"ttc6o9": "Кодувати велику константу",
	"ttx14w": "ID",
	"ttb79k": "Кодування цих чисел:",
	"ttwpve": "Буде згенеровано:",
	"ttrufg": "Декодування цього ID:",
	"ttj4t7": "Алфавіт повинен складатися щонайменше з {count} символів",
	"ttoq48": "Пропускаються пробіли у алфавіті",
	"ttznht": "Слова у чорному списку менші за {count} символів будуть проігноровані",
	"tt3dhz": "Блокувати",
	"ttmzby": "Загальне",
	"tttigf": "Для чого це корисно?",
	"ttebza": "Для чого це не підходить?",
	"ttlybc": "Чи можна закодувати кілька чисел одночасно?",
	"ttgvw4": "Чи унікальні згенеровані ідентифікатори?",
	"ttakn1": "Які обмеження має {name}?",
	"ttznvt": "Внести внесок",
	"ttn0mi": "Підводні камені",
	"ttis6o": "Доповнення",
	"ttytv6": "Як можу зробити свої ідентифікатори унікальними?",
	"tt6fl3": "Як я можу перетасувати стандартний алфавіт?",
	"tthg1j": "Чи краще використовувати коротший чи довший алфавіт?",
	"tt0wis": "Чи може алфавіт складатися лише з чисел?",
	"tt93lm": "Чи можна використовувати емодзі як алфавіт?",
	"ttpj1b": "Чому доповнювати ідентифікатори?",
	"ttkrkh": "Чи можу зробити згенеровані ідентифікатори довшими?",
	"tt1jbp": "Чи можу зробити згенеровані ідентифікатори певної довжини?",
	"tt4lv5": "Чому використовувати чорний список?",
	"ttq1ax": "Як працює чорний список?",
	"tttoof": "Які слова є у стандартному чорному списку?",
	"tt5c9u": "Що відбувається, коли всі ідентифікатори заблоковані?",
	"tt7u2r": "Як перевірити, чи ідентифікатори є валідними?",
	"ttd0xn": "Що відбувається, коли стандартний чорний список оновлюється?",
	"ttf8xd": "Чи кодування різних чисел може створити однакові ідентифікатори?",
	"ttsahq": "Що таке {name}?",
	"tt8wk0": "Чому {hashids} було оновлено до {name}?",
	"ttf8ad": "Чому параметр {salt} був видалений?",
	"ttc389": "Чи сумісний {hashids} з {name}?",
	"ttxp5w": "Як безпечно оновити з {hashids} до {name}?",
	"ttbrmk": "Де я можу знайти оригінальні бібліотеки {hashids}?",
	"ttwb2e": "Як я можу внести свій внесок?",
	"ttrvdg": "Як перенести {name} на іншу мову програмування?",
	"ttj5f7": "{name} - це невелика бібліотека з відкритим вихідним кодом, яка може створювати короткі унікальні, випадково виглядаючі ID з чисел.",
	"ttox58": "Найкращий спосіб уявити це - як конвертер десяткових чисел у шістнадцяткові, але з деякими додатковими можливостями.",
	"ttzijt": "Скорочення посилань, генерація унікальних ідентифікаторів подій для журналювання, генерація ідентифікаторів для товарів/об'єктів на веб-сайті (як робить YouTube для відео), генерація коротких ідентифікаторів для текстових повідомлень, коди підтвердження в електронних листах і т.д.",
	"tt3njz": "Будь-які дані, які є чутливими. Згенеровані ідентифікатори не є хешами і можуть бути розкодовані назад у числа. Наприклад, вони можуть не бути хорошим вибором для ідентифікаторів користувачів, оскільки, один раз розкодовані, вони можуть розкрити кількість користувачів вашого додатку.",
	"ttmtky": "Так. {name} може кодувати одне або багато не-від'ємних чисел у один ідентифікатор. Немає обмежень на кількість чисел, які можна закодувати, але є обмеження на те, яке число можна закодувати (залежно від мови реалізації).",
	"ttto4f": "Це корисно з кількох причин: ви можете закодувати мітку часу UNIX і створити ідентифікатори з обмеженим терміном дії, або ви можете закодувати номер фрагмента бази даних разом з основним ключем і зекономити додаткові запити до бази даних.",
	"ttekta": "Так, згенеровані ідентифікатори унікальні для вхідних даних та алфавіту.",
	"ttl6kc": "Але пам'ятайте, що стандартний алфавіт містить як загальні, так і великі літери, тому ідентифікатори за замовчуванням чутливі до регістру.",
	"ttg2e4": "{name} не може кодувати від'ємні числа.",
	"ttahi1": "Мінімальна довжина алфавіту становить {length} символів.",
	"ttzi2t": "Алфавіт не може містити багатобайтові символи.",
	"ttnsyi": "{name} не може генерувати ідентифікатори до певної довжини, лише принаймні певної довжини. Межа параметра мінімальної довжини знаходиться між {min} та {max}.",
	"ttiq3o": "{name} може спробувати відновити ідентифікатори до довжини алфавіту, мінус один.",
	"ttyf26": "Бібліотека приймає власний алфавіт, з якого вона може генерувати ідентифікатори. Просто передкласти стандартний алфавіт, який надається.",
	"tt6dc3": "Запам'ятайте, що за достатньої спрямованості зусиль хтось може розібрати ваш переставлений алфавіт, тому це зовсім не техніка для приховання чутливих даних.",
	"tth4pj": "Стандартний алфавіт можна знайти [тут]({url}).",
	"tt0eos": "Ви можете використовувати будь-який із онлайн-інструментів для перемішування рядків або наш [ігровий майданчик](/playground).",
	"tt9zcm": "Залежить від вашого використання. Коротший алфавіт створить довші ідентифікатори, а довший алфавіт - коротші. Ви можете скористатися [ігровим майданчиком](/playground), щоб перевірити, як будуть виглядати ваші ідентифікатори.",
	"ttp7pb": "Так. Зверніть увагу, що згенеровані ідентифікатори все ще є рядками, і вони можуть починатися з нуля.",
	"ttk4jh": "Ні. {name} не підтримує багатобайтові символи для алфавіту. Це також стосується емодзі та багатьох інших символів.",
	"tt17kp": "Бібліотека може розширювати ідентифікатори символами-сміттям, щоб зробити їх довшими. Це корисно, щоб не було очевидно, чи кодуєте ви невелике число, наприклад {min}, чи велике число, наприклад {max}.",
	"tt4c25": "Декодування не буде пошкоджене.",
	"ttqp1x": "Так, бібліотека приймає параметр мінімальної довжини, який гарантує, що ідентифікатори будуть принаймні такої довжини.",
	"ttt88f": "Зверніть увагу, що немає гарантії на те, якої довжини будуть ваші ідентифікатори - лише те, що вони не будуть коротші за вказану вами довжину.",
	"tt59mu": "До певної міри.",
	"tt7vlr": "Встановлення максимальної довжини неможливе, оскільки рано чи пізно ваші ідентифікатори переповняться при великому вхідному значенні. Тому підтримується лише параметр мінімальної довжини, а точна або максимальна довжина не підтримується.",
	"ttdswn": "Чорний список може перешкоджати певним словам виявлятися в ваших ідентифікаторах. Це корисно, оскільки згенеровані ідентифікатори призначені для відображення в публічних місцях, наприклад, у URL.",
	"ttf0wd": "{name} постачається з [стандартним чорним списком]({url}), який містить найбільш загальну ненормативну лексику та нецензурні слова з кількох мов. Звичайно, ви можете розширити цей чорний список своїми словами.",
	"tts1jq": "Співпадання слів у чорному списку не чутливе до регістру.",
	"tt8eh0": "Короткі слова менше 3 символів не будуть блоковані. Слова довжиною 3 символи повинні точно співпадати з ідентифікаторами. Слова довжиною 4 символи або більше спричинять співпадіння, якщо вони є підстрокою ідентифікатора.",
	"ttf01d": "Якщо слова з чорного списку містять числа (leet-мову), вони спрацьовуватимуть лише, якщо вони знаходяться на початку або в кінці ідентифікатора.",
	"ttcz09": "Стандартний чорний список містить найбільш поширені нецензурні вислови та неприпустиму лексику з декількох мов. Повний список можна знайти [тут]({url}).",
	"ttxbuw": "Якщо згенерований ідентифікатор співпадає з словом у чорному списку, бібліотека спробує відновити його.",
	"ttbgyk": "Якщо кожна спроба відновлення ідентифікатора завершиться невдачею, функція кодування завершиться з помилкою. Обробка цієї помилки залежить від користувача.",
	"ttwkle": "Найкращий спосіб зменшити кількість спроб відновлення - це мати довший алфавіт, не встановлювати мінімальну довжину та надавати менший чорний список. Надання порожнього чорного списку повністю вимикає цю функцію.",
	"ttr2ng": "Декодування ідентифікаторів зазвичай дасть якийсь числовий вихід, але це ще не означає, що ідентифікатор є канонічним. Щоб перевірити, що ідентифікатор є валідним, ви можете повторно закодувати розкодовані числа і перевірити, чи співпадає ідентифікатор.",
	"ttjud7": "Причина, чому це не виконується автоматично, полягає в тому, що якщо стандартний список заблокованих слів зміниться у майбутньому, ми не хочемо автоматично недійсними робити створені раніше ідентифікатори, які тепер можуть відповідати новому списку слів.",
	"ttowu8": "Ми обов'язково оновимо {changelog}, якщо стандартний список заблокованих слів зміниться.",
	"ttzo7t": "Вам потрібно врахувати сценарії, де до стандартного списку може бути додане нове слово. У цьому випадку повторне кодування чисел може видаляти різні ідентифікатори.",
	"tt3i7z": "Найкращий спосіб забезпечити послідовність вашіх ідентифікаторів протягом майбутніх оновлень - надати власний список заблокованих слів, навіть якщо він ідентичний поточному стандартному списку.",
	"ttmfhy": "Ні, кодування різних чисел створить унікальні ідентифікатори.",
	"ttt85f": "Однак через конструкцію алгоритму декодування випадкових ідентифікаторів іноді може видавати ті самі числа. Найкращий спосіб перевірити канонічність ідентифікатора - просто повторно закодувати розкодовані числа і перевірити, чи співпадає ідентифікатор.",
	"ttehfa": "{hashids} був першою версією цієї бібліотеки, яка вийшла близько 2013 року. Він також створював короткі ідентифікатори, але використовував трохи інший метод.",
	"ttl3hc": "{hashids} обробляв кілька речей по-іншому.",
	"ttgla4": "Він не підтримував власний список заблокованих слів, але замість цього використовував найпоширеніші англійські нецензурні слова. Також використовував параметр {salt}, щоб переставляти алфавіт, що робило його трохи заплутаним, оскільки бібліотека не має нічого спільного з шифруванням. Крім того, використовувалося занадто багато зарезервованих символів, що призводило до створення більш довгих ідентифікаторів.",
	"ttajo1": "Отже, ми вирішили покращити і переозначити. Алгоритм спростився, було додано кілька функцій, і всі кодові репозиторії тепер під одним дахом за адресою [one roof now]({url}).",
	"ttzolt": "Параметр {salt} використовувався для перемішування алфавіту, і він ніколи не мав бути пов'язаний з безпекою. Як {hashids}, так і {name} працюють подібно до перетворення десяткових чисел у шістнадцяткові, але з деякими корекціями. Тут немає жодного шифрування, тому для уникнення плутанини цей параметр було повністю вилучено.",
	"ttnq6i": "Ні, {name} розширює можливості {hashids} і має різні цілі та вимоги до дизайну; тому створені ідентифікатори несумісні з {hashids}.",
	"ttixzo": "Оскільки між {hashids} та {name} немає сумісності, просто замінити {hashids} на {name} неможливо.",
	"ttydl6": "Однак ви можете об'єднати обидва, відрізняючи, який ідентифікатор належить якій бібліотеці.",
	"tt6n93": "Один із способів це зробити - це довжина ІД. Якщо ви переходите на {name}, ви можете встановити більшу мінімальну довжину. Ще один спосіб - вручну додати/передати власний символ до новостворених ІД.",
	"tth5bj": "Нарешті, ви також можете спробувати розкодувати ІД за допомогою {hashids}, щоб перевірити його на валідність. Якщо ні - розкодуйте та перекодуйте за допомогою {name}, щоб перевірити, чи працює це.",
	"tt0a8s": "Кожна мовна реалізація на цьому веб-сайті містить посилання на оригінальний репозиторій {hashids}, якщо він існує.",
	"tt9t9m": "Якщо ви хочете підтримати проект, ми б вдячні за додавання зірочки до наших репозиторіїв на Github для більшої видимості.",
	"ttpgkb": "Якщо ви розробник і не бачите реалізації {name} для певної мови програмування, будь ласка, допоможіть нам перетворити бібліотеку. Те ж саме стосується мови програмування, яка не вказана.",
	"ttk57h": "Якщо ви помітили помилку в специфікації або в будь-якій з реалізацій, будь ласка, створіть проблему або запит на злиття з пропозицією виправлення в відповідному репозиторії.",
	"tt1rhp": "Якщо ви володієте декількома мовами, нам буде корисна ваша допомога з [доналаштуванням списку заблокованих слів]({blocklist}) та [виправленням перекладів веб-сайту]({i18n}), якщо ви помітили будь-які проблеми.",
	"tt49l5": "Нарешті, якщо у вас є деякий досвід з {hashids}/{name}, будь ласка, допоможіть керувати нашою спільнотою, відповідаючи на будь-які питання, які можуть виникнути.",
	"ttqbpx": "Якщо ви хочете портувати {name} на одну з наступних мов програмування (або нову, яка не вказана тут):",
	"ttt00f": "Форкніть офіційний репозиторій у свій власний обліковий запис Github та реалізуйте [специфікацію]({spec}) разом із усіма тестами. Ви можете перевикористовувати будь-які існуючі README ([приклад]({example})).",
	"tt5myu": "Коли бібліотека буде готова, створіть запит на злиття. Після злиття ми оновимо веб-сайт.",
	"tt72cr": "Якщо у репозиторія немає активних утримувачів, ми будемо раді запросити вас керувати репозиторієм і стати офіційним утримувачем.",
	"ttdqen": "Якщо ви експерт у наступних областях, будь ласка, повідомте нас, якщо хочете портувати бібліотеку:",
	"ttfsed": "Не знайдено",
	"ttsp7q": "Інші",
	"tt8aj0": "Спробуйте:",
	"ttfspd": "[{clickhouse}]({url1}) надає вбудовану SQL-функцію для генерації {name} з параметрами за замовчуванням. Ця функція доступна з {clickhouse} [{version}]({url2}):"
}
