{
	"tt52up": "Tạo ID Ngắn Duy Nhất",
	"tt75ra": "{name}{pronounced} là một thư viện mã nguồn mở cho phép bạn tạo các định danh ngắn duy nhất từ các số. Những ID này an toàn trên URL, có thể mã hóa nhiều số và không chứa các từ thô tục thông thường.",
	"ttd0n6": "Đọc thêm",
	"ttf0dj": "Đây là những gì chúng trông giống như:",
	"ttspqb": "Các Ứng Dụng",
	"tt810r": "Sử dụng chính của {name} là hoàn toàn thị giác. Nếu bạn muốn sử dụng ID thay vì số trong dự án của bạn, {name} có thể là lựa chọn tốt.",
	"ttfxdj": "Tốt Cho",
	"ttcn90": "Không Tốt Cho",
	"ttxrw3": "Mã hóa khóa chính",
	"ttblk8": "Nếu bạn đang sử dụng cơ sở dữ liệu quan hệ",
	"ttw5eb": "Tiết kiệm tìm kiếm trong cơ sở dữ liệu",
	"ttrzg4": "Bằng cách mã hóa nhiều đối tượng",
	"ttj376": "Mã thông báo đăng nhập tạm thời",
	"ttor8c": "Không chứa từ thô tục và an toàn trên URL",
	"ttzbtd": "Dữ liệu nhạy cảm",
	"tt3bzl": "Đây không phải là thư viện mã hóa",
	"ttm1yo": "ID người dùng",
	"ttt7ff": "Có thể tiết lộ số lượng người dùng nếu có ai đó biết được bảng chữ cái mã hóa",
	"tte6as": "Câu hỏi",
	"ttl1c7": "Sân chơi",
	"ttgq43": "Thư viện",
	"ttaf1b": "Tính Năng",
	"ttz5td": "Tạo ID ngắn từ các số không âm",
	"ttncim": "Mã hóa & giải mã dễ dàng",
	"ttimoo": "Các ID được tạo tự động không chứa từ thô tục thông thường",
	"tty56c": "Hỗ trợ ID tùy chỉnh thông qua bảng chữ cái được xáo trộn",
	"tt6v30": "Mỗi phiên bản tạo ra các ID giống nhau",
	"tthejy": "Thư viện nhỏ với giấy phép linh hoạt",
	"tt0ds2": "{count} tích hợp ({new} sử dụng một thiết kế mới)",
	"tt9vmk": "Bắt đầu",
	"ttpebs": "Bạn đang sử dụng cái gì?",
	"ttkph9": "Không tìm thấy",
	"tt1ap4": "Hãy cho chúng tôi biết về điều đó?",
	"tt445i": "Ví dụ",
	"ttqewx": "Bảng chữ cái",
	"tttnnf": "Số",
	"tt52lu": "ID được tạo ra",
	"tt74ur": "xáo trộn",
	"ttdosn": "Xáo trộn",
	"ttfisd": "mới",
	"ttswbq": "Đề xuất chỉnh sửa dịch văn bản",
	"tt8qp0": "Nhà tài trợ",
	"ttfiwd": "Phổ biến",
	"ttcyi9": "Đặt câu hỏi",
	"ttxagw": "Tìm thấy lỗi?",
	"ttbjck": "{name} đã được nâng cấp & đổi tên",
	"ttw1ue": "Đánh dấu {what} trên {github}",
	"ttr5tg": "Ví dụ mã hóa và giải mã nhanh:",
	"ttjgz7": "Nếu ID quá ngắn, bạn có thể thêm độ dài cho chúng:",
	"ttosg8": "Tạo ID duy nhất bằng cách xáo trộn bảng chữ cái:",
	"ttzdkt": "Tài liệu đầy đủ tại",
	"tt3fkz": "Bắt đầu",
	"ttm3py": "Nếu bạn đang tìm phiên bản ban đầu của {name}, bạn có thể tìm thấy ở đây:",
	"tttnrf": "{name} cho {lang} vẫn chưa sẵn sàng.",
	"ttep3a": "Vui lòng đánh dấu sao cho dự án để đẩy nó lên danh sách việc cần làm của chúng tôi:",
	"ttlmpc": "Nếu bạn muốn giúp đỡ trong việc mang phiên bản này ra ánh sáng, có một phần FAQ về cách làm điều đó:",
	"ttgux4": "Cách chuyển {name} sang ngôn ngữ khác?",
	"ttabd1": "Nếu bạn đang tìm dự án {name} gốc, bạn có thể tìm thấy ở đây:",
	"ttzdut": "Vui lòng lưu ý rằng nó sẽ không tương thích với thuật toán hiện tại khi phiên bản này hoàn thành.",
	"ttn89i": "{name} là một thư viện mã nguồn mở cho phép bạn tạo các ID duy nhất ngắn từ các số. Nó hỗ trợ {count} ngôn ngữ lập trình.",
	"tti0yo": "ID Duy Nhất Ngắn trong {lang}",
	"ttyzu6": "Tạo các ID duy nhất ngắn trong {lang} sử dụng {name}. Những định danh này an toàn trên URL, có thể mã hóa nhiều số và không chứa từ thô tục thông thường.",
	"tt6t23": "Sân chơi {name}. Khám phá thư viện mã hóa và giải mã {name}.",
	"tthraj": "Câu hỏi Thường gặp cho {name}.",
	"tt0xns": "Độ Dài Tối Thiểu",
	"tt962m": "Danh sách chặn",
	"ttphab": "Thêm từ tùy chỉnh của bạn, cách nhau bởi khoảng trắng...",
	"ttk7bh": "Sử dụng danh sách chặn mặc định",
	"tt1k1p": "Mặc định",
	"tt42u5": "Ngắn",
	"ttqaex": "Dài",
	"tttiif": "Chữ cái",
	"tt5lcu": "Chữ thường",
	"tt75vr": "Chữ hoa",
	"ttd8qn": "Danh sách",
	"ttfoqd": "Mã hóa",
	"ttsekq": "Giải mã",
	"tt8xb0": "Mã hóa nhiều",
	"ttfoed": "Mã hóa thêm số 0",
	"ttc6o9": "Mã hóa hằng số lớn",
	"ttx14w": "ID",
	"ttb79k": "Mã hóa các số này:",
	"ttwpve": "Sẽ tạo ra:",
	"ttrufg": "Giải mã ID này:",
	"ttj4t7": "Bảng chữ cái phải có ít nhất {count} ký tự",
	"ttoq48": "Các khoảng trắng trong bảng chữ cái sẽ bị bỏ qua",
	"ttznht": "Các từ trong danh sách chặn ít hơn {count} ký tự sẽ bị bỏ qua",
	"tt3dhz": "chặn",
	"ttmzby": "Chung",
	"tttigf": "Nó tốt cho gì?",
	"ttebza": "Nó không tốt cho gì?",
	"ttlybc": "Tôi có thể mã hóa nhiều số cùng một lúc không?",
	"ttgvw4": "Các ID được tạo ra có duy nhất không?",
	"ttakn1": "Hạn chế nào mà {name} có?",
	"ttznvt": "Đóng góp",
	"ttn0mi": "Những vấn đề cần lưu ý",
	"ttis6o": "Làm thế nào để tạo các ID của tôi trở nên duy nhất?",
	"ttytv6": "Làm thế nào để xáo trộn bảng chữ cái mặc định?",
	"tt6fl3": "Nên sử dụng bảng chữ cái ngắn hay dài hơn?",
	"tthg1j": "Bảng chữ cái của tôi có thể chỉ bao gồm các số không?",
	"tt0wis": "Tôi có thể sử dụng biểu tượng cảm xúc như là bảng chữ cái không?",
	"tt93lm": "Tại sao phải thêm giá trị đệm cho các ID?",
	"ttpj1b": "Tại sao phải thêm giá trị đệm cho các ID?",
	"ttkrkh": "Tôi có thể làm cho các ID được tạo ra dài hơn không?",
	"tt1jbp": "Tôi có thể làm cho các ID được tạo ra có độ dài cụ thể không?",
	"tt4lv5": "Tại sao sử dụng danh sách chặn?",
	"ttq1ax": "Làm thế nào để danh sách chặn hoạt động?",
	"tttoof": "Có những từ nào trong danh sách chặn mặc định?",
	"tt5c9u": "Điều gì xảy ra khi tất cả các ID đều bị chặn?",
	"tt7u2r": "Làm thế nào để kiểm tra xem các ID có hợp lệ không?",
	"ttd0xn": "Điều gì xảy ra khi danh sách chặn mặc định được cập nhật?",
	"ttf8xd": "Mã hóa các số khác nhau có thể tạo ra các ID giống nhau không?",
	"ttsahq": "Ứng dụng {name} là gì?",
	"tt8wk0": "Tại sao {hashids} đã được nâng cấp thành {name}?",
	"ttf8ad": "Tại sao tham số {salt} đã bị loại bỏ?",
	"ttc389": "Liệu {hashids} có tương thích với {name} không?",
	"ttxp5w": "Làm thế nào để nâng cấp từ {hashids} lên {name} một cách an toàn?",
	"ttbrmk": "Ở đâu có thể tìm thấy các thư viện {hashids} gốc?",
	"ttwb2e": "Làm thế nào để đóng góp?",
	"ttrvdg": "Làm thế nào để chuyển {name} sang một ngôn ngữ khác?",
	"ttj5f7": "{name} là một thư viện mã nguồn mở nhỏ có thể tạo ra các ID ngắn, duy nhất và có vẻ ngẫu nhiên từ các số.",
	"ttox58": "Cách tốt nhất để nghĩ về nó là như một trình chuyển đổi từ thập phân sang hệ thống số Hexadecimal, nhưng có một vài tính năng bổ sung.",
	"ttzijt": "Rút ngắn liên kết, tạo ID sự kiện duy nhất cho việc ghi nhật ký, tạo ID cho sản phẩm/đối tượng trên trang web (như YouTube làm cho video), tạo ID ngắn cho tin nhắn văn bản, mã xác nhận trong email, v.v.",
	"tt3njz": "Bất kỳ dữ liệu nào nhạy cảm. Các ID được tạo ra không phải là các mã băm và có thể giải mã trở lại thành số. Ví dụ, chúng có thể không phải là lựa chọn tốt cho ID người dùng, vì khi giải mã, chúng có thể tiết lộ số lượng người dùng của ứng dụng của bạn.",
	"ttmtky": "Có. {name} có thể mã hóa một hoặc nhiều số không âm thành một ID duy nhất. Không có giới hạn về số lượng số bạn có thể mã hóa, nhưng có giới hạn về số lớn bạn có thể mã hóa (tùy thuộc vào ngôn ngữ triển khai).",
	"ttto4f": "Điều này hữu ích với một số lý do: bạn có thể mã hóa một dấu thời gian UNIX và tạo ID có hạn, hoặc bạn có thể mã hóa một số khu vực cơ sở dữ liệu cùng với một khóa chính và tiết kiệm số lần truy vấn cơ sở dữ liệu.",
	"ttekta": "Có, các ID được tạo ra là duy nhất đối với đầu vào và bảng chữ cái.",
	"ttl6kc": "Nhớ rằng bảng chữ cái mặc định chứa cả chữ hoa và chữ thường, vì vậy ID mặc định là có phân biệt chữ hoa, chữ thường.",
	"ttg2e4": "{name} không thể mã hóa các số âm.",
	"ttahi1": "Độ dài tối thiểu của bảng chữ cái là {length} ký tự.",
	"ttzi2t": "Bảng chữ cái không thể chứa bất kỳ ký tự đa byte nào.",
	"ttnsyi": "{name} không thể tạo ra ID đến một độ dài cụ thể, chỉ đạt ít nhất một độ dài cụ thể. Phạm vi tham số độ dài tối thiểu nằm giữa {min} và {max}.",
	"ttiq3o": "{name} có thể cố gắng tái tạo các ID đến độ dài bảng chữ cái, trừ một.",
	"ttyf26": "Thư viện chấp nhận bảng chữ cái tùy chỉnh từ đó có thể tạo ra các ID. Đơn giản là trộn trước bảng chữ cái mặc định được cung cấp.",
	"tt6dc3": "Xin hãy nhớ rằng với đủ nỗ lực, ai đó có thể phục hồi bảng chữ cái đã trộn của bạn, vì vậy điều này hoàn toàn không phải là một kỹ thuật để ẩn dữ liệu nhạy cảm.",
	"tth4pj": "Bảng chữ cái mặc định có thể được tìm thấy [tại đây]({url}).",
	"tt0eos": "Bạn có thể sử dụng bất kỳ công cụ trộn chuỗi trực tuyến nào hoặc [sân chơi của chúng tôi](/playground).",
	"tt9zcm": "Tùy thuộc vào trường hợp sử dụng của bạn. Bảng chữ cái ngắn sẽ tạo ra ID dài hơn và bảng chữ cái dài sẽ tạo ra ID ngắn hơn. Bạn có thể sử dụng [sân chơi](/playground) để kiểm tra xem ID của bạn có thể trông như thế nào.",
	"ttp7pb": "Có. Nhớ rằng các ID được tạo ra vẫn là chuỗi và chúng có thể bắt đầu bằng số không.",
	"ttk4jh": "Không. {name} không hỗ trợ các ký tự đa byte cho bảng chữ cái. Điều này bao gồm cả biểu tượng cảm xúc cũng như nhiều ký tự khác.",
	"tt17kp": "Thư viện có thể mở rộng các ID với các ký tự rác để làm cho chúng trở nên dài hơn. Điều này hữu ích để không dễ nhận ra liệu bạn có đang mã hóa một số nhỏ như {min} hay một số lớn như {max}.",
	"tt4c25": "Việc giải mã không bị ảnh hưởng.",
	"ttqp1x": "Có, thư viện chấp nhận một tham số độ dài tối thiểu đảm bảo rằng các ID sẽ ít nhất có độ dài đó.",
	"ttt88f": "Vui lòng lưu ý rằng không có đảm bảo về độ dài của ID của bạn - chỉ là chúng sẽ không ngắn hơn độ dài bạn chỉ định.",
	"tt59mu": "Đến một mức độ.",
	"tt7vlr": "Thiết lập độ dài tối đa là không thể vì sớm muộn, ID của bạn sẽ tràn khi có đầu vào đủ lớn. Đó là lý do tại sao chỉ hỗ trợ tham số độ dài tối thiểu và độ dài chính xác hoặc độ dài tối đa không được hỗ trợ.",
	"ttdswn": "Một danh sách chặn có thể ngăn các từ cụ thể không xuất hiện trong ID của bạn. Điều này có ích vì các ID được tạo ra dự kiến sẽ xuất hiện ở những nơi công cộng, như URL.",
	"ttf0wd": "{name} đi kèm với [danh sách chặn mặc định]({url}) chứa những từ tục tĩu và không phù hợp cơ bản từ nhiều ngôn ngữ. Bạn có thể mở rộng danh sách đó bằng các từ của riêng bạn, tất nhiên.",
	"tts1jq": "So khớp từ trong danh sách chặn không phân biệt hoa thường.",
	"tt8eh0": "Các từ ngắn ít hơn 3 ký tự sẽ không bị chặn. Từ dài 3 ký tự phải trùng khớp chính xác với ID. Từ dài 4 ký tự trở lên sẽ kích hoạt khớp nếu chúng là một phần của ID.",
	"ttf01d": "Nếu từ trong danh sách chặn chứa số (leetspeak), chúng chỉ kích hoạt khớp nếu chúng ở đầu hoặc cuối ID.",
	"ttcz09": "Danh sách chặn mặc định chứa những từ tục tĩu và không phù hợp phổ biến từ nhiều ngôn ngữ. Bạn có thể tìm danh sách đầy đủ [tại đây]({url}).",
	"ttxbuw": "Khi ID được tạo ra trùng với một từ trong danh sách chặn, thư viện sẽ cố gắng tái tạo nó.",
	"ttbgyk": "Nếu mọi nỗ lực tái tạo ID đều thất bại, hàm mã hóa sẽ thất bại và trả về một lỗi. Việc xử lý lỗi đó là trách nhiệm của người dùng.",
	"ttwkle": "Cách tốt nhất để giảm số lần tái tạo là có một bảng chữ cái dài hơn, không thiết lập độ dài tối thiểu và cung cấp một danh sách chặn nhỏ hơn. Cung cấp một danh sách chặn trống sẽ tắt tính năng hoàn toàn.",
	"ttr2ng": "Giải mã các ID thường tạo ra một loại đầu ra số, nhưng điều đó không nhất thiết có nghĩa là ID đó là chuẩn. Để kiểm tra xem ID có hợp lệ hay không, bạn có thể mã hóa lại các số đã giải mã và kiểm tra xem ID có trùng khớp không.",
	"ttjud7": "Lý do không tự động là nếu danh sách chặn mặc định thay đổi trong tương lai, chúng tôi không muốn tự động vô hiệu hóa ID đã được tạo ra trong quá khứ và có thể hiện đang trùng khớp với từ mới trong danh sách chặn.",
	"ttowu8": "Chúng tôi sẽ chắc chắn cập nhật {changelog} khi và nếu danh sách chặn mặc định thay đổi.",
	"ttzo7t": "Bạn phải tính đến các tình huống có thể xuất hiện từ khóa mới trong danh sách chặn mặc định. Trong trường hợp này, việc mã hóa lại các số có thể tạo ra một ID khác nhau.",
	"tt3i7z": "Cách tốt nhất để đảm bảo ID của bạn giữ nguyên trong các cập nhật tương lai là cung cấp một danh sách chặn tùy chỉnh, ngay cả khi nó giống với danh sách chặn mặc định hiện tại.",
	"ttmfhy": "Không, mã hóa các số khác nhau sẽ tạo ra các ID duy nhất.",
	"ttt85f": "Tuy nhiên, do thiết kế của thuật toán, giải mã các ID ngẫu nhiên đôi khi có thể tạo ra cùng các số. Cách tốt nhất để kiểm tra xem ID có phải là chuẩn là đơn giản là mã hóa lại các số đã giải mã và kiểm tra xem ID có trùng khớp không.",
	"ttehfa": "{hashids} là phiên bản đầu tiên của thư viện này được phát hành khoảng năm 2013. Nó cũng tạo ra các ID ngắn nhưng sử dụng một phương pháp hơi khác.",
	"ttl3hc": "{hashids} xử lý một số điều khác nhau.",
	"ttgla4": "Nó không hỗ trợ một danh sách chặn tùy chỉnh, mà thay vào đó dựa vào những từ tục tĩu tiếng Anh phổ biến nhất. Nó cũng sử dụng tham số {salt} để xáo trộn bảng chữ cái, điều này làm cho nó hơi khó hiểu vì thư viện không liên quan đến việc mã hóa. Ngoài ra, nó sử dụng quá nhiều ký tự dành riêng dẫn đến việc tạo ra các ID dài hơn.",
	"ttajo1": "Do đó, chúng tôi đã quyết định nâng cấp và đổi tên. Thuật toán đã được đơn giản hóa, một vài tính năng đã được thêm và các kho mã nguồn đều được tập trung ở [một nơi]({url}).",
	"ttzolt": "Tham số {salt} được sử dụng để xáo trộn bảng chữ cái, và không bao giờ được dùng để liên kết với bảo mật. Cả {hashids} và {name} hoạt động tương tự như cách chuyển đổi từ hệ thập phân sang hệ hexa nhưng với một số điều chỉnh. Không có việc mã hóa nào cả, vì vậy để tránh hiểu lầm, tham số đó đã bị loại bỏ hoàn toàn.",
	"ttnq6i": "Không, {name} mở rộng tính năng của {hashids} và có các mục tiêu thiết kế & yêu cầu khác nhau; do đó, các ID được tạo ra không tương thích với {hashids}.",
	"ttixzo": "Vì không có tính tương thích giữa {hashids} và {name}, việc đơn giản là thay thế {hashids} bằng {name} là không thể.",
	"ttydl6": "Tuy nhiên, bạn có thể kết hợp cả hai bằng cách phân biệt xem ID nào thuộc về thư viện nào.",
	"tt6n93": "Một trong các cách để làm điều đó là bằng độ dài ID - nếu bạn chuyển sang {name}, bạn có thể cung cấp một độ dài tối thiểu cao hơn. Một cách khác là thêm/bổ sung thủ công một ký tự tùy chỉnh vào các ID mới được tạo ra.",
	"tth5bj": "Cuối cùng, bạn cũng có thể thử giải mã một ID với {hashids} để xem xem có hợp lệ không. Nếu không - giải mã và mã hóa lại với {name} để xem xem có hoạt động không.",
	"tt0a8s": "Mỗi phiên bản ngôn ngữ trên trang web này đều liên kết đến kho mã nguồn gốc của {hashids} nếu có.",
	"tt9t9m": "Nếu bạn muốn hỗ trợ dự án, chúng tôi rất đánh giá việc bạn đánh dấu các kho của chúng tôi trên Github để tăng hiển thị.",
	"ttpgkb": "Nếu bạn là một nhà phát triển và không thấy bản triển khai của {name} cho một ngôn ngữ cụ thể, vui lòng giúp chúng tôi chuyển đổi thư viện. Điều tương tự cũng áp dụng cho một ngôn ngữ lập trình không được liệt kê.",
	"ttk57h": "Nếu bạn thấy lỗi trong thông số kỹ thuật hoặc bất kỳ bản triển khai nào, vui lòng tạo một vấn đề hoặc yêu cầu kéo với một sửa đổi đề xuất trong kho mã nguồn tương ứng.",
	"tt1rhp": "Nếu bạn nói nhiều ngôn ngữ, chúng tôi có thể cần sự giúp đỡ của bạn để [điều chỉnh danh sách chặn]({blocklist}) và [điều chỉnh bản dịch trang web]({i18n}) nếu bạn nhận thấy bất kỳ vấn đề nào.",
	"tt49l5": "Cuối cùng, nếu bạn có kinh nghiệm với {hashids}/{name}, vui lòng hỗ trợ cộng đồng của chúng tôi bằng cách trả lời bất kỳ câu hỏi nào mà bất kỳ ai có thể có.",
	"ttqbpx": "Nếu bạn muốn chuyển đổi {name} sang một trong những ngôn ngữ sau đây (hoặc một ngôn ngữ mới không được liệt kê ở đây):",
	"ttt00f": "Fork kho chính thức đến tài khoản Github của bạn & thực hiện [thông số kỹ thuật]({spec}) cùng với tất cả các bài kiểm tra. Bạn có thể tái sử dụng bất kỳ README nào có sẵn ([ví dụ]({example})).",
	"tt5myu": "Khi thư viện đã sẵn sàng, tạo một yêu cầu kéo. Khi hợp nhất, chúng tôi sẽ cập nhật trang web.",
	"tt72cr": "Nếu kho không có người duy trì hoạt động, chúng tôi rất vui mừng mời bạn tham gia quản lý kho và trở thành người duy trì chính thức.",
	"ttdqen": "Nếu bạn là một chuyên gia về những điều sau, vui lòng liên hệ nếu bạn muốn chuyển đổi thư viện:",
	"ttfsed": "Không tìm thấy",
	"ttsp7q": "Khác",
	"tt8aj0": "Thử:",
	"ttfspd": "[{clickhouse}]({url1}) cung cấp các hàm SQL tích hợp để tạo {name} với các tham số mặc định. Chức năng này đã có từ phiên bản {clickhouse} [{version}]({url2})."
}
